[
  {
    "database": "food_inspection",
    "stmts": [
      "On June 16, 2015, Curry Up Now, located at 100 Montgomery St in San Francisco, underwent a Routine - Unscheduled food inspection and received a high score of 96.0. The business is owned by Akuranvyka USA Inc.",
      "Eight businesses have received both a \"Routine - Unscheduled\" inspection and have low-risk violations.",
      "There are 56 businesses that have either 'New Ownership' or 'New Construction' inspection types but do not have any associated high-risk violations.",
      "There are five unique businesses that have both violations and inspections recorded."
    ],
    "rightIdx": []
  },
  {
    "database": "food_inspection",
    "stmts": [
      "The postal code of the business with the highest inspection score is 94112.",
      "There are 17 businesses with a high-risk violation.",
      "There are 168 businesses that have had inspections without a recorded score.",
      "The average inspection score of businesses with the \"H25\" tax code is 86.15873015873017."
    ],
    "rightIdx": []
  },
  {
    "database": "food_inspection",
    "stmts": [
      "98.3957219251337% of businesses have at least one violation recorded in the dataset.",
      "On August 19, 2016, The Sweet House, owned by Kelly Guo and Tay Hai Tran, received a perfect food inspection score of 100 during a Routine - Unscheduled inspection. The business is located at 1814 Clement St, S.F., 94121.",
      "There are 179 businesses that have had violations without any inspection records.",
      "On June 11, 2014, La Taqueria Guadalajara, located at 919 Skyline Dr., San Francisco, CA 94110, underwent a routine, unscheduled food inspection and received a score of 72. The establishment is owned by Pablo Patino & Jesus Patino."
    ],
    "rightIdx": []
  },
  {
    "database": "food_inspection",
    "stmts": [
      "There are 33 businesses that have either 'New Ownership' or 'New Construction' inspection types but do not have any associated high-risk violations.",
      "There are 113 businesses with a high-risk violation.",
      "On June 16, 2015, Popeyes Chicken & Biscuits, located at 659 Valencia St in San Francisco, underwent a Routine - Unscheduled food inspection and received a high score of 96.0. The business is owned by Akuranvyka USA Inc.",
      "The average inspection score for businesses located in San Francisco (SF) is 89.15384615384616."
    ],
    "rightIdx": [
      1
    ]
  },
  {
    "database": "food_inspection",
    "stmts": [
      "There were two inspections that resulted in violations for businesses located in San Francisco.",
      "Raintree Cafe underwent a Routine - Unscheduled inspection on September 4, 2014, and received a score of 86.0. It is located at 118 West Portal Ave, SF, 94117.",
      "There are 58 businesses with a high-risk violation.",
      "The business with the available business certificate data that has received the highest inspection score is LAW SCHOOL CAFE."
    ],
    "rightIdx": [
      3
    ]
  },
  {
    "database": "food_inspection",
    "stmts": [
      "On March 18, 2015, the SFDH - Banquet Main Kitchen located at 450 Powell St 2nd Floor, San Francisco, received a score of 96.0 during a routine, unscheduled food inspection, and is owned by Huskies Lessee LLC.",
      "There are 112 businesses, identified by their names, that have received a routine inspection score above 90.",
      "The business with the available business certificate data that has received the highest inspection score is Quickly.",
      "Forty-six businesses have received both a \"Routine - Unscheduled\" inspection and have low-risk violations."
    ],
    "rightIdx": [
      0,
      3
    ]
  },
  {
    "database": "food_inspection",
    "stmts": [
      "The average inspection score for businesses with a listed phone number is 91.8.",
      "Noodle City, located in San Francisco at Pier 39  204, received a score of 92.0 during a routine unscheduled inspection on November 12, 2013. The business is owned by Yuan Xiu Li.",
      "On June 3, 2016, Yong Fong Co., located at 612 Clement St, SF 94118, underwent a Routine - Unscheduled food inspection and received a score of 98.0.",
      "The average inspection score for businesses located in San Francisco (SF) is 90.28260869565217."
    ],
    "rightIdx": [
      2,
      3
    ]
  },
  {
    "database": "food_inspection",
    "stmts": [
      "101.06382978723406% of businesses have at least one violation recorded in the dataset.",
      "Two hundred eight businesses have received a routine inspection score.",
      "The average inspection score for businesses located in San Francisco (SF) is 89.71428571428571.",
      "Four hundred thirteen businesses have received a routine inspection score."
    ],
    "rightIdx": [
      3
    ]
  },
  {
    "database": "food_inspection",
    "stmts": [
      "The average inspection score for businesses with a listed phone number is 90.88679245283019.",
      "The average inspection score of businesses with the \"H25\" tax code is 87.824.",
      "On October 15, 2013, Curry Up Now located at 659 Valencia St, SF was inspected in a Routine - Unscheduled review and received a score of 94. The business is owned by Akuranvyka USA Inc., situated at 35 Stonepine Road, Hillsborough, CA 94010.",
      "98.15078236130867% of businesses have at least one violation recorded in the dataset."
    ],
    "rightIdx": [
      0,
      1,
      2,
      3
    ]
  },
  {
    "database": "food_inspection",
    "stmts": [
      "The average inspection score of businesses with the \"H25\" tax code is 85.25806451612904.",
      "Noodle City, located in San Francisco at 1165 Powell St, received a score of 92.0 during a routine unscheduled inspection on November 12, 2013. The business is owned by Sterling M. Enterprises, Inc..",
      "Fifty-two businesses have received a routine inspection score.",
      "The postal code of the business with the highest inspection score is 94111."
    ],
    "rightIdx": []
  },
  {
    "database": "food_inspection",
    "stmts": [
      "On August 19, 2016, The Sweet House, owned by Kelly Guo and Tay Hai Tran, received a perfect food inspection score of 100 during a New Ownership inspection. The business is located at 3512 BALBOA St, S.F., 94121.",
      "Raintree Cafe underwent a Routine - Unscheduled inspection on September 4, 2014, and received a score of 86.0. It is located at 118 West Portal Ave, SF, 94127.",
      "The average inspection score for businesses located in San Francisco is 88.625.",
      "The postal code of the business with the highest inspection score is 94117."
    ],
    "rightIdx": [
      1,
      3
    ]
  },
  {
    "database": "food_inspection",
    "stmts": [
      "The average inspection score for businesses located in San Francisco is 89.25862068965517.",
      "There are 97 businesses that have either 'New Ownership' or 'New Construction' inspection types but do not have any associated high-risk violations.",
      "There are 336 businesses that have had violations without any inspection records.",
      "The business with the available business certificate data that has received the highest inspection score is YICK'S LIQUOR."
    ],
    "rightIdx": [
      0,
      1
    ]
  },
  {
    "database": "food_inspection",
    "stmts": [
      "Noodle City, located in San Francisco at 1165 Powell St, received a score of 92.0 during a routine unscheduled inspection on November 12, 2013. The business is owned by Yuan Xiu Li.",
      "On August 19, 2016, The Sweet House, owned by Kelly Guo and Tay Hai Tran, received a perfect food inspection score of 100 during a Routine - Unscheduled inspection. The business is located at 3512 BALBOA St, S.F., 94121.",
      "There are 81 businesses that have had inspections without a recorded score.",
      "There are 563 businesses that have had violations without any inspection records."
    ],
    "rightIdx": [
      0,
      1,
      3
    ]
  },
  {
    "database": "food_inspection",
    "stmts": [
      "There are no unique businesses that have both violations and inspections recorded.",
      "The average inspection score for businesses located in San Francisco is 88.8125.",
      "There are 323 businesses that have had inspections without a recorded score.",
      "There are 458 businesses that have been inspected and are managed by owners residing outside of San Francisco."
    ],
    "rightIdx": [
      2,
      3
    ]
  },
  {
    "database": "food_inspection",
    "stmts": [
      "On June 11, 2014, La Taqueria Guadalajara, located at 744 Washington St, San Francisco, CA 94110, underwent a routine, unscheduled food inspection and received a score of 72. The establishment is owned by Pablo Patino & Jesus Patino.",
      "There are 58 businesses that have been inspected and are managed by owners residing outside of San Francisco.",
      "On October 15, 2013, Curry Up Now located at 659 Valencia St, SF was inspected in a Routine - Unscheduled review and received a score of 94. The business is owned by Akuranvyka USA Inc., situated at 35 Stonepine Road, Hillsborough, CA 94110.",
      "There was one inspection that resulted in a violation for businesses located in San Francisco."
    ],
    "rightIdx": []
  },
  {
    "database": "food_inspection",
    "stmts": [
      "On June 3, 2016, Yong Fong Co., located at 239 Kearny St, SF 94118, underwent a Routine - Unscheduled food inspection and received a score of 98.0.",
      "There were six inspections that resulted in violations for businesses located in San Francisco.",
      "On March 18, 2015, the SFDH - Banquet Main Kitchen located at 631 O'Farrell St, San Francisco, received a score of 96.0 during a routine, unscheduled food inspection, and is owned by Huskies Lessee LLC.",
      "On June 11, 2014, La Taqueria Guadalajara, located at 3146 24th St, San Francisco, CA 94110, underwent a routine, unscheduled food inspection and received a score of 72. The establishment is owned by Pablo Patino & Jesus Patino."
    ],
    "rightIdx": [
      1,
      3
    ]
  },
  {
    "database": "food_inspection",
    "stmts": [
      "Montesacro underwent a Routine - Unscheduled inspection on September 4, 2014, and received a score of 86.0. It is located at 118 West Portal Ave, SF, 94127.",
      "There are 230 businesses, identified by their names, that have received a routine inspection score above 90.",
      "The average inspection score for businesses with a listed phone number is 90.27118644067797.",
      "On October 15, 2013, Curry Up Now located at 3583 16th St, SF was inspected in a Routine - Unscheduled review and received a score of 94. The business is owned by Akuranvyka USA Inc., situated at 35 Stonepine Road, Hillsborough, CA 94010."
    ],
    "rightIdx": [
      1
    ]
  },
  {
    "database": "food_inspection",
    "stmts": [
      "There are 127 unique businesses that have both violations and inspections recorded.",
      "Zero businesses have received both a \"Routine - Unscheduled\" inspection and have low-risk violations.",
      "There are 29 businesses, identified by their names, that have received a routine inspection score above 90.",
      "On June 3, 2016, Yong Fong Co., located at 612 Clement St, San Francisco 94118, underwent a Routine - Unscheduled food inspection and received a score of 98.0."
    ],
    "rightIdx": [
      0
    ]
  },
  {
    "database": "mental_health_survey",
    "stmts": [
      "The most common question asked in the 2019 survey was whether your anonymity was protected if you chose to take advantage of mental health or substance abuse treatment resources with previous employers.",
      "In the 2014 mental health survey, the respondent identified as Male in response to the question, \"What is your gender?\".",
      "In the 2018 survey, 341 participants provided an answer other than -1.",
      "In the 2014 mental health survey, the participant answered \"-1\" to the question \"What is your age?\"."
    ],
    "rightIdx": [
      0,
      1,
      2
    ]
  },
  {
    "database": "mental_health_survey",
    "stmts": [
      "Fifteen unique users have discussed their mental health with coworkers across all surveys.",
      "In the mental health survey for 2014, the respondent answered \"35\" to the question \"What is your age?\".",
      "In the mental health survey for 2014, the respondent answered \"35\" to the question \"Has your employer ever formally discussed mental health (for example, as part of a wellness campaign or other official communication)?\".",
      "The mental health survey for 2017 had the least number of answers for the question \"Have you ever been diagnosed with a mental health disorder?\""
    ],
    "rightIdx": [
      1
    ]
  },
  {
    "database": "mental_health_survey",
    "stmts": [
      "In the mental health survey for 2014, the respondent answered \"Male\" to the question \"What is your age?\".",
      "There are 696 unique users who participated in all the surveys combined.",
      "The most commonly answered question across all surveys was whether the employer provides mental health benefits as part of healthcare coverage.",
      "In the 2014 mental health survey, the response to the question \"What is your gender?\" was \"Male.\""
    ],
    "rightIdx": [
      2,
      3
    ]
  },
  {
    "database": "mental_health_survey",
    "stmts": [
      "In the 2014 mental health survey, the participant answered \"29\" to the question \"What is your age?\".",
      "In the mental health survey for 2014, the response to the question \"What is your age?\" was \"29\".",
      "Three different states or territories were mentioned by participants in the 2014 survey.",
      "The most commonly answered question across all surveys was about the respondent's age."
    ],
    "rightIdx": [
      0,
      1
    ]
  },
  {
    "database": "mental_health_survey",
    "stmts": [
      "In the 2014 mental health survey, a respondent answered \"United States\" to the question \"Does your employer offer resources to learn more about mental health disorders and options for seeking help?\"",
      "The total number of survey responses related to the perception of mental health support in the industry is 54.",
      "In the 2018 survey, 133 participants provided an answer other than -1.",
      "The total number of users who responded to any question in the 2017 mental health survey is 566."
    ],
    "rightIdx": [
      1
    ]
  },
  {
    "database": "mental_health_survey",
    "stmts": [
      "There were 319 unique users who participated in the 2019 survey.",
      "There were 76 distinct questions answered in the 2018 mental health survey.",
      "In the 2014 mental health survey, the respondent identified as Male in response to the question, \"How willing would you be to share with friends and family that you have a mental illness?\".",
      "In the 2014 mental health survey, the question \"What is your age?\" was answered with \"54\"."
    ],
    "rightIdx": [
      0,
      1,
      3
    ]
  },
  {
    "database": "mental_health_survey",
    "stmts": [
      "There were 59 distinct questions answered in the 2018 mental health survey.",
      "In the 2014 mental health survey, the question \"What is your age?\" was answered with \"Don't know\".",
      "In the 2014 mental health survey, the question \"Would you bring up a mental health issue with a potential employer in an interview?\" was answered with \"54\".",
      "In the 2014 mental health survey, the respondent identified as Pennsylvania in response to the question, \"What is your gender?\"."
    ],
    "rightIdx": []
  },
  {
    "database": "mental_health_survey",
    "stmts": [
      "In the 2014 mental health survey, the participant answered \"29\" to the question \"Do you have a family history of mental illness?\".",
      "Seven unique users have discussed their mental health with coworkers across all surveys.",
      "In the mental health survey for 2014, the response to the question \"What country do you live in?\" was \"29\".",
      "The total number of users who responded to any question in the 2017 mental health survey is 307."
    ],
    "rightIdx": []
  },
  {
    "database": "mental_health_survey",
    "stmts": [
      "The most common question asked in the 2019 survey was about the overall importance your previous employer placed on mental health.",
      "In the 2014 mental health survey, the response to the question \"If you have a mental health disorder, how often do you feel that it interferes with your work when not being treated effectively (i.e., when you are experiencing symptoms)?\" was \"Male.\"",
      "In the 2014 mental health survey, a respondent answered \"United States\" to the question \"Do you feel that being identified as a person with a mental health issue would hurt your career?\"",
      "There are 2,489 unique users who participated in all the surveys combined."
    ],
    "rightIdx": []
  },
  {
    "database": "mental_health_survey",
    "stmts": [
      "Fifty-six unique users have discussed their mental health with coworkers across all surveys.",
      "There were 1,259 users who participated in the 2016 survey.",
      "In the 2014 mental health survey, a respondent answered \"United States\" to the question \"What country do you live in?\"",
      "There were 267 users who participated in the 2016 survey."
    ],
    "rightIdx": [
      0,
      1,
      2
    ]
  },
  {
    "database": "mental_health_survey",
    "stmts": [
      "The most commonly answered question across all surveys was regarding the number of employees in the respondent's company or organization.",
      "The mental health survey for 2018 had the least number of answers for the question \"Have you ever been diagnosed with a mental health disorder?\"",
      "The mental health survey for 2019 had the least number of answers for the question \"Have you ever been diagnosed with a mental health disorder?\"",
      "There are 3,409 unique users who participated in all the surveys combined."
    ],
    "rightIdx": [
      2,
      3
    ]
  },
  {
    "database": "mental_health_survey",
    "stmts": [
      "In the 2018 survey, 69 participants provided an answer other than -1.",
      "The total number of users who responded to any question in the 2017 mental health survey is 714.",
      "Eight different states or territories were mentioned by participants in the 2014 survey.",
      "There were 245 unique users who participated in the 2019 survey."
    ],
    "rightIdx": [
      1
    ]
  },
  {
    "database": "mental_health_survey",
    "stmts": [
      "In the 2014 mental health survey, the response to the question \"Have you ever been diagnosed with a mental health disorder?\" was \"Male.\"",
      "The most common question asked in the 2019 survey was to describe the conversation you had with your previous coworkers about your mental health, including their reactions.",
      "The total number of survey responses related to the perception of mental health support in the industry is 10.",
      "In the mental health survey for 2014, the response to the question \"Do you know the options for mental health care your employer provides?\" was \"29\"."
    ],
    "rightIdx": []
  },
  {
    "database": "mental_health_survey",
    "stmts": [
      "There were 71 distinct questions answered in the 2018 mental health survey.",
      "There were 940 users who participated in the 2016 survey.",
      "The total number of survey responses related to the perception of mental health support in the industry is 6.",
      "There were 122 unique users who participated in the 2019 survey."
    ],
    "rightIdx": []
  },
  {
    "database": "retail_complains",
    "stmts": [
      "There are 43 unique clients who have both filed complaints and had interactions recorded in the call center logs.",
      "Seventy-four unique clients have had events related to a credit card issue.",
      "On October 10, 2014, a product named Eagle National Mortgage received a 5-star rating in Wichita, Florida, which is part of the Midwest region.",
      "On April 9, 2017, in Wichita, MA, a customer gave Eagle National Mortgage a 5-star review, praising their knowledgeable staff and positive experience during the loan process."
    ],
    "rightIdx": [
      0
    ]
  },
  {
    "database": "retail_complains",
    "stmts": [
      "On May 17, 2013, Kira Julietta Carranza, a 75-year-old female from Wichita, New Jersey, filed a complaint regarding issues with deposits and withdrawals in her savings account, a sub-product of bank account services. The complaint was submitted via phone, and the company provided a timely response with monetary relief. The issue was closed without any dispute from the consumer.",
      "On February 28, 2017, Lennox Oliver Drake, a 39-year-old male from Yonkers, MA, initiated a complaint about an issue related to the opening, closing, or management of a bank account or service. The complaint was submitted via phone and the company responded with a closure and explanation on the same day. The response was marked as timely.",
      "On October 10, 2014, a product named Eagle National Mortgage received a 5-star rating in New Britain, Kansas, which is part of the Midwest region.",
      "On August 5, 2014, Juliette Esmeralda Thompson, a 28-year-old female from New York City, NY, submitted a complaint via phone regarding issues with a checking account related to account opening, closing, or management services. The company's response was to close the complaint with an explanation, which was done in a timely manner, and the consumer did not dispute this resolution."
    ],
    "rightIdx": [
      3
    ]
  },
  {
    "database": "retail_complains",
    "stmts": [
      "On May 17, 2013, Kira Julietta Carranza, a 75-year-old female from Wichita, Kansas, filed a complaint regarding issues with deposits and withdrawals in her savings account, a sub-product of bank account services. The complaint was submitted via phone, and the company provided a timely response with monetary relief. The issue was closed without any dispute from the consumer.",
      "There are two unique products that have been reviewed in the 'Midwest' region.",
      "Two hundred nine unique clients have had events related to a credit card issue.",
      "There is one unique product that has been reviewed in the 'Midwest' region."
    ],
    "rightIdx": [
      0,
      2
    ]
  },
  {
    "database": "retail_complains",
    "stmts": [
      "On April 19, 2012, a complaint was received from Kyler Sylvester Chambers, a 49-year-old male from Somerville, regarding an issue with a bank account service related to account opening, closing, or management. The complaint was submitted via phone and was tagged as concerning an Older American. The company responded in a timely manner, closing the complaint without relief, and the consumer did not dispute this resolution.",
      "On December 3, 2013, Skyler Ramses Dillard, a 37-year-old female from Nashua, New Hampshire, submitted a complaint regarding issues with the management of her checking account associated with a bank account or service. The complaint was submitted via phone, and the company responded in a timely manner by closing the issue with an explanation. The consumer did not dispute the resolution.",
      "On December 3, 2013, Skyler Addalyn Dillard, a 37-year-old female from Little Rock, New Hampshire, submitted a complaint regarding issues with the management of her checking account associated with a bank account or service. The complaint was submitted via phone, and the company responded in a timely manner by closing the issue with an explanation. The consumer did not dispute the resolution.",
      "The average age of clients who made calls to the call center is approximately 55.37."
    ],
    "rightIdx": []
  },
  {
    "database": "retail_complains",
    "stmts": [
      "On May 28, 2014, Brooklyn Alia Godfrey, a 58-year-old female from Hartford, Connecticut, submitted a complaint via phone regarding issues with deposits and withdrawals in her checking account, categorized under bank account or service. The complaint was sent to the company on June 3, 2014, and was closed with an explanation, but she disputed the response.",
      "There are three unique products that have been reviewed in the 'Midwest' region.",
      "Twelve complaints were received for clients living in the 'Northeast' region.",
      "On May 28, 2014, Brooklyn Kailynn Godfrey, a 58-year-old female from Houston, Connecticut, submitted a complaint via phone regarding issues with deposits and withdrawals in her checking account, categorized under bank account or service. The complaint was sent to the company on June 3, 2014, and was closed with an explanation, but she disputed the response."
    ],
    "rightIdx": [
      1
    ]
  },
  {
    "database": "retail_complains",
    "stmts": [
      "Twenty-five unique clients have had events related to a credit card issue.",
      "On October 10, 2014, a product named Eagle National Mortgage received a 5-star rating in Wichita, Kansas, which is part of the Midwest region.",
      "On May 17, 2013, Molly Julietta Carranza, a 75-year-old female from Wichita, Kansas, filed a complaint regarding issues with deposits and withdrawals in her savings account, a sub-product of bank account services. The complaint was submitted via phone, and the company provided a timely response with monetary relief. The issue was closed without any dispute from the consumer.",
      "On April 9, 2017, in Wichita, KS, a customer gave Eagle National Mortgage a 5-star review, praising their knowledgeable staff and positive experience during the loan process."
    ],
    "rightIdx": [
      1,
      3
    ]
  },
  {
    "database": "retail_complains",
    "stmts": [
      "The average number of complaints per state is approximately 1.55.",
      "On April 19, 2012, a complaint was received from Kyler Sylvester Chambers, a 49-year-old male from New York City, regarding an issue with a bank account service related to account opening, closing, or management. The complaint was submitted via phone and was tagged as concerning an Older American. The company responded in a timely manner, closing the complaint without relief, and the consumer did not dispute this resolution.",
      "The average number of complaints per state is approximately 1.67.",
      "On February 28, 2017, Lennox Oliver Drake, a 39-year-old male from Yonkers, NY, initiated a complaint about an issue related to the opening, closing, or management of a bank account or service. The complaint was submitted via phone and the company responded with a closure and explanation on the same day. The response was marked as timely."
    ],
    "rightIdx": [
      1,
      3
    ]
  },
  {
    "database": "retail_complains",
    "stmts": [
      "The average age of clients who made calls to the call center is approximately 47.67.",
      "Twenty-seven complaints were received for clients living in the 'Northeast' region.",
      "The total number of complaints from clients in the region where the district ID 25 is located is nine.",
      "On August 5, 2014, Juliette Esmeralda Chambers, a 28-year-old female from New York City, NY, submitted a complaint via phone regarding issues with a checking account related to account opening, closing, or management services. The company's response was to close the complaint with an explanation, which was done in a timely manner, and the consumer did not dispute this resolution."
    ],
    "rightIdx": [
      1,
      2
    ]
  },
  {
    "database": "retail_complains",
    "stmts": [
      "The average age of clients who made calls to the call center is approximately 51.47.",
      "On February 28, 2017, Lennox Oliver Blevins, a 39-year-old male from Yonkers, NY, initiated a complaint about an issue related to the opening, closing, or management of a bank account or service. The complaint was submitted via phone and the company responded with a closure and explanation on the same day. The response was marked as timely.",
      "On May 28, 2014, Brooklyn Kailynn Godfrey, a 58-year-old female from Hartford, Connecticut, submitted a complaint via phone regarding issues with deposits and withdrawals in her checking account, categorized under bank account or service. The complaint was sent to the company on June 3, 2014, and was closed with an explanation, but she disputed the response.",
      "There are 16 unique clients who have both filed complaints and had interactions recorded in the call center logs."
    ],
    "rightIdx": [
      0,
      2
    ]
  },
  {
    "database": "retail_complains",
    "stmts": [
      "Five complaints were received for clients living in the 'Northeast' region.",
      "There were 19 complaints resolved timely with explanation from clients in the \"Northeast\" region.",
      "On December 3, 2013, Skyler Addalyn Dillard, a 37-year-old female from Nashua, New Hampshire, submitted a complaint regarding issues with the management of her checking account associated with a bank account or service. The complaint was submitted via phone, and the company responded in a timely manner by closing the issue with an explanation. The consumer did not dispute the resolution.",
      "The total number of complaints from clients in the region where the district ID 25 is located is one."
    ],
    "rightIdx": [
      1,
      2
    ]
  },
  {
    "database": "retail_complains",
    "stmts": [
      "The total number of complaints from clients in the region where the district ID 25 is located is two.",
      "On April 9, 2017, in Wichita, MA, a customer gave Eagle National Mortgage a 5-star review, praising their knowledgeable staff and positive experience during the loan process.",
      "There were 9 complaints resolved timely with explanation from clients in the \"Northeast\" region.",
      "There are 6 unique clients who have both filed complaints and had interactions recorded in the call center logs."
    ],
    "rightIdx": []
  },
  {
    "database": "retail_complains",
    "stmts": [
      "The average number of complaints per state is approximately 2.04.",
      "On April 19, 2012, a complaint was received from Kyler Sylvester Chambers, a 49-year-old male from Pennsylvania City, regarding an issue with a bank account service related to account opening, closing, or management. The complaint was submitted via phone and was tagged as concerning an Older American. The company responded in a timely manner, closing the complaint without relief, and the consumer did not dispute this resolution.",
      "There were 8 complaints resolved timely with explanation from clients in the \"Northeast\" region.",
      "On August 5, 2014, Juliette Esmeralda Thompson, a 28-year-old female from Phoenix, NY, submitted a complaint via phone regarding issues with a checking account related to account opening, closing, or management services. The company's response was to close the complaint with an explanation, which was done in a timely manner, and the consumer did not dispute this resolution."
    ],
    "rightIdx": [
      0
    ]
  },
  {
    "database": "financial",
    "stmts": [
      "There are 80 clients who have both a loan and a card issued to them.",
      "The female client, born on January 31, 1977, holds a classic card issued on December 2, 1998, with an account regularly billed monthly in Chomutov, south Moravia.",
      "The total number of clients who own a card is 256.",
      "A classic card was issued on March 9, 1998, to a male owner born on September 4, 1946, from Cheb in west Bohemia, with a transaction frequency labeled as \"POPLATEK MESICNE\"."
    ],
    "rightIdx": [
      0,
      3
    ]
  },
  {
    "database": "financial",
    "stmts": [
      "A female client born on December 27, 1950, from the district of Tabor in south Moravia, holds an OWNER-type account with a classic card issued on June 7, 1998, with the payment frequency set to monthly.",
      "A junior card was issued on December 6, 1997, to a female owner born on July 3, 1945, in the district of Teplice, located in north Bohemia, with a transaction frequency of type 'POPLATEK PO OBRATU'.",
      "A male cardholder, born on September 14, 1959, from Prague (Rokycany), was issued a classic card on April 11, 1998, which operates with a monthly fee structure under an \"OWNER\" account type.",
      "The total number of transactions made by clients who received a loan is seven."
    ],
    "rightIdx": []
  },
  {
    "database": "financial",
    "stmts": [
      "The average loan amount for clients who own a 'classic' card is 134,133.10.",
      "The total payment amount for Completed loans is 82,627.0.",
      "There are 109 clients who have an account in the same district as their card was issued.",
      "The total loan amount for accounts that have made orders with the k_symbol \"SIPO\" is 107,352."
    ],
    "rightIdx": [
      0
    ]
  },
  {
    "database": "financial",
    "stmts": [
      "A female client born on October 24, 1943, from Pardubice in east Bohemia was issued a classic card type on November 21, 1997, with a monthly fee structure.",
      "The average loan amount for clients who own a 'classic' card is 178,776.00.",
      "A classic card was issued on March 9, 1998, to a male owner born on September 4, 1946, from Cheb in south Moravia, with a transaction frequency labeled as \"POPLATEK MESICNE\".",
      "A classic type card was issued on March 20, 1998, to a male owner born on May 10, 1936. The cardholder resides in Ceska Lipa, north Bohemia, and transactions on the account are billed monthly."
    ],
    "rightIdx": [
      0,
      3
    ]
  },
  {
    "database": "financial",
    "stmts": [
      "There are 219 clients who have an account in the same district as their card was issued.",
      "A male cardholder, born on September 14, 1959, from central Bohemia (Hl.m. Praha), was issued a classic card on April 11, 1998, which operates with a monthly fee structure under an \"OWNER\" account type.",
      "A female client born on October 24, 1943, from Strakonice in east Bohemia was issued a classic card type on November 21, 1997, with a monthly fee structure.",
      "The total number of orders made by clients who have a classic card is zero."
    ],
    "rightIdx": []
  },
  {
    "database": "financial",
    "stmts": [
      "There is 1 client who has both a loan and a card issued to them.",
      "A classic card was issued on December 0, 1997, to a female owner born on July 3, 1945, in the district of Teplice, located in north Bohemia, with a transaction frequency of type 'POPLATEK PO OBRATU'.",
      "A male account holder, born on March 31, 1960, owns a classic card issued on June 11, 1998, with the account managed on a monthly statement frequency.",
      "The total number of orders made by clients who have a classic card is one."
    ],
    "rightIdx": [
      2
    ]
  },
  {
    "database": "financial",
    "stmts": [
      "The total loan amount for accounts that have made orders with the k_symbol \"SIPO\" is 0.",
      "The average loan amount for clients in districts with a higher than average A11 is 132,970.1739130435.",
      "There are 456 clients who have an account in the same district as their card was issued.",
      "The total number of clients who own a card is 128."
    ],
    "rightIdx": [
      1,
      2
    ]
  },
  {
    "database": "financial",
    "stmts": [
      "The female client, born on January 31, 1977, holds a classic card issued on December 2, 1998, with an account regularly billed monthly in Karvina, south Moravia.",
      "The total payment amount for Completed loans is 656,973.0.",
      "A female client born on October 24, 1943, from Hl.m. Praha in east Bohemia was issued a classic card type on November 21, 1997, with a monthly fee structure.",
      "A classic card was issued on March 9, 1998, to a male owner born on September 4, 1946, from Prostejov in west Bohemia, with a transaction frequency labeled as \"POPLATEK MESICNE\"."
    ],
    "rightIdx": [
      1
    ]
  },
  {
    "database": "financial",
    "stmts": [
      "The average loan amount for clients in districts with a higher than average A11 is 197,808.0.",
      "A female client born on December 27, 1950, from the district of Tabor in south Bohemia, holds an OWNER-type account with a classic card issued on June 7, 1998, with the payment frequency set to monthly.",
      "The total number of orders made by clients who have a classic card is thirty-six.",
      "There is one client from Prague with at least one loan."
    ],
    "rightIdx": [
      1,
      2
    ]
  },
  {
    "database": "financial",
    "stmts": [
      "A female client born on December 28, 1950, from the district of Tabor in south Bohemia, holds an OWNER-type account with a classic card issued on June 8, 1998, with the payment frequency set to monthly.",
      "The total loan amount for accounts that have made orders with the k_symbol \"SIPO\" is 3,861,408.",
      "There are 17 clients who have both a loan and a card issued to them.",
      "The total number of transactions made by clients who received a loan is seventy-four."
    ],
    "rightIdx": [
      1,
      3
    ]
  },
  {
    "database": "financial",
    "stmts": [
      "A classic type card was issued on March 20, 1998, to a male owner born on May 10, 1936. The cardholder resides in Domazlice, north Bohemia, and transactions on the account are billed monthly.",
      "The total number of transactions made by clients who received a loan is three.",
      "A classic type card was issued on March 20, 098, to a male owner born on May 10, 036. The cardholder resides in Ceska Lipa, north Bohemia, and transactions on the account are billed monthly.",
      "The total number of clients who own a card is 512."
    ],
    "rightIdx": [
      3
    ]
  },
  {
    "database": "financial",
    "stmts": [
      "The average loan amount for clients who own a 'classic' card is 197,808.00.",
      "A classic card was issued on December 6, 1997, to a female owner born on July 3, 1945, in the district of Teplice, located in north Bohemia, with a transaction frequency of type 'POPLATEK PO OBRATU'.",
      "A male cardholder, born on September 14, 1959, from Prague (Hl.m. Praha), was issued a classic card on April 11, 1998, which operates with a monthly fee structure under an \"OWNER\" account type.",
      "The female client, born on January 31, 1977, holds a classic card issued on December 2, 1998, with an account regularly billed monthly in Blansko, south Moravia."
    ],
    "rightIdx": [
      1,
      2,
      3
    ]
  },
  {
    "database": "financial",
    "stmts": [
      "There are two clients from Prague with at least one loan.",
      "The average loan amount for clients in districts with a higher than average A11 is 122,026.90909090909.",
      "There are eight clients from Prague with at least one loan.",
      "The total payment amount for Completed loans is 170,666.0."
    ],
    "rightIdx": [
      2
    ]
  },
  {
    "database": "card_games",
    "stmts": [
      "The average converted mana cost of cards that have been printed in sets released in the year 2019 is 4.0.",
      "The most common language for the foreign cards available in the dataset is Italian.",
      "The card \"Fruit of Tizerus\" is a common Sorcery in the THB set, illustrated by Daniel Ljunggren. It has a mana cost of {B}. The card's effect is that the target player loses 2 life, and it features an Escape ability costing {3}{B} with the requirement to exile three other cards from your graveyard to recast it from there. The flavor text describes a spiny tree with bitter fruit growing in the realm of Tizerus, outside the palace of Erebos.",
      "The card \"Managorger Kraken\" is a rare Green creature (Kraken) designed by artist Lucas Graciano. It costs {2}{G} mana to play and initially has 1 power and 1 toughness. This card has the ability 'Trample' and gains a +1/+1 counter whenever a player casts a spell."
    ],
    "rightIdx": []
  },
  {
    "database": "card_games",
    "stmts": [
      "The card \"Bartizan Bats\" is a Creature — Bat with the ability to fly, meaning it can't be blocked except by creatures with flying or reach. The card features a flavor text: \"Swimming in coins proved harder than they'd hoped, but dancing was a jingling delight.\" It's illustrated by Nils Hamm.",
      "Sixty-four cards share the same uuid across different formats specified in the legalities table.",
      "In the card game set C16, the mythic card \"Sidar Kondo of Jamuraa\" is a Legendary Creature — Human Knight, illustrated by Ryan Alexander Lee. It has a mana cost of {2}{G}{W}, power of 2, and toughness of 5. The card features abilities like Flanking and Partner and imposes blocking restrictions, making it a formidable option in gameplay.",
      "The earliest released set that contains cards with foreign translations is the Fourth Edition."
    ],
    "rightIdx": [
      2,
      3
    ]
  },
  {
    "database": "card_games",
    "stmts": [
      "The most common release date among the sets that have cards with the keyword \"Trample\" is July 17, 2015.",
      "The Sorcery card \"Stränge des Deliriums\", known in English as \"Delirium Skeins\", costs {4}{G}{G} to cast and causes each player to discard three cards. Illustrated by Aleksi Briclot, this common card conveys a vivid story: \"There came a rush, a sudden fire in the mind. Then the two saw only the sooty fog of madness, heard only the crackling of their last thoughts burning away.\"",
      "The most common language for the foreign cards available in the dataset is Chinese Traditional.",
      "The rare Sorcery card named \"Drowned Secrets,\" illustrated by Alexander Forssberg, costs {1}{U} mana to cast. Its ability allows you to mill two cards whenever you cast a blue spell. This card is available in Arena, MTGO, and paper formats."
    ],
    "rightIdx": []
  },
  {
    "database": "card_games",
    "stmts": [
      "The card \"Fruit of Tizerus\" is a common Sorcery in the THB set, illustrated by Bastien L. Deharme. It has a mana cost of {B}. The card's effect is that the target player loses 2 life, and it features an Escape ability costing {3}{B} with the requirement to exile three other cards from your graveyard to recast it from there. The flavor text describes a spiny tree with bitter fruit growing in the realm of Tizerus, outside the palace of Erebos.",
      "The earliest released set that contains cards with foreign translations is the Seventh Edition.",
      "The `Bioessence Hydra` is a rare Creature — Hydra Mutant card illustrated by Mathias Kollros, available in arena, mtgo, and paper formats. It costs {3}{G}{U}, has a power and toughness of 2/2, and features the Trample ability. It enters the battlefield with a +1/+1 counter for each loyalty counter on planeswalkers you control, and gains additional +1/+1 counters whenever loyalty counters are added to your planeswalkers. The card is printed in Green and Blue, and is also available in Chinese Traditional.",
      "\"Multani, Yavimaya's Avatar\" is a Land - Plains Island card from the Dominiaria set, featuring artwork by Ryan Yee. It has a mana cost of {4}{G}{G}, and comes with the abilities of Reach and Trample. This mythic rarity card allows Multani to gain +1/+1 for each land you control and each land card in your graveyard. For {1}{G}, you can return two lands you control to their owner's hand to bring Multani back from your graveyard to your hand. This card is presented in French."
    ],
    "rightIdx": [
      0
    ]
  },
  {
    "database": "card_games",
    "stmts": [
      "Cards with the rarity \"rare\" have been translated into four unique languages.",
      "There are 4 cards that have foreign translations available in French according to the \"foreign_data\" table.",
      "Cards with the rarity \"rare\" have been translated into nine unique languages.",
      "The rare Enchantment card named \"Drowned Secrets,\" illustrated by Alexander Forssberg, costs {1}{U} mana to cast. Its ability allows you to mill two cards whenever you cast a blue spell. This card is available in Arena, MTGO, and paper formats."
    ],
    "rightIdx": [
      2,
      3
    ]
  },
  {
    "database": "card_games",
    "stmts": [
      "The average converted mana cost of cards that have been printed in sets released in the year 2019 is 5.0.",
      "The `Bioessence Hydra` is a rare Creature — Kraken card illustrated by Mathias Kollros, available in arena, mtgo, and paper formats. It costs {3}{G}{U}, has a power and toughness of 4/4, and features the Trample ability. It enters the battlefield with a +1/+1 counter for each loyalty counter on planeswalkers you control, and gains additional +1/+1 counters whenever loyalty counters are added to your planeswalkers. The card is printed in Green and Blue, and is also available in Chinese Traditional.",
      "The card \"The Wretched\" is a common Sorcery in the THB set, illustrated by Bastien L. Deharme. It has a mana cost of {B}. The card's effect is that the target player loses 2 life, and it features an Escape ability costing {3}{B} with the requirement to exile three other cards from your graveyard to recast it from there. The flavor text describes a spiny tree with bitter fruit growing in the realm of Tizerus, outside the palace of Erebos.",
      "The Sorcery card \"Stränge des Deliriums\", known in English as \"Delirium Skeins\", costs {W} to cast and causes each player to discard three cards. Illustrated by Aleksi Briclot, this common card conveys a vivid story: \"There came a rush, a sudden fire in the mind. Then the two saw only the sooty fog of madness, heard only the crackling of their last thoughts burning away.\""
    ],
    "rightIdx": []
  },
  {
    "database": "card_games",
    "stmts": [
      "\"Multani, Yavimaya's Avatar\" is a Legendary Creature — Elemental Avatar card from the Dominiaria set, featuring artwork by Ryan Yee. It has a mana cost of {4}{G}{G}, and comes with the abilities of Reach and Trample. This mythic rarity card allows Multani to gain +1/+1 for each land you control and each land card in your graveyard. For {1}{G}, you can return two lands you control to their owner's hand to bring Multani back from your graveyard to your hand. This card is presented in French.",
      "\"Multani, Yavimaya's Avatar\" is a Legendary Creature — Elemental Avatar card from the Dominiaria set, featuring artwork by Ryan Yee. It has a mana cost of {4}{W}{W}, and comes with the abilities of Reach and Trample. This mythic rarity card allows Multani to gain +1/+1 for each land you control and each land card in your graveyard. For {1}{W}, you can return two lands you control to their owner's hand to bring Multani back from your graveyard to your hand. This card is presented in French.",
      "The card \"Bartizan Bats\" is a Creature — Bat with the ability to fly, meaning it can't be blocked except by creatures with flying or reach. The card features a flavor text: \"At night, bats will feast on whatever is drawn to lanterns and streetlights.\" It's illustrated by Raymond Swanland.",
      "Cards with the rarity \"rare\" have been translated into three unique languages."
    ],
    "rightIdx": [
      0
    ]
  },
  {
    "database": "card_games",
    "stmts": [
      "In the card game set CNS, the mythic card \"Sidar Kondo of Jamuraa\" is a Legendary Creature — Human Knight, illustrated by Ryan Alexander Lee. It has a mana cost of {2}{G}{W}, power of 2, and toughness of 5. The card features abilities like Flanking and Partner and imposes blocking restrictions, making it a formidable option in gameplay.",
      "There are 23 cards that have foreign translations available in French according to the \"foreign_data\" table.",
      "The most common language for the foreign cards available in the dataset is French.",
      "The average converted mana cost of cards that have been printed in sets released in the year 2019 is 3.1666666666666665."
    ],
    "rightIdx": [
      1,
      2,
      3
    ]
  },
  {
    "database": "card_games",
    "stmts": [
      "There are 10 cards that have foreign translations available in French according to the \"foreign_data\" table.",
      "The most common release date among the sets that have cards with the keyword \"Trample\" is February 6, 2004.",
      "The most common release date among the sets that have cards with the keyword \"Trample\" is May 3, 2019.",
      "One hundred twenty-eight cards share the same uuid across different formats specified in the legalities table."
    ],
    "rightIdx": [
      1,
      3
    ]
  },
  {
    "database": "card_games",
    "stmts": [
      "The card \"Managorger Hydra\" is a rare Green creature (Hydra) designed by artist Lucas Graciano. It costs {2}{G} mana to play and initially has 1 power and 1 toughness. This card has the ability 'Trample' and gains a +1/+1 counter whenever a player casts a spell.",
      "The rare Creature — Trilobite card named \"Drowned Secrets,\" illustrated by Alexander Forssberg, costs {1}{U} mana to cast. Its ability allows you to mill two cards whenever you cast a blue spell. This card is available in Arena, MTGO, and paper formats.",
      "The Sorcery card \"Stränge des Deliriums\", known in English as \"Delirium Skeins\", costs {2}{B} to cast and causes each player to discard three cards. Illustrated by Aleksi Briclot, this common card conveys a vivid story: \"There came a rush, a sudden fire in the mind. Then the two saw only the sooty fog of madness, heard only the crackling of their last thoughts burning away.\"",
      "The card \"Bartizan Bats\" is a Creature — Bat with the ability to fly, meaning it can't be blocked except by creatures with flying or reach. The card features a flavor text: \"At night, bats will feast on whatever is drawn to lanterns and streetlights.\" It's illustrated by Nils Hamm."
    ],
    "rightIdx": [
      0,
      2,
      3
    ]
  },
  {
    "database": "card_games",
    "stmts": [
      "In the card game set M10, the mythic card \"Sidar Kondo of Jamuraa\" is a Legendary Creature — Human Knight, illustrated by Ryan Alexander Lee. It has a mana cost of {2}{G}{W}, power of 2, and toughness of 5. The card features abilities like Flanking and Partner and imposes blocking restrictions, making it a formidable option in gameplay.",
      "Twenty-four cards share the same uuid across different formats specified in the legalities table.",
      "The earliest released set that contains cards with foreign translations is Homelands.",
      "The card \"Managorger Hydra\" is a rare Ureen creature (Hydra) designed by artist Lucas Uraciano. It costs {2}{U} mana to play and initially has 1 power and 1 toughness. This card has the ability 'Trample' and gains a +1/+1 counter whenever a player casts a spell."
    ],
    "rightIdx": []
  },
  {
    "database": "european_football_1",
    "stmts": [
      "The total number of goals scored by teams from Italy as the home team across all seasons is 218.",
      "Sixty-nine matches have been played in the \"Ligue 2\" division.",
      "The Turkish league (Süper Lig) recorded the highest number of games during the 2015 season.",
      "The total number of matches played by Belgian teams as either HomeTeam or AwayTeam in the dataset is twenty-two."
    ],
    "rightIdx": []
  },
  {
    "database": "european_football_1",
    "stmts": [
      "In a Belgian Division 1A match on April 26, 2009, Genk defeated Antalyaspor 3-1 away from home.",
      "On October 4th, 2008, in Belgium's Division 1A, the football match between Red Star and Germinal ended in a draw with a score of 0-0.",
      "In a Belgian Division 1A match on April 26, 2009, Colchester defeated Cercle Brugge 3-1 away from home.",
      "On October 7, 2018, in the Bundesliga league in Deutschland, Konyaspor triumphed over Hoffenheim with a final score of 2-1."
    ],
    "rightIdx": []
  },
  {
    "database": "european_football_1",
    "stmts": [
      "The total number of matches played by Belgian teams as either HomeTeam or AwayTeam in the dataset is six.",
      "On October 7, 2018, in the Bundesliga league in Deutschland, Twente triumphed over Hoffenheim with a final score of 2-1.",
      "The division with the least number of matches played is the Scottish Championship.",
      "On November 4, 2007, in Division 1A of France, Lokeren and Genk played to a 1-1 draw."
    ],
    "rightIdx": [
      2
    ]
  },
  {
    "database": "european_football_1",
    "stmts": [
      "On January 28, 2006, in Belgium's Division 1A, the away team Charleroi defeated the home team Mouscron with a score of 1-0.",
      "On October 4th, 2008, in Belgium's Division 1A, the football match between Kortrijk and Germinal ended in a draw with a score of 0-0.",
      "The total number of goals scored by teams from Italy as the home team across all seasons is 452.",
      "The division with the least number of matches played is the Scottish League One."
    ],
    "rightIdx": [
      0,
      1,
      2
    ]
  },
  {
    "database": "european_football_1",
    "stmts": [
      "On January 28, 2006, in Belgium's Division 1A, the away team Charleroi defeated the home team Bristol Rvs with a score of 1-0.",
      "The Turkish league (Süper Lig) recorded the highest number of games during the 2018 season.",
      "A total of 138 matches have been played in the \"Ligue 2\" division.",
      "On November 4, 2007, in EFL Championship of Belgium, Lokeren and Genk played to a 1-1 draw."
    ],
    "rightIdx": [
      2
    ]
  },
  {
    "database": "european_football_1",
    "stmts": [
      "On January 28, 2006, in Belgium's Ligue 1, the away team Charleroi defeated the home team Mouscron with a score of 1-0.",
      "Thirty-one matches have been played in the \"Ligue 2\" division.",
      "The Turkish league (Süper Lig) recorded the highest number of games during the 2012 season.",
      "The total number of matches played by Belgian teams as either HomeTeam or AwayTeam in the dataset is ninety-four."
    ],
    "rightIdx": [
      2,
      3
    ]
  },
  {
    "database": "european_football_1",
    "stmts": [
      "On October 7, 2018, in the Bundesliga league in Deutschland, Ein Frankfurt triumphed over Hoffenheim with a final score of 2-1.",
      "In a Belgian Division 1A match on April 26, 2009, Genk defeated Cercle Brugge 3-1 away from home.",
      "On November 7, 2020, in the Bundesliga, Mainz and Schalke 04 drew 2-2 in a match held in Deutschland during the 2021 season.",
      "On November 7, 2020, in the Bundesliga, Mainz and Rochdale drew 2-2 in a match held in Deutschland during the 2021 season."
    ],
    "rightIdx": [
      0,
      1,
      2
    ]
  },
  {
    "database": "european_football_1",
    "stmts": [
      "In the 2021 season of Belgium's Division 1A, the match between Roma and Oud-Heverlee Leuven on August 15, 2020, ended in a 1-1 draw.",
      "The division with the least number of matches played is Division 1A.",
      "On October 4th, 2008, in Belgium's Division 1A, the football match between Padova and Germinal ended in a draw with a score of 0-0.",
      "The total number of goals scored by teams from Italy as the home team across all seasons is 64."
    ],
    "rightIdx": []
  },
  {
    "database": "european_football_1",
    "stmts": [
      "In the 2021 season of Belgium's Division 1A, the match between Levadeiakos and Oud-Heverlee Leuven on August 15, 2020, ended in a 1-1 draw.",
      "On October 4, 2009, Standard played against Genk in England's Division 1A, resulting in a 1-0 victory for Standard during the 2010 season.",
      "On November 4, 2007, in Division 1A of Belgium, Lokeren and Genk played to a 1-1 draw.",
      "In the 2021 season of Belgium's Division 1A, the match between Genk and Oud-Heverlee Leuven on August 15, 2020, ended in a 1-1 draw."
    ],
    "rightIdx": [
      2,
      3
    ]
  },
  {
    "database": "movie",
    "stmts": [
      "In the action movie \"National Lampoon's Christmas Vacation,\" which was released on December 1, 1989, and is rated PG-13, Juliette Lewis plays the character of Audrey. The film, which runs for 97 minutes, had a budget of $27 million and grossed $71.32 million. It has a rating of 7.6 from 135,690 reviews, and its plot revolves around the Griswold family's Christmas plans turning into a big disaster. Juliette Lewis, born on June 21, 1973, in Los Angeles, USA, has been recognized as one of Hollywood's most talented and versatile actors.",
      "In the movie `Mission: Impossible - Ghost Protocol`, rated PG-13, Tom Cruise portrayed the character Ethan Hunt in a thrilling storyline where the IMF is implicated in the Kremlin bombing, pushing Ethan and his team to clear the organization's name. The movie, released on December 7, 2011, grossed $694,713,380 against a $145,000,000 budget, has a runtime of 133 minutes, and received an average rating of 7.4 from 434,810 viewers. Tom Cruise, born on July 3, 1962, in Syracuse, USA, rose to fame and is recognized among the top 100 movie stars of all time.",
      "There are one hundred twenty-nine unique actors who have appeared in movies with a PG rating in this dataset.",
      "There are 12 unique genres in movies where actors of more than 68 inches in height played a role."
    ],
    "rightIdx": [
      0,
      1,
      2
    ]
  },
  {
    "database": "movie",
    "stmts": [
      "There are sixty-three unique actors who have appeared in movies with a PG rating in this dataset.",
      "The average net worth of actors who appear in movies with a runtime greater than 120 minutes is 54,086,619.72.",
      "There are 16 unique genres in movies where actors of more than 68 inches in height played a role.",
      "The average runtime of movies that include characters played by actors born in the UK is approximately 134.27 minutes."
    ],
    "rightIdx": [
      1,
      2,
      3
    ]
  },
  {
    "database": "movie",
    "stmts": [
      "In the movie `Mission: Impossible - Ghost Protocol`, rated PG-13, Tom Cruise portrayed the character Ethan Hunt in a thrilling storyline where the IMF is implicated in the Kremlin bombing, pushing Ethan and his team to clear the organization's name. The movie, released on December 7, 2011, grossed $694,713,380 against a $145,000,000 budget, has a runtime of 133 minutes, and received an average rating of 7.4 from 434,810 viewers. Tom Cruise, born on July 3, 1962, in Syracuse, Ireland, rose to fame and is recognized among the top 100 movie stars of all time.",
      "The average runtime of movies that include characters played by actors born in the UK is approximately 137.39 minutes.",
      "In the movie `Cheaper by the Dozen`, rated PG-13, Tom Cruise portrayed the character Ethan Hunt in a thrilling storyline where the IMF is implicated in the Kremlin bombing, pushing Ethan and his team to clear the organization's name. The movie, released on December 7, 2011, grossed $694,713,380 against a $145,000,000 budget, has a runtime of 133 minutes, and received an average rating of 7.4 from 434,810 viewers. Tom Cruise, born on July 3, 1962, in Syracuse, USA, rose to fame and is recognized among the top 100 movie stars of all time.",
      "There are 84 unique actors who appeared in movies with a budget over $100,000,000."
    ],
    "rightIdx": []
  },
  {
    "database": "movie",
    "stmts": [
      "In the action-packed film \"Pirates of the Caribbean: On Stranger Tides\", released on May 14, 2011, Johnny Depp stars as the iconic character Jack Sparrow. The movie, rated PG-13, enjoyed a massive box office success with gross revenue exceeding $1 billion against a $380 million budget. The story follows Jack Sparrow and Barbossa on their quest for the fountain of youth while facing Blackbeard and his daughter. Johnny Depp, born on June 9, 1963, in Owensboro, USA, is celebrated as a versatile actor in Hollywood with a net worth of $150 million. The film boasts a runtime of 136 minutes and has an audience rating of 6.6 with over 455,000 rating counts.",
      "The total gross of all movies wherein actors with unknown height have participated is 4,904,138,342.",
      "In the action-packed film \"Pirates of the Caribbean: On Stranger Tides\", released on May 14, 2011, Johnny Depp stars as the iconic character Hattie Mae Pierce (Big Momma). The movie, rated PG-13, enjoyed a massive box office success with gross revenue exceeding $1 billion against a $380 million budget. The story follows Hattie Mae Pierce (Big Momma) and Barbossa on their quest for the fountain of youth while facing Blackbeard and his daughter. Johnny Depp, born on June 9, 1963, in Owensboro, USA, is celebrated as a versatile actor in Hollywood with a net worth of $150 million. The film boasts a runtime of 136 minutes and has an audience rating of 6.6 with over 455,000 rating counts.",
      "The gross revenue of movies in which actors with a net worth of $100,000,000 or more appeared is $418,994,745."
    ],
    "rightIdx": [
      0
    ]
  },
  {
    "database": "movie",
    "stmts": [
      "There are 10 unique genres in movies where actors of more than 68 inches in height played a role.",
      "The movie with the highest rating among those that featured actors from the USA is Forrest Gump.",
      "There are 45 unique actors who appeared in movies with a budget over $100,000,000.",
      "Richard Gere, an actor born on August 31, 1949, in Berkeley, USA, played the character Edward Lewis in the romantic film \"Pretty Woman,\" released on March 23, 1990. The movie, rated R, tells the story of a man in a legal but hurtful business who falls in love with a beautiful prostitute he hired as an escort, earning a strong rating of 7.0 from 266,405 viewers. The film had a budget of $14 million and grossed an impressive $463 million globally. Gere, known for his humanitarian work, has been in the entertainment industry for many years, bringing depth and charisma to his roles."
    ],
    "rightIdx": []
  },
  {
    "database": "movie",
    "stmts": [
      "The total gross of all movies wherein actors with unknown height have participated is 26,082,024,821.",
      "Danny DeVito played the character Martin Weir in the comedy film `Harry Potter and the Deathly Hallows: Part 2`, which was released on October 20, 1995. The movie follows a mobster who travels to Hollywood to collect a debt and discovers that the movie business is much like his current job.",
      "Richard Gere, an actor born on August 31, 1949, in Philadelphia, USA, played the character Edward Lewis in the romantic film \"Pretty Woman,\" released on March 23, 1990. The movie, rated R, tells the story of a man in a legal but hurtful business who falls in love with a beautiful prostitute he hired as an escort, earning a strong rating of 7.0 from 266,405 viewers. The film had a budget of $14 million and grossed an impressive $463 million globally. Gere, known for his humanitarian work, has been in the entertainment industry for many years, bringing depth and charisma to his roles.",
      "Daryl Hannah, born on December 3, 1960, in Chicago, USA, plays the character Susan Hendler in the comedy film `Grumpy Old Men`, released on December 25, 1993. The movie, rated PG-13, follows a lifelong feud between two neighbors that worsens when a new female neighbor, played by Hannah, moves across the street. The film received a rating of 7.0 from 40,509 reviewers."
    ],
    "rightIdx": [
      0,
      2
    ]
  },
  {
    "database": "movie",
    "stmts": [
      "The average net worth of actors who appear in movies with a runtime greater than 120 minutes is 45,179,487.18.",
      "There are 160 unique actors who appeared in movies with a budget over $100,000,000.",
      "Daryl Hannah, born on December 3, 1960, in Chicago, USA, plays the character Melanie in the comedy film `X2: X-Men United`, released on December 25, 1993. The movie, rated PG-13, follows a lifelong feud between two neighbors that worsens when a new female neighbor, played by Hannah, moves across the street. The film received a rating of 7.0 from 40,509 reviewers.",
      "The total gross of all movies wherein actors with unknown height have participated is 8,509,528,602."
    ],
    "rightIdx": [
      1
    ]
  },
  {
    "database": "movie",
    "stmts": [
      "Ossie Davis, an African American actor born in Cogdell, Georgia, stars as Chuck in the comedy movie 'Superman Returns,' released on December 25, 1993. With a PG-13 rating, the film explores a lifelong feud between two neighbors that worsens with the arrival of a new female neighbor.",
      "Danny DeVito played the character Martin Weir in the comedy film `Jurassic Park III`, which was released on October 20, 1995. The movie follows a mobster who travels to Hollywood to collect a debt and discovers that the movie business is much like his current job.",
      "Richard Gere, an actor born on August 31, 1949, in Princeton, USA, played the character Edward Lewis in the romantic film \"Pretty Woman,\" released on March 23, 1990. The movie, rated R, tells the story of a man in a legal but hurtful business who falls in love with a beautiful prostitute he hired as an escort, earning a strong rating of 7.0 from 266,405 viewers. The film had a budget of $14 million and grossed an impressive $463 million globally. Gere, known for his humanitarian work, has been in the entertainment industry for many years, bringing depth and charisma to his roles.",
      "In the action movie \"National Lampoon's Christmas Vacation,\" which was released on December 1, 1989, and is rated PG-13, Nicolas Cage plays the character of Audrey. The film, which runs for 97 minutes, had a budget of $27 million and grossed $71.32 million. It has a rating of 7.6 from 135,690 reviews, and its plot revolves around the Griswold family's Christmas plans turning into a big disaster. Nicolas Cage, born on June 21, 1973, in Los Angeles, USA, has been recognized as one of Hollywood's most talented and versatile actors."
    ],
    "rightIdx": []
  },
  {
    "database": "movie",
    "stmts": [
      "The movie with the highest rating among those that featured actors from the USA is The Dark Knight.",
      "Ossie Davis, an African American actor born in Cogdell, Georgia, stars as Chuck in the comedy movie 'Grumpy Old Men,' released on December 25, 1993. With a PG-13 rating, the film explores a lifelong feud between two neighbors that worsens with the arrival of a new female neighbor.",
      "There are twenty-seven unique actors who have appeared in movies with a PG rating in this dataset.",
      "The movie with the highest rating among those that featured actors from the USA is Inception."
    ],
    "rightIdx": [
      0,
      1
    ]
  },
  {
    "database": "movie",
    "stmts": [
      "The average runtime of movies that include characters played by actors born in the UK is approximately 136.15 minutes.",
      "The gross revenue of movies in which actors with a net worth of $100,000,000 or more appeared is $2,852,653,464.",
      "The average net worth of actors who appear in movies with a runtime greater than 120 minutes is 66,681,818.18.",
      "Daryl Hannah, born on December 3, 1960, in Chicago, USA, plays the character Melanie in the comedy film `Grumpy Old Men`, released on December 25, 1993. The movie, rated PG-13, follows a lifelong feud between two neighbors that worsens when a new female neighbor, played by Hannah, moves across the street. The film received a rating of 7.0 from 40,509 reviewers."
    ],
    "rightIdx": [
      1,
      3
    ]
  },
  {
    "database": "movie",
    "stmts": [
      "The gross revenue of movies in which actors with a net worth of $100,000,000 or more appeared is $733,554,923.",
      "In the action-packed film \"Pirates of the Caribbean: On Stranger Tides\", released on May 14, 2011, Johnny Depp stars as the iconic character Jack Sparrow. The movie, rated PG-13, enjoyed a massive box office success with gross revenue exceeding $1 billion against a $380 million budget. The story follows Jack Sparrow and Barbossa on their quest for the fountain of youth while facing Blackbeard and his daughter. Johnny Depp, born on June 9, 1963, in Cogdell, USA, is celebrated as a versatile actor in Hollywood with a net worth of $150 million. The film boasts a runtime of 136 minutes and has an audience rating of 6.6 with over 455,000 rating counts.",
      "Amy Hill, an African American actor born in Cogdell, Georgia, stars as Chuck in the comedy movie 'Grumpy Old Men,' released on December 25, 1993. With a PG-13 rating, the film explores a lifelong feud between two neighbors that worsens with the arrival of a new female neighbor.",
      "In the action movie \"National Lampoon's Christmas Vacation,\" which was released on December 1, 1989, and is rated PG, Juliette Lewis plays the character of Audrey. The film, which runs for 97 minutes, had a budget of $27 million and grossed $71.32 million. It has a rating of 7.6 from 135,690 reviews, and its plot revolves around the Griswold family's Christmas plans turning into a big disaster. Juliette Lewis, born on June 21, 1973, in Los Angeles, USA, has been recognized as one of Hollywood's most talented and versatile actors."
    ],
    "rightIdx": []
  },
  {
    "database": "music_tracker",
    "stmts": [
      "The Beastie Boys released a bootleg titled 'Brooklyn Sessions Demos' in 1987, capturing the essence of the 1980s.",
      "The total number of snatched downloads for all torrents that have the \"beats\" tag is 3451.",
      "There are 62 unique artists who have a release that is tagged as \"freely.available\".",
      "There are 29 unique artists who have a release that is tagged as \"freely.available\"."
    ],
    "rightIdx": [
      0,
      1,
      2
    ]
  },
  {
    "database": "music_tracker",
    "stmts": [
      "The album album `maxi dance sensation 2`, featuring various artists, is a pop genre collection released in 1990.",
      "The total number of snatched downloads for all torrents that have the \"beats\" tag is 2188.",
      "There are six unique release types for torrents associated with the tag 'dance'.",
      "The total number of snatched torrents associated with the tag 'rock' is 6543."
    ],
    "rightIdx": [
      2
    ]
  },
  {
    "database": "music_tracker",
    "stmts": [
      "Artist Tony Scott released the dance single \"That's How I'm Living / The Chief\" in 1989.",
      "The artist associated with the album that has the 'freely.available' tag is Topez Kno.",
      "The group B Boys Breakdance, featuring the artist High Fidelity Three, released an atlanta single in 1984.",
      "The total number of snatched torrents associated with the tag 'rock' is 12643."
    ],
    "rightIdx": [
      0,
      3
    ]
  },
  {
    "database": "music_tracker",
    "stmts": [
      "In 1983, Kurtis Blow released an album titled \"The Best Rapper on the Scene\", capturing the essence of the 1980s music era.",
      "The total number of snatched downloads for all torrents that have the \"beats\" tag is 903.",
      "Artist Tony Scott released the folk single \"That's How I'm Living / The Chief\" in 1989.",
      "The artist with the highest number of snatches associated with the tag \"electro\" is High Fidelity Three."
    ],
    "rightIdx": [
      0
    ]
  },
  {
    "database": "music_tracker",
    "stmts": [
      "Janet Jackson released the soul single titled \"alright\" in 1989.",
      "Janet Jackson released the soul album titled \"alright\" in 1989.",
      "Artist Tony Scott released the dance bootleg \"That's How I'm Living / The Chief\" in 1989.",
      "The earliest year a release with the tag \"alternative\" was released is 1989."
    ],
    "rightIdx": [
      0,
      3
    ]
  },
  {
    "database": "music_tracker",
    "stmts": [
      "The single album `maxi dance sensation 2`, featuring various artists, is a pop genre collection released in 1990.",
      "Janet Jackson released the soul single titled \"something to write home about\" in 1989.",
      "The group B Boys Breakdance, featuring the artist High Fidelity Three, released an electro single in 1984.",
      "The total number of snatched torrents associated with the tag 'rock' is 1297."
    ],
    "rightIdx": [
      2
    ]
  },
  {
    "database": "music_tracker",
    "stmts": [
      "The Beastie Boys released a ep titled 'Brooklyn Sessions Demos' in 1987, capturing the essence of the 1980s.",
      "The earliest year a release with the tag \"alternative\" was released is 1991.",
      "There are four unique release types for torrents associated with the tag 'dance'.",
      "The artist with the highest number of snatches associated with the tag \"electro\" is Toro Y Moi."
    ],
    "rightIdx": [
      3
    ]
  },
  {
    "database": "music_tracker",
    "stmts": [
      "The 2010s single \"break the grip of shame\" was released by the artist Paris in 1989.",
      "The earliest year a release with the tag \"alternative\" was released is 2011.",
      "The artist associated with the album that has the 'freely.available' tag is Timeflies.",
      "In 1983, Kurtis Blow released an album titled \"The Best Rapper on the Scene\", capturing the essence of the marseille music era."
    ],
    "rightIdx": [
      2
    ]
  },
  {
    "database": "music_tracker",
    "stmts": [
      "There are three unique release types for torrents associated with the tag 'dance'.",
      "The artist associated with the album that has the 'freely.available' tag is CFCF.",
      "In 1983, Kurtis Blow released an remix titled \"The Best Rapper on the Scene\", capturing the essence of the 1980s music era.",
      "There are 11 unique artists who have a release that is tagged as \"freely.available\"."
    ],
    "rightIdx": []
  },
  {
    "database": "music_tracker",
    "stmts": [
      "The compilation album `maxi dance sensation 2`, featuring various artists, is a pop genre collection released in 1990.",
      "The funk single \"break the grip of shame\" was released by the artist Paris in 1989.",
      "The 1980s single \"break the grip of shame\" was released by the artist Paris in 1989.",
      "The group B Boys Breakdance, featuring the artist High Fidelity Three, released an montreal single in 1984."
    ],
    "rightIdx": [
      0,
      2
    ]
  },
  {
    "database": "social_media",
    "stmts": [
      "Groningen had the lowest average Twitter sentiment score for tweets made in English.",
      "On Tuesday at 5 PM, a tweet originated from Memphis, Tennessee, describing AWS's 51st price reduction, reached approximately 1881 individuals. The sentiment of the post was slightly negative.",
      "There are 6 unique users who have tweeted from Greater London.",
      "The average reach of tweets from users located in Germany is 1011.7333333333333."
    ],
    "rightIdx": [
      0,
      1
    ]
  },
  {
    "database": "social_media",
    "stmts": [
      "There are 9 unique users who have tweeted from Greater London.",
      "Alburtis has the highest average sentiment score for tweets.",
      "On Thursday, a male user from Cologne, North Rhine-Westphalia, Germany, reshared a tweet in English, reaching 13 people.",
      "Male users from the United States have posted 185 tweets."
    ],
    "rightIdx": [
      1,
      2,
      3
    ]
  },
  {
    "database": "social_media",
    "stmts": [
      "On Saturday, January 5th, a tweet in English about a job opportunity for an AWS Cloud Architect in Reston, Virginia, was posted, reaching 439 people but receiving no likes or retweets, with a neutral sentiment.",
      "Provence-Alpes-Cote d'Azur had the lowest average Twitter sentiment score for tweets made in English.",
      "The total number of tweets from female users in the United Kingdom is nine.",
      "Male users from the United States have posted 12 tweets."
    ],
    "rightIdx": [
      2
    ]
  },
  {
    "database": "social_media",
    "stmts": [
      "There were four retweets that originated from France.",
      "Crowthorne has the highest average sentiment score for tweets.",
      "On Tuesday, January 5th, a tweet in English about a job opportunity for an AWS Cloud Architect in Reston, Virginia, was posted, reaching 439 people but receiving no likes or retweets, with a neutral sentiment.",
      "On Thursday at 3 PM, a tweet from Reston, Virginia in the United States asked, \"Is your agency moving apps to the AWS cloud? Learn the 5 things to protect when moving during our @newrelic webinar.\" The tweet was in English and expressed a positive sentiment."
    ],
    "rightIdx": [
      2,
      3
    ]
  },
  {
    "database": "social_media",
    "stmts": [
      "On Friday, the user from Bedford, Massachusetts, United States, tweeted in English at 6 AM. The sentiment around the tweet, \"\"Now Available: Improved Training Course for AWS Developers https://aws.amazon.com/blogs/aws/now-available-improved-training-course-for-aws-developers/Can't wait to take this!\"\", is neutral, reaching 421 people without any retweets or likes.",
      "On Thursday at 3 PM, a tweet from Reston, Virginia in the Italy asked, \"Is your agency moving apps to the AWS cloud? Learn the 5 things to protect when moving during our @newrelic webinar.\" The tweet was in English and expressed a positive sentiment.",
      "The average reach of tweets from users located in Germany is 843.1428571428571.",
      "A male user from Leeds, City and Borough of Leeds, United Kingdom tweeted on Friday at 2 AM about job opportunities: \"Cloud price war: Microsoft slashes Azure price takes pop at AWS hybrid strength http://www.cbronline.com/news/cloud/public/cloud-price-war-microsoft-slashes-azure-price-takes-pop-at-aws-hybrid-strength-4785385\". This tweet reached 688 users."
    ],
    "rightIdx": []
  },
  {
    "database": "social_media",
    "stmts": [
      "Male users from the United States have posted 87 tweets.",
      "A male user from Leeds, City and Borough of Leeds, United Kingdom tweeted on Friday at 2 AM about job opportunities: \"#LeedsJobs DevOps Engineer - Leeds - Chef Puppet AWS - 450+: Vivid Resourcing London - Leeds -... http://jobviewtrack.com/en-gb/job-4849414e4501096c421a470a06040b156744111e0603590b78434a0d010b420622070d1701171622241d19034f5f3c1c1851595710/32e8c922122223c2b171e13b29176ea3.html?affid=7b2e27d9738a79f5&utm_medium=twitter&utm_campaign=search4ukjobs.com&utm_source=twitterfeed #Leeds #Jobs\". This tweet reached 688 users.",
      "On Tuesday, the 5th, in Boston, California, a tweet was posted expressing the pleasure of working with Yottaa's development partner SoftServe Inc. on real-time analytics via AWS.",
      "A male user from Leeds, City and Borough of Leeds, United Kingdom tweeted on Saturday at 2 AM about job opportunities: \"#LeedsJobs DevOps Engineer - Leeds - Chef Puppet AWS - 450+: Vivid Resourcing London - Leeds -... http://jobviewtrack.com/en-gb/job-4849414e4501096c421a470a06040b156744111e0603590b78434a0d010b420622070d1701171622241d19034f5f3c1c1851595710/32e8c922122223c2b171e13b29176ea3.html?affid=7b2e27d9738a79f5&utm_medium=twitter&utm_campaign=search4ukjobs.com&utm_source=twitterfeed #Leeds #Jobs\". This tweet reached 688 users."
    ],
    "rightIdx": [
      1
    ]
  },
  {
    "database": "social_media",
    "stmts": [
      "Boston has the highest average sentiment score for tweets.",
      "A job advertisement tweet in English was posted on a Tuesday from Ashburn, Colorado, United States, stating: \"Senior AWS architect/developer @ Wyoming PA http://www.techfetch.com/JS/JS_view_job.aspx?js=2904730&aid=sn4post&utm_source=amazon&utm_medium=twt&utm_campaign=tfjobs #Jobs #Techjobs\".",
      "The average Klout score for tweets from users in California is 42.93333333333333.",
      "There are 39 unique users who have tweeted from Greater London."
    ],
    "rightIdx": [
      3
    ]
  },
  {
    "database": "social_media",
    "stmts": [
      "A job advertisement tweet in English was posted on a Tuesday from Ashburn, Virginia, United States, stating: \"Senior AWS architect/developer @ Wyoming PA http://www.techfetch.com/JS/JS_view_job.aspx?js=2904730&aid=sn4post&utm_source=amazon&utm_medium=twt&utm_campaign=tfjobs #Jobs #Techjobs\".",
      "The total number of tweets from female users in the United Kingdom is six.",
      "On Wednesday at 3 PM, a tweet from Reston, Virginia in the United States asked, \"Is your agency moving apps to the AWS cloud? Learn the 5 things to protect when moving during our @newrelic webinar.\" The tweet was in English and expressed a positive sentiment.",
      "On Tuesday, the 5th, in Brisbane, Massachusetts, a tweet was posted expressing the pleasure of working with Yottaa's development partner SoftServe Inc. on real-time analytics via AWS."
    ],
    "rightIdx": [
      0
    ]
  },
  {
    "database": "social_media",
    "stmts": [
      "On Tuesday, the 5th, in Boston, Massachusetts, a tweet was posted expressing the pleasure of working with Yottaa's development partner SoftServe Inc. on real-time analytics via AWS.",
      "On Wednesday, January 5th, a tweet in English about a job opportunity for an AWS Cloud Architect in Reston, Virginia, was posted, reaching 439 people but receiving no likes or retweets, with a neutral sentiment.",
      "The total number of unique users who tweeted in California is 86.",
      "On Tuesday at 5 PM, a tweet originated from Shenandoah, Tennessee, describing AWS's 51st price reduction, reached approximately 1881 individuals. The sentiment of the post was slightly negative."
    ],
    "rightIdx": [
      0,
      2
    ]
  },
  {
    "database": "social_media",
    "stmts": [
      "There were eight retweets that originated from France.",
      "The total number of unique users who tweeted in California is 14.",
      "On Thursday, a male user from Cologne, Pennsylvania, Germany, reshared a tweet in English, reaching 13 people.",
      "The total reach of tweets in the English language from Canada is 4468."
    ],
    "rightIdx": []
  },
  {
    "database": "social_media",
    "stmts": [
      "The total number of unique users who tweeted in California is 33.",
      "On Friday, the user from Bedford, Massachusetts, Australia, tweeted in English at 6 AM. The sentiment around the tweet, \"Interested in this job? Take a look: Openings_Cloud Delivery Manager - AWS Azure in NYC NY in New York NY http://bull.hn/l/2N8JY/7 #job\", is neutral, reaching 421 people without any retweets or likes.",
      "The total reach of tweets in the English language from Canada is 6196.",
      "On Tuesday at 5 PM, a tweet originated from Boston, Tennessee, describing AWS's 51st price reduction, reached approximately 1881 individuals. The sentiment of the post was slightly negative."
    ],
    "rightIdx": []
  },
  {
    "database": "social_media",
    "stmts": [
      "The total number of tweets from female users in the United Kingdom is five.",
      "The total reach of tweets in the English language from Canada is 7992.",
      "On Friday, the user from Bedford, Massachusetts, United States, tweeted in English at 6 AM. The sentiment around the tweet, \"Interested in this job? Take a look: Openings_Cloud Delivery Manager - AWS Azure in NYC NY in New York NY http://bull.hn/l/2N8JY/7 #job\", is neutral, reaching 421 people without any retweets or likes.",
      "On Thursday, a male user from Cologne, North Rhine-Westphalia, Australia, reshared a tweet in English, reaching 13 people."
    ],
    "rightIdx": [
      1,
      2
    ]
  },
  {
    "database": "social_media",
    "stmts": [
      "The average Klout score for tweets from users in California is 43.0.",
      "A job advertisement tweet in English was posted on a Tuesday from Ashburn, Virginia, Germany, stating: \"Senior AWS architect/developer @ Wyoming PA http://www.techfetch.com/JS/JS_view_job.aspx?js=2904730&aid=sn4post&utm_source=amazon&utm_medium=twt&utm_campaign=tfjobs #Jobs #Techjobs\".",
      "The average reach of tweets from users located in Germany is 1409.357142857143.",
      "The average Klout score for tweets from users in California is 43.90625."
    ],
    "rightIdx": [
      2,
      3
    ]
  },
  {
    "database": "movielens",
    "stmts": [
      "A 35-year-old female from the USA rated an English movie 2 stars.",
      "The average running time of English movies rated by female users is 3.0 hours.",
      "The average rating given by users for movies directed by directors with d_quality 4 is approximately 3.1172839814815124e+33.",
      "A 25-year-old male from the USA rated an English movie with 3 stars."
    ],
    "rightIdx": [
      0,
      3
    ]
  },
  {
    "database": "movielens",
    "stmts": [
      "A 35-year-old male from the USA, working in a job classified as occupation code 4, rated an English movie released in year 4, with a running time of 3 minutes, with a score of 1.",
      "A 35-year-old male from the USA rated the movie with a score of 1.",
      "The average running time of English movies rated by female users is 2.40625 hours.",
      "A 25-year-old male user from the USA, working in occupation category 2, rated a movie with a running time of 2 hours and in English with a score of 3."
    ],
    "rightIdx": [
      0,
      3
    ]
  },
  {
    "database": "movielens",
    "stmts": [
      "There are 113 movies that involve both a male and female actor in the cast.",
      "A 50-year-old man from the USA rated the English movie with a score of 1.",
      "A 56-year-old male from the USA rated the English-language movie with a score of 3.",
      "A 56-year-old male from the USA rated the English-language movie with a score of 4."
    ],
    "rightIdx": [
      0,
      1,
      2
    ]
  },
  {
    "database": "movielens",
    "stmts": [
      "The average rating for movies directed by directors with a quality score of 4 is approximately 1.0835731596878058 times 10 raised to the power of 118.",
      "There are 11 movies that involve both a male and female actor in the cast.",
      "A 35-year-old female from the UK rated an English movie 2 stars.",
      "A 35-year-old male from the USA, working in a job classified as occupation code 2, rated an English movie released in year 2, with a running time of 3 minutes, with a score of 1."
    ],
    "rightIdx": []
  },
  {
    "database": "movielens",
    "stmts": [
      "A 50-year-old male from the USA, working in a job classified as occupation code 4, rated an English movie released in year 4, with a running time of 3 minutes, with a score of 1.",
      "There are twenty-two unique directors who have directed movies featuring actors with a quality rating of 4.",
      "A 50-year-old man from the UK rated the English movie with a score of 1.",
      "There are one hundred eighty-five unique directors who have directed movies featuring actors with a quality rating of 4."
    ],
    "rightIdx": [
      3
    ]
  },
  {
    "database": "movielens",
    "stmts": [
      "A 56-year-old male user from the USA, working in occupation category 2, rated a movie with a running time of 2 hours and in English with a score of 3.",
      "There are 505 unique users who rated movies that feature actors with a quality score of 3 or higher.",
      "There are fifty-five unique directors who have directed movies featuring actors with a quality rating of 4.",
      "A 25-year-old male rated the English movie with a score of 2."
    ],
    "rightIdx": [
      1,
      3
    ]
  },
  {
    "database": "movielens",
    "stmts": [
      "A 56-year-old male user from the USA, working in occupation category 2, rated a movie with a running time of 2 hours and in English with a score of 3.",
      "The average running time of USA movies that have at least one actor with a quality of 3 is approximately 2.1213 hours.",
      "The average running time of USA movies that have at least one actor with a quality of 3 is approximately 2.0893 hours.",
      "The average rating given by users for movies directed by directors with d_quality 4 is infinite."
    ],
    "rightIdx": [
      2,
      3
    ]
  },
  {
    "database": "movielens",
    "stmts": [
      "A 25-year-old male from the USA rated the movie with a score of 1.",
      "The average rating given by users for movies directed by directors with d_quality 4 is approximately 9.497625830959164e+113.",
      "The average rating for movies directed by directors with a quality score of 4 is infinite.",
      "A 56-year-old male from the USA rated the movie with a score of 1."
    ],
    "rightIdx": [
      0,
      2
    ]
  },
  {
    "database": "movielens",
    "stmts": [
      "There are 34 movies that involve both a male and female actor in the cast.",
      "A 35-year-old female from the other rated an English movie 2 stars.",
      "There are 20 unique users who rated movies that feature actors with a quality score of 3 or higher.",
      "A 50-year-old man from the UK rated the English movie with a score of 1."
    ],
    "rightIdx": []
  },
  {
    "database": "movielens",
    "stmts": [
      "There are 155 unique users who rated movies that feature actors with a quality score of 3 or higher.",
      "The average running time of USA movies that have at least one actor with a quality of 3 is approximately 2.0774 hours.",
      "A 56-year-old male from the USA rated the English-language movie with a score of 5.",
      "The average running time of English movies rated by female users is approximately 2.4444444444444446 hours."
    ],
    "rightIdx": [
      3
    ]
  },
  {
    "database": "movies_4",
    "stmts": [
      "The average vote count for movies released in 2009 that are in the Drama genre is 576.0.",
      "The highest average vote rating for a movie genre across all countries is approximately 7.17.",
      "Joshua D. Comen served as the Visual Effects Producer for the movie \"Ender's Game,\" released on October 23, 2013. The film, based on the classic novel by Orson Scott Card, tells the story of Earth's most gifted children training to defend their home planet in future space wars. It had a production budget of $110,000,000 and grossed $125,537,191. The film carried the tagline, \"R U Agitated?\"",
      "The most common job title in the Crew department is Stunts."
    ],
    "rightIdx": [
      1,
      3
    ]
  },
  {
    "database": "movies_4",
    "stmts": [
      "\"Zwartboek,\" an Adventure film released on November 21, 1996, features an intriguing plot where Captain Picard and the crew of the USS Enterprise E travel back in time to prevent the Borg, a relentless race of cyborgs, from altering history. With the compelling tagline \"Resistance is futile,\" the movie had a budget of $46 million and earned $150 million in revenue, receiving an average vote rating of 7.0.",
      "The runtime of the longest-released movie associated with the Mystery genre is 149 minutes.",
      "http://www.everestmovie.com/Thttp://www.everestmovie.com/hhttp://www.everestmovie.com/ehttp://www.everestmovie.com/ http://www.everestmovie.com/mhttp://www.everestmovie.com/ohttp://www.everestmovie.com/vhttp://www.everestmovie.com/ihttp://www.everestmovie.com/ehttp://www.everestmovie.com/ http://www.everestmovie.com/\"http://www.everestmovie.com/Chttp://www.everestmovie.com/rhttp://www.everestmovie.com/ahttp://www.everestmovie.com/dhttp://www.everestmovie.com/lhttp://www.everestmovie.com/ehttp://www.everestmovie.com/ http://www.everestmovie.com/Whttp://www.everestmovie.com/ihttp://www.everestmovie.com/lhttp://www.everestmovie.com/lhttp://www.everestmovie.com/ http://www.everestmovie.com/Rhttp://www.everestmovie.com/ohttp://www.everestmovie.com/chttp://www.everestmovie.com/khttp://www.everestmovie.com/\"http://www.everestmovie.com/,http://www.everestmovie.com/ http://www.everestmovie.com/rhttp://www.everestmovie.com/ehttp://www.everestmovie.com/lhttp://www.everestmovie.com/ehttp://www.everestmovie.com/ahttp://www.everestmovie.com/shttp://www.everestmovie.com/ehttp://www.everestmovie.com/dhttp://www.everestmovie.com/ http://www.everestmovie.com/ohttp://www.everestmovie.com/nhttp://www.everestmovie.com/ http://www.everestmovie.com/Dhttp://www.everestmovie.com/ehttp://www.everestmovie.com/chttp://www.everestmovie.com/ehttp://www.everestmovie.com/mhttp://www.everestmovie.com/bhttp://www.everestmovie.com/ehttp://www.everestmovie.com/rhttp://www.everestmovie.com/ http://www.everestmovie.com/1http://www.everestmovie.com/0http://www.everestmovie.com/,http://www.everestmovie.com/ http://www.everestmovie.com/1http://www.everestmovie.com/9http://www.everestmovie.com/9http://www.everestmovie.com/9http://www.everestmovie.com/,http://www.everestmovie.com/ http://www.everestmovie.com/ihttp://www.everestmovie.com/nhttp://www.everestmovie.com/ http://www.everestmovie.com/thttp://www.everestmovie.com/hhttp://www.everestmovie.com/ehttp://www.everestmovie.com/ http://www.everestmovie.com/Uhttp://www.everestmovie.com/nhttp://www.everestmovie.com/ihttp://www.everestmovie.com/thttp://www.everestmovie.com/ehttp://www.everestmovie.com/dhttp://www.everestmovie.com/ http://www.everestmovie.com/Shttp://www.everestmovie.com/thttp://www.everestmovie.com/ahttp://www.everestmovie.com/thttp://www.everestmovie.com/ehttp://www.everestmovie.com/shttp://www.everestmovie.com/ http://www.everestmovie.com/ohttp://www.everestmovie.com/fhttp://www.everestmovie.com/ http://www.everestmovie.com/Ahttp://www.everestmovie.com/mhttp://www.everestmovie.com/ehttp://www.everestmovie.com/rhttp://www.everestmovie.com/ihttp://www.everestmovie.com/chttp://www.everestmovie.com/ahttp://www.everestmovie.com/,http://www.everestmovie.com/ http://www.everestmovie.com/ihttp://www.everestmovie.com/shttp://www.everestmovie.com/ http://www.everestmovie.com/ahttp://www.everestmovie.com/ http://www.everestmovie.com/1http://www.everestmovie.com/3http://www.everestmovie.com/2http://www.everestmovie.com/-http://www.everestmovie.com/mhttp://www.everestmovie.com/ihttp://www.everestmovie.com/nhttp://www.everestmovie.com/uhttp://www.everestmovie.com/thttp://www.everestmovie.com/ehttp://www.everestmovie.com/ http://www.everestmovie.com/lhttp://www.everestmovie.com/ohttp://www.everestmovie.com/nhttp://www.everestmovie.com/ghttp://www.everestmovie.com/ http://www.everestmovie.com/fhttp://www.everestmovie.com/ihttp://www.everestmovie.com/lhttp://www.everestmovie.com/mhttp://www.everestmovie.com/.http://www.everestmovie.com/ http://www.everestmovie.com/Ihttp://www.everestmovie.com/thttp://www.everestmovie.com/ http://www.everestmovie.com/phttp://www.everestmovie.com/ohttp://www.everestmovie.com/rhttp://www.everestmovie.com/thttp://www.everestmovie.com/rhttp://www.everestmovie.com/ahttp://www.everestmovie.com/yhttp://www.everestmovie.com/shttp://www.everestmovie.com/ http://www.everestmovie.com/ahttp://www.everestmovie.com/ http://www.everestmovie.com/thttp://www.everestmovie.com/rhttp://www.everestmovie.com/uhttp://www.everestmovie.com/ehttp://www.everestmovie.com/ http://www.everestmovie.com/shttp://www.everestmovie.com/thttp://www.everestmovie.com/ohttp://www.everestmovie.com/rhttp://www.everestmovie.com/yhttp://www.everestmovie.com/ http://www.everestmovie.com/ohttp://www.everestmovie.com/fhttp://www.everestmovie.com/ http://www.everestmovie.com/phttp://www.everestmovie.com/ohttp://www.everestmovie.com/lhttp://www.everestmovie.com/ihttp://www.everestmovie.com/thttp://www.everestmovie.com/ihttp://www.everestmovie.com/chttp://www.everestmovie.com/shttp://www.everestmovie.com/ http://www.everestmovie.com/ahttp://www.everestmovie.com/nhttp://www.everestmovie.com/dhttp://www.everestmovie.com/ http://www.everestmovie.com/ahttp://www.everestmovie.com/rhttp://www.everestmovie.com/thttp://www.everestmovie.com/ http://www.everestmovie.com/ihttp://www.everestmovie.com/nhttp://www.everestmovie.com/ http://www.everestmovie.com/thttp://www.everestmovie.com/hhttp://www.everestmovie.com/ehttp://www.everestmovie.com/ http://www.everestmovie.com/1http://www.everestmovie.com/9http://www.everestmovie.com/3http://www.everestmovie.com/0http://www.everestmovie.com/shttp://www.everestmovie.com/ http://www.everestmovie.com/Uhttp://www.everestmovie.com/Shttp://www.everestmovie.com/Ahttp://www.everestmovie.com/,http://www.everestmovie.com/ http://www.everestmovie.com/chttp://www.everestmovie.com/ehttp://www.everestmovie.com/nhttp://www.everestmovie.com/thttp://www.everestmovie.com/ehttp://www.everestmovie.com/rhttp://www.everestmovie.com/ehttp://www.everestmovie.com/dhttp://www.everestmovie.com/ http://www.everestmovie.com/ahttp://www.everestmovie.com/rhttp://www.everestmovie.com/ohttp://www.everestmovie.com/uhttp://www.everestmovie.com/nhttp://www.everestmovie.com/dhttp://www.everestmovie.com/ http://www.everestmovie.com/ahttp://www.everestmovie.com/ http://www.everestmovie.com/lhttp://www.everestmovie.com/ehttp://www.everestmovie.com/fhttp://www.everestmovie.com/thttp://www.everestmovie.com/ihttp://www.everestmovie.com/shttp://www.everestmovie.com/thttp://www.everestmovie.com/ http://www.everestmovie.com/mhttp://www.everestmovie.com/uhttp://www.everestmovie.com/shttp://www.everestmovie.com/ihttp://www.everestmovie.com/chttp://www.everestmovie.com/ahttp://www.everestmovie.com/lhttp://www.everestmovie.com/ http://www.everestmovie.com/dhttp://www.everestmovie.com/rhttp://www.everestmovie.com/ahttp://www.everestmovie.com/mhttp://www.everestmovie.com/ahttp://www.everestmovie.com/ http://www.everestmovie.com/ahttp://www.everestmovie.com/nhttp://www.everestmovie.com/dhttp://www.everestmovie.com/ http://www.everestmovie.com/ahttp://www.everestmovie.com/thttp://www.everestmovie.com/thttp://www.everestmovie.com/ehttp://www.everestmovie.com/mhttp://www.everestmovie.com/phttp://www.everestmovie.com/thttp://www.everestmovie.com/shttp://www.everestmovie.com/ http://www.everestmovie.com/thttp://www.everestmovie.com/ohttp://www.everestmovie.com/ http://www.everestmovie.com/shttp://www.everestmovie.com/thttp://www.everestmovie.com/ohttp://www.everestmovie.com/phttp://www.everestmovie.com/ http://www.everestmovie.com/ihttp://www.everestmovie.com/thttp://www.everestmovie.com/shttp://www.everestmovie.com/ http://www.everestmovie.com/phttp://www.everestmovie.com/rhttp://www.everestmovie.com/ohttp://www.everestmovie.com/dhttp://www.everestmovie.com/uhttp://www.everestmovie.com/chttp://www.everestmovie.com/thttp://www.everestmovie.com/ihttp://www.everestmovie.com/ohttp://www.everestmovie.com/nhttp://www.everestmovie.com/.http://www.everestmovie.com/ http://www.everestmovie.com/Thttp://www.everestmovie.com/hhttp://www.everestmovie.com/ehttp://www.everestmovie.com/ http://www.everestmovie.com/fhttp://www.everestmovie.com/ihttp://www.everestmovie.com/lhttp://www.everestmovie.com/mhttp://www.everestmovie.com/ http://www.everestmovie.com/hhttp://www.everestmovie.com/ahttp://www.everestmovie.com/shttp://www.everestmovie.com/ http://www.everestmovie.com/rhttp://www.everestmovie.com/ehttp://www.everestmovie.com/chttp://www.everestmovie.com/ehttp://www.everestmovie.com/ihttp://www.everestmovie.com/vhttp://www.everestmovie.com/ehttp://www.everestmovie.com/dhttp://www.everestmovie.com/ http://www.everestmovie.com/ahttp://www.everestmovie.com/ http://www.everestmovie.com/vhttp://www.everestmovie.com/ohttp://www.everestmovie.com/thttp://www.everestmovie.com/ehttp://www.everestmovie.com/ http://www.everestmovie.com/ahttp://www.everestmovie.com/vhttp://www.everestmovie.com/ehttp://www.everestmovie.com/rhttp://www.everestmovie.com/ahttp://www.everestmovie.com/ghttp://www.everestmovie.com/ehttp://www.everestmovie.com/ http://www.everestmovie.com/ohttp://www.everestmovie.com/fhttp://www.everestmovie.com/ http://www.everestmovie.com/7http://www.everestmovie.com/.http://www.everestmovie.com/2http://www.everestmovie.com/,http://www.everestmovie.com/ http://www.everestmovie.com/ihttp://www.everestmovie.com/nhttp://www.everestmovie.com/dhttp://www.everestmovie.com/ihttp://www.everestmovie.com/chttp://www.everestmovie.com/ahttp://www.everestmovie.com/thttp://www.everestmovie.com/ihttp://www.everestmovie.com/nhttp://www.everestmovie.com/ghttp://www.everestmovie.com/ http://www.everestmovie.com/ahttp://www.everestmovie.com/ http://www.everestmovie.com/phttp://www.everestmovie.com/ohttp://www.everestmovie.com/shttp://www.everestmovie.com/ihttp://www.everestmovie.com/thttp://www.everestmovie.com/ihttp://www.everestmovie.com/vhttp://www.everestmovie.com/ehttp://www.everestmovie.com/ http://www.everestmovie.com/rhttp://www.everestmovie.com/ehttp://www.everestmovie.com/chttp://www.everestmovie.com/ehttp://www.everestmovie.com/phttp://www.everestmovie.com/thttp://www.everestmovie.com/ihttp://www.everestmovie.com/ohttp://www.everestmovie.com/nhttp://www.everestmovie.com/.http://www.everestmovie.com/",
      "There are four movies associated with the production company 'Warner Bros.'."
    ],
    "rightIdx": [
      1
    ]
  },
  {
    "database": "movies_4",
    "stmts": [
      "The highest average vote rating for a movie genre across all countries is 7.7.",
      "\"Star Trek: First Contact,\" an Adventure film released on November 21, 1996, features an intriguing plot where Captain Picard and the crew of the USS Enterprise E travel back in time to prevent the Borg, a relentless race of cyborgs, from altering history. With the compelling tagline \"Resistance is futile,\" the movie had a budget of $46 million and earned $150 million in revenue, receiving an average vote rating of 7.0.",
      "Simon Valdimir Varela worked in the Art department as a Production Designer for the movie \"127 Hours.\"",
      "The average budget of movies produced in the United States is $0.00."
    ],
    "rightIdx": [
      1
    ]
  },
  {
    "database": "movies_4",
    "stmts": [
      "Joshua D. Comen served as the Director for the movie \"Ender's Game,\" released on October 23, 2013. The film, based on the classic novel by Orson Scott Card, tells the story of Earth's most gifted children training to defend their home planet in future space wars. It had a production budget of $110,000,000 and grossed $125,537,191. The film carried the tagline, \"This is not a game.\"",
      "There are twelve unique genres associated with movies produced in the United States.",
      "There are five unique genres associated with movies produced in the United States.",
      "Science Fiction is the genre that has the highest average budget for movies in which it is featured."
    ],
    "rightIdx": [
      1
    ]
  },
  {
    "database": "movies_4",
    "stmts": [
      "Mike Medavoy has worked as an Executive Producer on the highest number of movies.",
      "Chad Oman has worked as an Executive Producer on the highest number of movies.",
      "The most common job title in the Crew department is CG Supervisor.",
      "Joshua D. Comen served as the Visual Effects Producer for the movie \"Ender's Game,\" released on October 23, 2013. The film, based on the classic novel by Orson Scott Card, tells the story of Earth's most gifted children training to defend their home planet in future space wars. It had a production budget of $110,000,000 and grossed $125,537,191. The film carried the tagline, \"This is not a game.\""
    ],
    "rightIdx": [
      1,
      3
    ]
  },
  {
    "database": "movies_4",
    "stmts": [
      "Fantasy is the genre that has the highest average budget for movies in which it is featured.",
      "\"Chi bi\" is a Comedy movie released on September 7, 2003. It follows seemingly unrelated people as their lives begin to intertwine while they fall in – and out – of love, with affections languishing and developing as Christmas draws near. Known as \"The ultimate romantic comedy,\" it achieved a revenue of $244,931,766 and has an average vote rating of 7.0.",
      "\"Night at the Museum: Secret of the Tomb\" is an Adventure movie released on December 17, 2014. The film follows an epic quest by Larry Daley (played by Ben Stiller) to save the fading magic powers of The Tablet of Ahkmenrah, uniting beloved and new characters in a global adventure. The movie's tagline, \"One Final Night to Save the Day,\" encapsulates its thrilling narrative. With a runtime of 97 minutes, it received an average rating of 6.1 from viewers.",
      "The movie \"Cradle Will Rock\", released on December 10, 1999, in the United States of America, is a 132-minute long film. It portrays a true story of politics and art in the 1930s USA, centered around a leftist musical drama and attempts to stop its production. The film has received a vote average of 7.2, indicating a positive reception."
    ],
    "rightIdx": [
      2,
      3
    ]
  },
  {
    "database": "movies_4",
    "stmts": [
      "The average vote count for movies released in 2009 that are in the Drama genre is 65.0.",
      "\"Paranormal Activity 2\" is an Adventure movie released on December 17, 2014. The film follows an epic quest by Larry Daley (played by Ben Stiller) to save the fading magic powers of The Tablet of Ahkmenrah, uniting beloved and new characters in a global adventure. The movie's tagline, \"One Final Night to Save the Day,\" encapsulates its thrilling narrative. With a runtime of 97 minutes, it received an average rating of 6.1 from viewers.",
      "There is only one unique genre associated with movies produced in the United States.",
      "The average runtime of movies produced in the United States is 117.5 minutes."
    ],
    "rightIdx": []
  },
  {
    "database": "movies_4",
    "stmts": [
      "\"Love Actually\" is a Comedy movie released on September 7, 2003. It follows seemingly unrelated people as their lives begin to intertwine while they fall in – and out – of love, with affections languishing and developing as Christmas draws near. Known as \"The ultimate romantic comedy,\" it achieved a revenue of $244,931,766 and has an average vote rating of 7.0.",
      "The name of the highest revenue movie produced in the United States is \"Analyze This.\"",
      "The average runtime of movies produced in the United States is 132.0 minutes.",
      "\"Star Trek: First Contact,\" an Crime film released on November 21, 1996, features an intriguing plot where Captain Picard and the crew of the USS Enterprise E travel back in time to prevent the Borg, a relentless race of cyborgs, from altering history. With the compelling tagline \"Resistance is futile,\" the movie had a budget of $46 million and earned $150 million in revenue, receiving an average vote rating of 7.0."
    ],
    "rightIdx": [
      0
    ]
  },
  {
    "database": "movies_4",
    "stmts": [
      "The truth needs no translation.TThe truth needs no translation.hThe truth needs no translation.eThe truth needs no translation. The truth needs no translation.mThe truth needs no translation.oThe truth needs no translation.vThe truth needs no translation.iThe truth needs no translation.eThe truth needs no translation. The truth needs no translation.\"The truth needs no translation.CThe truth needs no translation.rThe truth needs no translation.aThe truth needs no translation.dThe truth needs no translation.lThe truth needs no translation.eThe truth needs no translation. The truth needs no translation.WThe truth needs no translation.iThe truth needs no translation.lThe truth needs no translation.lThe truth needs no translation. The truth needs no translation.RThe truth needs no translation.oThe truth needs no translation.cThe truth needs no translation.kThe truth needs no translation.\"The truth needs no translation.,The truth needs no translation. The truth needs no translation.rThe truth needs no translation.eThe truth needs no translation.lThe truth needs no translation.eThe truth needs no translation.aThe truth needs no translation.sThe truth needs no translation.eThe truth needs no translation.dThe truth needs no translation. The truth needs no translation.oThe truth needs no translation.nThe truth needs no translation. The truth needs no translation.DThe truth needs no translation.eThe truth needs no translation.cThe truth needs no translation.eThe truth needs no translation.mThe truth needs no translation.bThe truth needs no translation.eThe truth needs no translation.rThe truth needs no translation. The truth needs no translation.1The truth needs no translation.0The truth needs no translation.,The truth needs no translation. The truth needs no translation.1The truth needs no translation.9The truth needs no translation.9The truth needs no translation.9The truth needs no translation.,The truth needs no translation. The truth needs no translation.iThe truth needs no translation.nThe truth needs no translation. The truth needs no translation.tThe truth needs no translation.hThe truth needs no translation.eThe truth needs no translation. The truth needs no translation.UThe truth needs no translation.nThe truth needs no translation.iThe truth needs no translation.tThe truth needs no translation.eThe truth needs no translation.dThe truth needs no translation. The truth needs no translation.SThe truth needs no translation.tThe truth needs no translation.aThe truth needs no translation.tThe truth needs no translation.eThe truth needs no translation.sThe truth needs no translation. The truth needs no translation.oThe truth needs no translation.fThe truth needs no translation. The truth needs no translation.AThe truth needs no translation.mThe truth needs no translation.eThe truth needs no translation.rThe truth needs no translation.iThe truth needs no translation.cThe truth needs no translation.aThe truth needs no translation.,The truth needs no translation. The truth needs no translation.iThe truth needs no translation.sThe truth needs no translation. The truth needs no translation.aThe truth needs no translation. The truth needs no translation.1The truth needs no translation.3The truth needs no translation.2The truth needs no translation.-The truth needs no translation.mThe truth needs no translation.iThe truth needs no translation.nThe truth needs no translation.uThe truth needs no translation.tThe truth needs no translation.eThe truth needs no translation. The truth needs no translation.lThe truth needs no translation.oThe truth needs no translation.nThe truth needs no translation.gThe truth needs no translation. The truth needs no translation.fThe truth needs no translation.iThe truth needs no translation.lThe truth needs no translation.mThe truth needs no translation..The truth needs no translation. The truth needs no translation.IThe truth needs no translation.tThe truth needs no translation. The truth needs no translation.pThe truth needs no translation.oThe truth needs no translation.rThe truth needs no translation.tThe truth needs no translation.rThe truth needs no translation.aThe truth needs no translation.yThe truth needs no translation.sThe truth needs no translation. The truth needs no translation.aThe truth needs no translation. The truth needs no translation.tThe truth needs no translation.rThe truth needs no translation.uThe truth needs no translation.eThe truth needs no translation. The truth needs no translation.sThe truth needs no translation.tThe truth needs no translation.oThe truth needs no translation.rThe truth needs no translation.yThe truth needs no translation. The truth needs no translation.oThe truth needs no translation.fThe truth needs no translation. The truth needs no translation.pThe truth needs no translation.oThe truth needs no translation.lThe truth needs no translation.iThe truth needs no translation.tThe truth needs no translation.iThe truth needs no translation.cThe truth needs no translation.sThe truth needs no translation. The truth needs no translation.aThe truth needs no translation.nThe truth needs no translation.dThe truth needs no translation. The truth needs no translation.aThe truth needs no translation.rThe truth needs no translation.tThe truth needs no translation. The truth needs no translation.iThe truth needs no translation.nThe truth needs no translation. The truth needs no translation.tThe truth needs no translation.hThe truth needs no translation.eThe truth needs no translation. The truth needs no translation.1The truth needs no translation.9The truth needs no translation.3The truth needs no translation.0The truth needs no translation.sThe truth needs no translation. The truth needs no translation.UThe truth needs no translation.SThe truth needs no translation.AThe truth needs no translation.,The truth needs no translation. The truth needs no translation.cThe truth needs no translation.eThe truth needs no translation.nThe truth needs no translation.tThe truth needs no translation.eThe truth needs no translation.rThe truth needs no translation.eThe truth needs no translation.dThe truth needs no translation. The truth needs no translation.aThe truth needs no translation.rThe truth needs no translation.oThe truth needs no translation.uThe truth needs no translation.nThe truth needs no translation.dThe truth needs no translation. The truth needs no translation.aThe truth needs no translation. The truth needs no translation.lThe truth needs no translation.eThe truth needs no translation.fThe truth needs no translation.tThe truth needs no translation.iThe truth needs no translation.sThe truth needs no translation.tThe truth needs no translation. The truth needs no translation.mThe truth needs no translation.uThe truth needs no translation.sThe truth needs no translation.iThe truth needs no translation.cThe truth needs no translation.aThe truth needs no translation.lThe truth needs no translation. The truth needs no translation.dThe truth needs no translation.rThe truth needs no translation.aThe truth needs no translation.mThe truth needs no translation.aThe truth needs no translation. The truth needs no translation.aThe truth needs no translation.nThe truth needs no translation.dThe truth needs no translation. The truth needs no translation.aThe truth needs no translation.tThe truth needs no translation.tThe truth needs no translation.eThe truth needs no translation.mThe truth needs no translation.pThe truth needs no translation.tThe truth needs no translation.sThe truth needs no translation. The truth needs no translation.tThe truth needs no translation.oThe truth needs no translation. The truth needs no translation.sThe truth needs no translation.tThe truth needs no translation.oThe truth needs no translation.pThe truth needs no translation. The truth needs no translation.iThe truth needs no translation.tThe truth needs no translation.sThe truth needs no translation. The truth needs no translation.pThe truth needs no translation.rThe truth needs no translation.oThe truth needs no translation.dThe truth needs no translation.uThe truth needs no translation.cThe truth needs no translation.tThe truth needs no translation.iThe truth needs no translation.oThe truth needs no translation.nThe truth needs no translation..The truth needs no translation. The truth needs no translation.TThe truth needs no translation.hThe truth needs no translation.eThe truth needs no translation. The truth needs no translation.fThe truth needs no translation.iThe truth needs no translation.lThe truth needs no translation.mThe truth needs no translation. The truth needs no translation.hThe truth needs no translation.aThe truth needs no translation.sThe truth needs no translation. The truth needs no translation.rThe truth needs no translation.eThe truth needs no translation.cThe truth needs no translation.eThe truth needs no translation.iThe truth needs no translation.vThe truth needs no translation.eThe truth needs no translation.dThe truth needs no translation. The truth needs no translation.aThe truth needs no translation. The truth needs no translation.vThe truth needs no translation.oThe truth needs no translation.tThe truth needs no translation.eThe truth needs no translation. The truth needs no translation.aThe truth needs no translation.vThe truth needs no translation.eThe truth needs no translation.rThe truth needs no translation.aThe truth needs no translation.gThe truth needs no translation.eThe truth needs no translation. The truth needs no translation.oThe truth needs no translation.fThe truth needs no translation. The truth needs no translation.7The truth needs no translation..The truth needs no translation.2The truth needs no translation.,The truth needs no translation. The truth needs no translation.iThe truth needs no translation.nThe truth needs no translation.dThe truth needs no translation.iThe truth needs no translation.cThe truth needs no translation.aThe truth needs no translation.tThe truth needs no translation.iThe truth needs no translation.nThe truth needs no translation.gThe truth needs no translation. The truth needs no translation.aThe truth needs no translation. The truth needs no translation.pThe truth needs no translation.oThe truth needs no translation.sThe truth needs no translation.iThe truth needs no translation.tThe truth needs no translation.iThe truth needs no translation.vThe truth needs no translation.eThe truth needs no translation. The truth needs no translation.rThe truth needs no translation.eThe truth needs no translation.cThe truth needs no translation.eThe truth needs no translation.pThe truth needs no translation.tThe truth needs no translation.iThe truth needs no translation.oThe truth needs no translation.nThe truth needs no translation..The truth needs no translation.",
      "There are nine movies associated with the production company 'Warner Bros.'.",
      "Dorissa Berninger worked in the Art department as a Production Designer for the movie \"The Book of Life.\"",
      "\"Love Actually\" is a Western movie released on September 7, 2003. It follows seemingly unrelated people as their lives begin to intertwine while they fall in – and out – of love, with affections languishing and developing as Christmas draws near. Known as \"The ultimate romantic comedy,\" it achieved a revenue of $244,931,766 and has an average vote rating of 7.0."
    ],
    "rightIdx": [
      1
    ]
  },
  {
    "database": "movies_4",
    "stmts": [
      "\"Enter the Dangerous Mind\" is an Adventure movie released on December 17, 2014. The film follows an epic quest by Larry Daley (played by Ben Stiller) to save the fading magic powers of The Tablet of Ahkmenrah, uniting beloved and new characters in a global adventure. The movie's tagline, \"One Final Night to Save the Day,\" encapsulates its thrilling narrative. With a runtime of 97 minutes, it received an average rating of 6.1 from viewers.",
      "Adventure is the genre that has the highest average budget for movies in which it is featured.",
      "The comedy \"Fun with Dick and Jane,\" released on December 21, 2005, follows the story of Dick Harper and his wife, Jane, as they resort to crime after Dick loses his job, portrayed with a tagline, \"Giving big businesses a run for their money!\". The film had a substantial budget of $100 million and garnered a revenue of over $202 million. It holds a popularity score of 25.159 with an average user rating of 5.9 from 627 votes. ",
      "The runtime of the longest-released movie associated with the Mystery genre is 118 minutes."
    ],
    "rightIdx": [
      1,
      2
    ]
  },
  {
    "database": "movies_4",
    "stmts": [
      "Simon Valdimir Varela worked in the Art department as a Production Designer for the movie \"The Book of Life.\"",
      "The average runtime of movies produced in the United States is 114.37 minutes.",
      "The average budget of movies produced in the United States is approximately $29,916,666.67.",
      "The average vote count for movies released in 2009 that are in the Drama genre is approximately 465.33."
    ],
    "rightIdx": [
      0,
      1,
      3
    ]
  },
  {
    "database": "movies_4",
    "stmts": [
      "The highest average vote rating for a movie genre across all countries is approximately 7.3.",
      "The name of the highest revenue movie produced in the United States is \"Minions.\"",
      "The average budget of movies produced in the United States is approximately $37,662,126.17.",
      "The most common job title in the Crew department is Stunt Coordinator."
    ],
    "rightIdx": [
      1,
      2
    ]
  },
  {
    "database": "movies_4",
    "stmts": [
      "There are three movies associated with the production company 'Warner Bros.'.",
      "The name of the highest revenue movie produced in the United States is \"Cradle Will Rock.\"",
      "The comedy \"The Rugrats Movie,\" released on December 21, 2005, follows the story of Dick Harper and his wife, Jane, as they resort to crime after Dick loses his job, portrayed with a tagline, \"Giving big businesses a run for their money!\". The film had a substantial budget of $100 million and garnered a revenue of over $202 million. It holds a popularity score of 25.159 with an average user rating of 5.9 from 627 votes. ",
      "The comedy \"Mercury Rising,\" released on December 21, 2005, follows the story of Dick Harper and his wife, Jane, as they resort to crime after Dick loses his job, portrayed with a tagline, \"Giving big businesses a run for their money!\". The film had a substantial budget of $100 million and garnered a revenue of over $202 million. It holds a popularity score of 25.159 with an average user rating of 5.9 from 627 votes. "
    ],
    "rightIdx": []
  },
  {
    "database": "cookbook",
    "stmts": [
      "The recipe titled \"Stuffed Fish Turbans\" offers a colorful grilled fish entree with fresh summer fruit, originating from The California Tree Fruit Agreement. This dish features finely chopped waters as a key ingredient. It serves 4 people, with a preparation time of 15 minutes and a cooking time of 30 minutes. The preparation involves combining fruit with waters, cheese, green pepper, and various seasonings, rolling the mixture into fish fillets, and grilling. With a calorie count of around 301 per serving, it's both a nutritious and flavorful option for a meal.",
      "The recipe for \"Apple Bean Cake\" yields one 3-layer cake and serves 12 people. It requires 30 minutes of preparation time, 40 minutes of cooking time, and 10 minutes to stand. This moist cake uses a \"secret\" ingredient, apple butter, as detailed in the introduction. The recipe is sourced from The California Dry Bean Advisory Board and contains 462.68 calories per serving, with key nutritional values including 3.54g of protein, 80.36g of carbohydrates, and 14.12g of total fat. The directions provide step-by-step instructions to create this delightful cake, including greasing the cake pans, preheating the oven, and preparing a coffee icing for layering.",
      "The total sum of calories for all recipes that include onion as an ingredient is 3090.42 calories.",
      "The total number of unique ingredients used across all recipes in the dataset is 42."
    ],
    "rightIdx": [
      1,
      2
    ]
  },
  {
    "database": "cookbook",
    "stmts": [
      "The \"Pasta Shells A La Turkey Waldorf\" is a traditional Southern dessert made with 0.75 cup(s) of evaporated milk, designed to serve 8 people, and prepared in 15 minutes with a 40-minute cook time. This easy recipe, sourced from The Sweet Potato Council of the U.S., combines canned dairy ingredients to create a classic pie that yields 1 full pie.",
      "The \"Squash Rolls\" is a creamy, chunky main dish combining fruit, vegetables, rice, and nuts, suitable for four servings. Sourced from the Hazelnut Marketing Board, the recipe takes approximately 30 minutes each for preparation and cooking. Key ingredients include coarsely chopped onion, integrated into a rich mix enhanced by a thoughtfully prepared roux. With a total of 424.1 calories per serving, this dish promises a satisfying balance of flavors and textures.",
      "The total number of unique ingredients used across all recipes in the dataset is 132.",
      "The total sum of calories for all recipes that include onion as an ingredient is 1129.7 calories."
    ],
    "rightIdx": []
  },
  {
    "database": "cookbook",
    "stmts": [
      "The recipe for \"Apple Bean Cake\" yields one 3-layer cake and serves 12 people. It requires 30 minutes of preparation time, 40 minutes of cooking time, and 10 minutes to stand. This moist cake uses a \"secret\" ingredient, olive oil, as detailed in the introduction. The recipe is sourced from The California Dry Bean Advisory Board and contains 462.68 calories per serving, with key nutritional values including 3.54g of protein, 80.36g of carbohydrates, and 14.12g of total fat. The directions provide step-by-step instructions to create this delightful cake, including greasing the cake pans, preheating the oven, and preparing a coffee icing for layering.",
      "The recipe \"Apricot and Walnut Brown Rice Stuffing,\" sourced from the USA Rice Council, combines dried fruit and leftover brown rice into a delightful side dish or stuffing for poultry. This recipe serves 4 people, taking about 15 minutes to prepare and 30 minutes to cook. It features apricots coarsely chopped into 0.67 head(s) and provides approximately 358.47 calories per serving.",
      "The \"Possible Pumpkin Pie\" recipe from the California Beef Council yields 8 servings and is described as an easy-to-make crustless pie. The preparation time is 15 minutes, with a cooking time of 55 minutes. A crucial ingredient in this recipe is a 12 oz. can of evaporated skim milk, and it's not optional. Each serving contains approximately 207.08 calories, with nutritional content including 6.54 grams of protein, 34.96 grams of carbohydrates, and 4.56 grams of total fat.",
      "The recipe \"Tomatillo Relish\" from the Texas Department of Agriculture uses 1 tablespoon of chopped shallots and is not optional. It serves 6 people and yields 3 cups. To prepare, sweat shallots and garlic in olive oil, add tomatillos and tomatoes, and season with tarragon, salt, pepper, butter, and cognac. The mixture is simmered for 10-15 minutes. The complete dish provides 66.24 calories, with fat contributing 60.48% of the caloric content."
    ],
    "rightIdx": [
      3
    ]
  },
  {
    "database": "cookbook",
    "stmts": [
      "The recipe with the highest percentage of calories from carbohydrates is Stewed Rhubarb.",
      "The recipe with the highest total fat per serving as per the Nutrition table is Lime-Basted Lamb Kabobs.",
      "The average iron content in recipes that include any baking product is approximately 1.608.",
      "The total sum of calories for all recipes that include onion as an ingredient is 1377.46 calories."
    ],
    "rightIdx": []
  },
  {
    "database": "cookbook",
    "stmts": [
      "There are fifteen recipes that list an ingredient from the \"fresh herbs\" category.",
      "The total number of unique ingredients used across all recipes in the dataset is 273.",
      "There are three recipes that include 'margarine' as an ingredient.",
      "The recipe \"Fish and Tomato Zucchini Saffron Coulis\", sourced from The California Dry Bean Advisory Board, features baby zucchini prepared thinly sliced. This dish requires 15 minutes of preparation and 35 minutes of cooking time. Each serving provides approximately 239.47 calories, with robust contributions from protein and carbohydrates. As described, \"The red sauce brightens up the taste and flavor of the steamed fish.\""
    ],
    "rightIdx": [
      0,
      1
    ]
  },
  {
    "database": "cookbook",
    "stmts": [
      "The recipe with the highest total fat per serving as per the Nutrition table is Tropical Stuffed Cornish Hens.",
      "The average sodium content in recipes that include the ingredient \"salt\" is 621.6618181818181 milligrams.",
      "The average iron content in recipes that include any baking product is 1.55.",
      "The \"Hazelnut Medley\" is a creamy, chunky main dish combining fruit, vegetables, rice, and nuts, suitable for four servings. Sourced from the Hazelnut Marketing Board, the recipe takes approximately 30 minutes each for preparation and cooking. Key ingredients include coarsely chopped onion, integrated into a rich mix enhanced by a thoughtfully prepared roux. With a total of 424.1 calories per serving, this dish promises a satisfying balance of flavors and textures."
    ],
    "rightIdx": [
      3
    ]
  },
  {
    "database": "cookbook",
    "stmts": [
      "The recipe with the highest percentage of calories from carbohydrates is Jam.",
      "The total cooking time for the recipe with the highest protein content is 1505 minutes.",
      "The \"Possible Pumpkin Pie\" recipe from the Minnesota Department of Agriculture yields 8 servings and is described as an easy-to-make crustless pie. The preparation time is 15 minutes, with a cooking time of 55 minutes. A crucial ingredient in this recipe is a 12 oz. can of evaporated skim milk, and it's not optional. Each serving contains approximately 207.08 calories, with nutritional content including 6.54 grams of protein, 34.96 grams of carbohydrates, and 4.56 grams of total fat.",
      "The recipe \"Apricot and Walnut Brown Rice Stuffing,\" sourced from the The California Dry Bean Advisory Board, combines dried fruit and leftover brown rice into a delightful side dish or stuffing for poultry. This recipe serves 4 people, taking about 15 minutes to prepare and 30 minutes to cook. It features apricots coarsely chopped into 0.67 cup(s) and provides approximately 358.47 calories per serving."
    ],
    "rightIdx": [
      0,
      1,
      2
    ]
  },
  {
    "database": "cookbook",
    "stmts": [
      "The recipe \"Fish and Tomato Zucchini Saffron Coulis\", sourced from The National Marine Fisheries Service, features baby zucchini prepared thinly sliced. This dish requires 15 minutes of preparation and 35 minutes of cooking time. Each serving provides approximately 239.47 calories, with robust contributions from protein and carbohydrates. As described, \"The red sauce brightens up the taste and flavor of the steamed fish.\"",
      "The average sodium content in recipes that include the ingredient \"salt\" is 529.0699999999999 milligrams.",
      "The recipe with the highest total fat per serving as per the Nutrition table is Ginger-Orange Barbecued Beef Back Ribs.",
      "There are four recipes that include 'margarine' as an ingredient."
    ],
    "rightIdx": [
      2
    ]
  },
  {
    "database": "cookbook",
    "stmts": [
      "The average calorie content of recipes that include \"margarine\" as an ingredient is 184.916.",
      "There are four recipes that list an ingredient from the \"fresh herbs\" category.",
      "The recipe titled \"Stuffed Fish Turbans\" offers a colorful grilled fish entree with fresh summer fruit, originating from Northwest Cherry Growers. This dish features finely chopped onions as a key ingredient. It serves 4 people, with a preparation time of 15 minutes and a cooking time of 30 minutes. The preparation involves combining fruit with onions, cheese, green pepper, and various seasonings, rolling the mixture into fish fillets, and grilling. With a calorie count of around 301 per serving, it's both a nutritious and flavorful option for a meal.",
      "The recipe \"Fish and Tomato Zucchini Saffron Coulis\", sourced from The National Fish & Seafood Promotional Council, features baby zucchini prepared thinly sliced. This dish requires 15 minutes of preparation and 35 minutes of cooking time. Each serving provides approximately 239.47 calories, with robust contributions from protein and carbohydrates. As described, \"The red sauce brightens up the taste and flavor of the steamed fish.\""
    ],
    "rightIdx": [
      0,
      3
    ]
  },
  {
    "database": "cookbook",
    "stmts": [
      "There are two recipes that list an ingredient from the \"fresh herbs\" category.",
      "The average calorie content of recipes that include \"margarine\" as an ingredient is 155.61666666666667.",
      "The recipe titled \"Stuffed Fish Turbans\" offers a colorful grilled fish entree with fresh summer fruit, originating from The California Tree Fruit Agreement. This dish features finely chopped onions as a key ingredient. It serves 4 people, with a preparation time of 15 minutes and a cooking time of 30 minutes. The preparation involves combining fruit with onions, cheese, green pepper, and various seasonings, rolling the mixture into fish fillets, and grilling. With a calorie count of around 301 per serving, it's both a nutritious and flavorful option for a meal.",
      "The \"Hazelnut Medley\" is a creamy, chunky main dish combining fruit, vegetables, rice, and nuts, suitable for four servings. Sourced from the USA Rice Council, the recipe takes approximately 30 minutes each for preparation and cooking. Key ingredients include coarsely chopped onion, integrated into a rich mix enhanced by a thoughtfully prepared roux. With a total of 424.1 calories per serving, this dish promises a satisfying balance of flavors and textures."
    ],
    "rightIdx": [
      2
    ]
  },
  {
    "database": "cookbook",
    "stmts": [
      "The recipe \"Tomatillo Relish\" from the Texas Department of Agriculture uses 1 tablespoon of chopped celerys and is not optional. It serves 6 people and yields 3 cups. To prepare, sweat celerys and garlic in olive oil, add tomatillos and tomatoes, and season with tarragon, salt, pepper, butter, and cognac. The mixture is simmered for 10-15 minutes. The complete dish provides 66.24 calories, with fat contributing 60.48% of the caloric content.",
      "The average iron content in recipes that include any baking product is 1.598.",
      "The \"Southern Sweet Potato Pie\" is a traditional Southern dessert made with 0.75 cup(s) of evaporated milk, designed to serve 8 people, and prepared in 15 minutes with a 40-minute cook time. This easy recipe, sourced from The Sweet Potato Council of the U.S., combines canned dairy ingredients to create a classic pie that yields 1 full pie.",
      "The average protein content per serving across all recipes is approximately 15.15 grams."
    ],
    "rightIdx": [
      1,
      2,
      3
    ]
  },
  {
    "database": "cookbook",
    "stmts": [
      "The average protein content per serving across all recipes is approximately 15.28 grams.",
      "The total cooking time for the recipe with the highest protein content is 180 minutes.",
      "The recipe \"Apricot and Walnut Brown Rice Stuffing,\" sourced from the USA Rice Council, combines dried fruit and leftover brown rice into a delightful side dish or stuffing for poultry. This recipe serves 4 people, taking about 15 minutes to prepare and 30 minutes to cook. It features apricots coarsely chopped into 0.67 cup(s) and provides approximately 358.47 calories per serving.",
      "There are ten recipes that include 'margarine' as an ingredient."
    ],
    "rightIdx": [
      2,
      3
    ]
  },
  {
    "database": "cookbook",
    "stmts": [
      "The \"Possible Pumpkin Pie\" recipe from the Minnesota Department of Agriculture yields 8 servings and is described as an easy-to-make crustless pie. The preparation time is 15 minutes, with a cooking time of 55 minutes. A crucial ingredient in this recipe is a 12 oz. can of chicken breast, and it's not optional. Each serving contains approximately 207.08 calories, with nutritional content including 6.54 grams of protein, 34.96 grams of carbohydrates, and 4.56 grams of total fat.",
      "The \"Poached Fish with Horseradish Sauce\" is a traditional Southern dessert made with 0.75 cup(s) of evaporated milk, designed to serve 8 people, and prepared in 15 minutes with a 40-minute cook time. This easy recipe, sourced from The Sweet Potato Council of the U.S., combines canned dairy ingredients to create a classic pie that yields 1 full pie.",
      "The total cooking time for the recipe with the highest protein content is 105 minutes.",
      "The average sodium content in recipes that include the ingredient \"salt\" is 568.6804761904762 milligrams."
    ],
    "rightIdx": [
      3
    ]
  },
  {
    "database": "cookbook",
    "stmts": [
      "The recipe for \"Apple Bean Cake\" yields one 3-layer cake and serves 12 people. It requires 30 minutes of preparation time, 40 minutes of cooking time, and 10 minutes to stand. This moist cake uses a \"secret\" ingredient, apple butter, as detailed in the introduction. The recipe is sourced from California Beef Council and contains 462.68 calories per serving, with key nutritional values including 3.54g of protein, 80.36g of carbohydrates, and 14.12g of total fat. The directions provide step-by-step instructions to create this delightful cake, including greasing the cake pans, preheating the oven, and preparing a coffee icing for layering.",
      "The average protein content per serving across all recipes is approximately 17.13 grams.",
      "The average calorie content of recipes that include \"margarine\" as an ingredient is 166.77800000000002.",
      "The recipe with the highest percentage of calories from carbohydrates is Lemony Poached Golden Apples."
    ],
    "rightIdx": []
  },
  {
    "database": "sales",
    "stmts": [
      "Salesperson Jay D Alvarez sold 406 units of the product `Stem` at a price of 333.42 per unit to customer Johnson h White.",
      "Salesperson Caleb A. Parker sold 190 units of the LL Road Seat Assembly priced at $133.34 each to customer Johnson H. White.",
      "Jay D. Alvarez sold 406 units of the product `Head Tube` at a price of $333.42 each to Johnson H. White.",
      "Salesperson Jay D Alvarez sold 406 units of the product \"LL Touring Frame - Yellow, 54\" at a price of $333.42 each to customer Johnson H White."
    ],
    "rightIdx": [
      1,
      3
    ]
  },
  {
    "database": "sales",
    "stmts": [
      "The product that has been sold the most times is Hex Nut 16.",
      "Sheena Lal has purchased the highest quantity of products.",
      "The average purchase quantity per customer is 501.189158923379.",
      "Salesperson Jay D Alvarez sold 406 units of the product `LL Touring Frame - Yellow, 54` at a price of 333.42 per unit to customer Johnson h White."
    ],
    "rightIdx": [
      2,
      3
    ]
  },
  {
    "database": "sales",
    "stmts": [
      "Salesperson Marcus T. Clark sold 934 units of LL Mountain Frame - Black, 42 to customer Johnson H. White at a price of $249.79 each.",
      "There are 320 unique products that have been sold based on the sales data.",
      "Andre is the customer who purchased the most expensive product.",
      "The total revenue generated from all sales is $274,185,752.60."
    ],
    "rightIdx": [
      2
    ]
  },
  {
    "database": "sales",
    "stmts": [
      "Salesperson Jay D Reed sold 406 units of the product \"LL Touring Frame - Yellow, 54\" at a price of $333.42 each to customer Johnson H White.",
      "The Mountain-100 Silver generated the most revenue with a total of 38 units sold.",
      "Darryl Hu made the largest purchase in terms of total price of products bought.",
      "Salesperson Thomas D Alvarez sold 406 units of the product `LL Touring Frame - Yellow, 54` at a price of 333.42 per unit to customer Johnson h White."
    ],
    "rightIdx": [
      2
    ]
  },
  {
    "database": "sales",
    "stmts": [
      "Salesperson Caleb A. Parker sold 190 units of the Thin-Jam Hex Nut 1, priced at $133.34 each, to customer Johnson h. White.",
      "Jay D. Alvarez sold 406 units of the product `LL Touring Frame - Yellow, 54` at a price of $333.42 each to Johnson H. Green.",
      "Dalton is the customer who purchased the most expensive product.",
      "The average purchase quantity per customer is 476.4536750116713."
    ],
    "rightIdx": []
  },
  {
    "database": "sales",
    "stmts": [
      "Sheena made the most purchases in terms of quantity.",
      "Caleb A. Parker sold 190 units of the LL Road Seat Assembly at a price of 133.34 each.",
      "Seth Perry has purchased the highest quantity of products.",
      "Salesperson Luke C. Edwards sold 766 units of the product \"Road-450 Red, 44\" to customer Johnson h. White, each priced at $1457.99."
    ],
    "rightIdx": [
      1,
      3
    ]
  },
  {
    "database": "sales",
    "stmts": [
      "Salesperson Natalie C. Edwards sold 766 units of the product \"Road-450 Red, 44\" to customer Johnson h. White, each priced at $1457.99.",
      "The total revenue generated by each sales person is as follows: SalesPersonID 1 generated $7,197,590.64; SalesPersonID 2 generated $8,011,428.46; SalesPersonID 3 generated $3,802,206.65; SalesPersonID 4 generated $1,886,933.80; SalesPersonID 5 generated $4,633,602.13; SalesPersonID 6 generated $5,059,922.28; SalesPersonID 7 generated $7,398,318.35; SalesPersonID 8 generated $13,435,417.92; SalesPersonID 9 generated $8,326,637.75; SalesPersonID 10 generated $3,802,958.31; SalesPersonID 11 generated $3,685,801.14; SalesPersonID 12 generated $9,468,963.61; SalesPersonID 13 generated $9,214,553.47; SalesPersonID 14 generated $6,106,278.92; SalesPersonID 15 generated $1,628,691.41; SalesPersonID 16 generated $5,543,106.08; SalesPersonID 17 generated $3,988,156.42; SalesPersonID 18 generated $3,731,169.92; SalesPersonID 19 generated $9,731,107.49; SalesPersonID 20 generated $7,069,697.20; SalesPersonID 21 generated $4,218,314.07; SalesPersonID 22 generated $4,633,041.84; SalesPersonID 23 generated $3,968,692.29.",
      "Salesperson Caleb A. Parker sold 190 units of the LL Road Seat Assembly, priced at $133.34 each, to customer Johnson h. White.",
      "Caleb A. Parker sold 190 units of tce LL Road Seat Assembly at a price of 133.34 eacc."
    ],
    "rightIdx": [
      2
    ]
  },
  {
    "database": "sales",
    "stmts": [
      "Kristi Saunders has purchased the highest quantity of products.",
      "Salesperson Luke C. Edwards sold 766 units of the product \"Road-450 Red, 44\" to customer Marjorie h. White, each priced at $1457.99.",
      "Seth made the most purchases in terms of quantity.",
      "Jay D. Alvarez sold 406 units of the product `LL Touring Frame - Yellow, 54` at a price of $333.42 each to Johnson H. White."
    ],
    "rightIdx": [
      0,
      3
    ]
  },
  {
    "database": "sales",
    "stmts": [
      "The Road-250 Red generated the most revenue with a total of 48 units sold.",
      "Alvin She has purchased the most different products.",
      "The product that has been sold the most times is Internal Lock Washer 9.",
      "Dalton Coleman made the largest purchase in terms of total price of products bought."
    ],
    "rightIdx": []
  },
  {
    "database": "sales",
    "stmts": [
      "There are 392 unique products that have been sold based on the sales data.",
      "Salesperson Caleb A. Parker sold 190 units of the LL Road Seat Assembly, priced at $133.34 each, to customer Johnson h. Bennet.",
      "The average purchase quantity per customer is 488.05143371324255.",
      "The total revenue generated from all sales is $136,542,590.15."
    ],
    "rightIdx": []
  },
  {
    "database": "sales",
    "stmts": [
      "Samantha Taylor made the largest purchase in terms of total price of products bought.",
      "Salesperson Jay D Byrnes sold 406 units of the product \"LL Touring Frame - Yellow, 54\" at a price of $333.42 each to customer Johnson H White.",
      "Kristi made the most purchases in terms of quantity.",
      "Salesperson Marcus T. Gray sold 934 units of LL Mountain Frame - Black, 42 to customer Jounson H. Wuite at a price of $249.79 eacu."
    ],
    "rightIdx": [
      2
    ]
  },
  {
    "database": "sales",
    "stmts": [
      "The Mountain-100 Silver generated the most revenue with a total of 44 units sold.",
      "Katherine King has purchased the most different products.",
      "Salesperson Marcus T. Gray sold 934 units of LL Mountain Frame - Black, 42 to customer Johnson H. White at a price of $249.79 each.",
      "The total revenue generated by each sales person is as follows: SalesPersonID 1 generated $39,501,949.58; SalesPersonID 2 generated $21,694,693.56; SalesPersonID 3 generated $10,563,680.81; SalesPersonID 4 generated $13,519,799.06; SalesPersonID 5 generated $21,170,788.93; SalesPersonID 6 generated $27,040,409.42; SalesPersonID 7 generated $32,320,217.67; SalesPersonID 8 generated $48,605,597.24; SalesPersonID 9 generated $16,466,648.61; SalesPersonID 10 generated $20,276,017.44; SalesPersonID 11 generated $17,427,830.32; SalesPersonID 12 generated $29,434,830.25; SalesPersonID 13 generated $27,438,438.03; SalesPersonID 14 generated $30,923,890.73; SalesPersonID 15 generated $24,973,617.35; SalesPersonID 16 generated $20,671,025.20; SalesPersonID 17 generated $19,021,823.04; SalesPersonID 18 generated $19,523,996.84; SalesPersonID 19 generated $32,565,865.41; SalesPersonID 20 generated $22,913,973.70; SalesPersonID 21 generated $26,420,099.57; SalesPersonID 22 generated $22,228,907.79; SalesPersonID 23 generated $12,364,466.88."
    ],
    "rightIdx": [
      0,
      1,
      2
    ]
  },
  {
    "database": "sales",
    "stmts": [
      "Salesperson Caleb A. Parker sold 190 units of tre LL Road Seat Assembly priced at $133.34 eacr to customer Jornson H. Write.",
      "Salesperson Caleb A. Alvarez sold 190 units of the LL Road Seat Assembly priced at $133.34 each to customer Johnson H. White.",
      "There are 474 unique products that have been sold based on the sales data.",
      "The total revenue generated from all sales is $1,689,140,227.53."
    ],
    "rightIdx": [
      2,
      3
    ]
  },
  {
    "database": "sales",
    "stmts": [
      "Nathaniel is the customer who purchased the most expensive product.",
      "Caleb A. Parker sold 190 units of the LL Road Frame - Black, 62 at a price of 133.34 each.",
      "The product that has been sold the most times is LL Road Seat/Saddle.",
      "The total revenue generated by each sales person is as follows: SalesPersonID 1 generated $112,673,279.30; SalesPersonID 2 generated $94,645,001.43; SalesPersonID 3 generated $29,303,862.44; SalesPersonID 4 generated $54,406,853.45; SalesPersonID 5 generated $49,754,911.01; SalesPersonID 6 generated $83,097,547.89; SalesPersonID 7 generated $99,312,877.98; SalesPersonID 8 generated $125,358,028.37; SalesPersonID 9 generated $68,828,405.72; SalesPersonID 10 generated $63,348,490.73; SalesPersonID 11 generated $58,263,840.62; SalesPersonID 12 generated $67,341,131.09; SalesPersonID 13 generated $89,518,686.28; SalesPersonID 14 generated $111,141,747.36; SalesPersonID 15 generated $98,403,114.34; SalesPersonID 16 generated $60,076,464.10; SalesPersonID 17 generated $63,944,847.15; SalesPersonID 18 generated $65,085,288.47; SalesPersonID 19 generated $81,996,512.84; SalesPersonID 20 generated $61,770,367.04; SalesPersonID 21 generated $68,267,622.47; SalesPersonID 22 generated $54,162,587.43; SalesPersonID 23 generated $28,438,760.01."
    ],
    "rightIdx": [
      2,
      3
    ]
  },
  {
    "database": "chicago_crime",
    "stmts": [
      "The community area with the highest number of arrests for 'NARCOTICS' related crimes is North Lawndale.",
      "On June 1, 2018, a simple battery incident categorized as domestic occurred at a residence located on the 040XX block of W Division St in the North Lawndale community area on Chicago's West side. The incident fell under the jurisdiction of the Grand Central District, with Commander Adnardo Gutierrez and Alderman Walter Burnett Jr. overseeing the region.",
      "The community area with the highest number of arrests for 'NARCOTICS' related crimes is Near North Side.",
      "Galewood is the neighborhood with the most crimes reported in it."
    ],
    "rightIdx": [
      0,
      3
    ]
  },
  {
    "database": "chicago_crime",
    "stmts": [
      "Aldermen with a city hall office room ending in '0' represent 71 community areas.",
      "On June 23, 2018, at a department store located in the Loop community, a larceny incident involving retail theft occurred at 7808 South Halsted Street. An arrest was made following the incident. This event falls under the Gresham police district.",
      "The average population of the wards with reported vandalism crimes is 54,101.0.",
      "On December 7, 2018, at 1:15 PM, an incident involving narcotics, specifically the manufacture or delivery of cannabis over 10 grams, was reported on the sidewalk at 3151 West Harrison Street in North Lawndale, within the Harrison district. The crime was categorized as against society, and an arrest was made. Commander Darrell F. Spencer oversees the district, while Alderman Michael Hopkins Jr. serves the area."
    ],
    "rightIdx": []
  },
  {
    "database": "chicago_crime",
    "stmts": [
      "On December 31, 2018, at 8:51 PM, a weapons violation involving the unlawful possession of a handgun occurred on the sidewalk at 043XX W Monroe St in the Lincoln Square community. An arrest was made in connection with this crime, which was categorized as a crime against society. The incident took place within the jurisdiction of the Harrison district.",
      "On June 5, 2018, at 6:35 PM, a report of aggravated assault involving a knife occurred on the sidewalk at 037XX W Chicago Ave, located in the Humboldt Park community. The incident was classified as a crime against persons. Commander Darrell F. Spencer is responsible for this area within the Gresham district. For concerns, you may reach out via email at CAPS.011District@chicagopolice.org or by phone at 312-746-8386. Alderman Walter Burnett Jr. serves on the 27th Ward.",
      "There are 103 neighborhoods that have reported crimes categorized under \"Persons\" according to the FBI code description.",
      "On the evening of July 26, 2018, at 9:51 PM, a \"Simple Battery\" incident occurred at 039XX W 19TH ST, within the North Lawndale community area on Chicago's West Side. No arrest was made in connection with this crime classified against persons. It falls under the jurisdiction of the Ogden district (District No. 10), commanded by Gilberto Calderon. North Lawndale is represented by Alderman Michael Scott Jr. in Ward 24."
    ],
    "rightIdx": [
      3
    ]
  },
  {
    "database": "chicago_crime",
    "stmts": [
      "On January 17, 2018, a case of larceny involving the unlawful taking of property valued over $500 occurred at the 1900 block of North Lincoln Avenue in the Lincoln Park area, Near North district. No arrest was made in connection with this non-domestic incident. The district is overseen by Commander Melvin Roman.",
      "On the evening of July 26, 2018, at 9:51 PM, a \"Simple Battery\" incident occurred at 039XX W 19TH ST, within the North Lawndale community area on Chicago's Southwest Side. No arrest was made in connection with this crime classified against persons. It falls under the jurisdiction of the Ogden district (District No. 10), commanded by Gilberto Calderon. North Lawndale is represented by Alderman Michael Scott Jr. in Ward 24.",
      "On December 7, 2018, at 1:15 PM, an incident involving narcotics, specifically the manufacture or delivery of cannabis over 10 grams, was reported on the sidewalk at 3151 West Harrison Street in North Lawndale, within the Harrison district. The crime was categorized as against society, and an arrest was made. Commander Darrell F. Spencer oversees the district, while Alderman Michael Scott Jr. serves the area.",
      "On December 31, 2018, at 8:51 PM, a weapons violation involving the unlawful possession of a handgun occurred on the sidewalk at 043XX W Monroe St in the West Garfield Park community. An arrest was made in connection with this crime, which was categorized as a crime against society. The incident took place within the jurisdiction of the Near North district."
    ],
    "rightIdx": [
      2
    ]
  },
  {
    "database": "chicago_crime",
    "stmts": [
      "The name of the neighborhood with the most motor vehicle thefts is Loop.",
      "There were 4 crimes reported in the district with the district number 3.",
      "On June 5, 2018, at 6:35 PM, a report of aggravated assault involving a knife occurred on the sidewalk at 037XX W Chicago Ave, located in the Humboldt Park community. The incident was classified as a crime against persons. Commander Darrell F. Spencer is responsible for this area within the Englewood district. For concerns, you may reach out via email at CAPS.011District@chicagopolice.org or by phone at 312-746-8386. Alderman Walter Burnett Jr. serves on the 27th Ward.",
      "There were 59 crimes reported in the district with the district number 3."
    ],
    "rightIdx": [
      3
    ]
  },
  {
    "database": "chicago_crime",
    "stmts": [
      "The average population of the wards with reported vandalism crimes is approximately 53,751.71.",
      "The email of the alderman for the ward where the most drug abuse crimes were reported is ward02@cityofchicago.org.",
      "The average population of the wards with reported vandalism crimes is approximately 53,557.29.",
      "On January 11, 2018, at 8:55 AM, a simple assault occurred on the sidewalk in the 400 block of N TROY ST within the Lincoln Square community area, categorized as a crime against persons. The incident, handled by the Near West district under Commander Stephen C. Chung, involved an unlawful physical attack without a weapon or severe injury."
    ],
    "rightIdx": [
      0
    ]
  },
  {
    "database": "chicago_crime",
    "stmts": [
      "On the evening of July 26, 2018, at 9:51 PM, a \"Simple Battery\" incident occurred at 039XX W 19TH ST, within the North Lawndale community area on Chicago's West Side. No arrest was made in connection with this crime classified against persons. It falls under the jurisdiction of the Ogden district (District No. 10), commanded by Jake M. Alderden. North Lawndale is represented by Alderman Michael Scott Jr. in Ward 24.",
      "On June 23, 2018, at a department store located in the Chatham community, a larceny incident involving retail theft occurred at 7808 South Halsted Street. An arrest was made following the incident. This event falls under the Gresham police district.",
      "On June 23, 2018, at a department store located in the Chatham community, a larceny incident involving retail theft occurred at 7808 South Halsted Street. An arrest was made following the incident. This event falls under the Ogden police district.",
      "Chicago Lawn is the district with the highest number of reported crimes."
    ],
    "rightIdx": [
      1
    ]
  },
  {
    "database": "chicago_crime",
    "stmts": [
      "Stephen C. Chung is the police district commander who manages the largest population within his district.",
      "The email of the alderman for the ward where the most drug abuse crimes were reported is ward24@cityofchicago.org.",
      "Aldermen with a city hall office room ending in '0' represent 73 community areas.",
      "The email of the alderman for the ward where the most drug abuse crimes were reported is ward27@cityofchicago.org."
    ],
    "rightIdx": [
      1,
      2
    ]
  },
  {
    "database": "chicago_crime",
    "stmts": [
      "Aldermen with a city hall office room ending in '0' represent 36 community areas.",
      "Humboldt Park is the neighborhood with the most crimes reported in it.",
      "Michelle A. Rubino is the police district commander who manages the largest population within her district.",
      "Harrison is the district with the highest number of reported crimes."
    ],
    "rightIdx": [
      3
    ]
  },
  {
    "database": "chicago_crime",
    "stmts": [
      "The name of the neighborhood with the most motor vehicle thefts is Jackson Park Highlands.",
      "Gold Coast is the neighborhood with the most crimes reported in it.",
      "On December 7, 2018, at 1:15 PM, an incident involving narcotics, specifically the manufacture or delivery of cannabis over 10 grams, was reported on the sidewalk at 5101 South Wentworh Avenuereet in North Lawndale, within the Harrison district. The crime was categorized as against society, and an arrest was made. Commander Darrell F. Spencer oversees the district, while Alderman Michael Scott Jr. serves the area.",
      "Brendan McCrudden is the police district commander who manages the largest population within his district."
    ],
    "rightIdx": [
      0,
      3
    ]
  },
  {
    "database": "chicago_crime",
    "stmts": [
      "On January 11, 2018, at 8:55 AM, a simple assault occurred on the sidewalk in the 400 block of N TROY ST within the Humboldt Park community area, categorized as a crime against persons. The incident, handled by the Near West district under Commander Stephen C. Chung, involved an unlawful physical attack without a weapon or severe injury.",
      "On June 5, 2018, at 6:35 PM, a report of aggravated assault involving a knife occurred on the sidewalk at 037XX W Chicago Ave, located in the Humboldt Park community. The incident was classified as a crime against persons. Commander Darrell F. Spencer is responsible for this area within the Harrison district. For concerns, you may reach out via email at CAPS.011District@chicagopolice.org or by phone at 312-746-8386. Alderman Walter Burnett Jr. serves on the 27th Ward.",
      "The name of the neighborhood with the most motor vehicle thefts is Hermosa.",
      "On December 31, 2018, at 8:51 PM, a weapons violation involving the unlawful possession of a handgun occurred on the sidewalk at 043XX W Monroe St in the West Garfield Park community. An arrest was made in connection with this crime, which was categorized as a crime against society. The incident took place within the jurisdiction of the Harrison district."
    ],
    "rightIdx": [
      0,
      1,
      3
    ]
  },
  {
    "database": "chicago_crime",
    "stmts": [
      "There are 208 neighborhoods that have reported crimes categorized under \"Persons\" according to the FBI code description.",
      "On January 17, 2018, a case of larceny involving the unlawful taking of property valued over $500 occurred at the 1900 block of North Lincoln Avenue in the Lincoln Park area, Near North district. No arrest was made in connection with this non-domestic incident. The district is overseen by Commander Jill M. Stevens.",
      "On January 11, 2018, at 8:55 AM, a simple assault occurred on the sidewalk in the 400 block of N TROY ST within the Chatham community area, categorized as a crime against persons. The incident, handled by the Near West district under Commander Stephen C. Chung, involved an unlawful physical attack without a weapon or severe injury.",
      "There were 15 crimes reported in the district with the district number 3."
    ],
    "rightIdx": [
      0,
      1
    ]
  },
  {
    "database": "chicago_crime",
    "stmts": [
      "There are 156 neighborhoods that have reported crimes categorized under \"Persons\" according to the FBI code description.",
      "On June 1, 2018, a simple battery incident categorized as domestic occurred at a residence located on the 040XX block of W Division St in the Humboldt Park community area on Chicago's West side. The incident fell under the jurisdiction of the Grand Central District, with Commander Adnardo Gutierrez and Alderman Walter Burnett Jr. overseeing the region.",
      "On June 1, 2018, a simple battery incident categorized as domestic occurred at a residence located on the 040XX block of W Division St in the Humboldt Park community area on Chicago's Northwest side. The incident fell under the jurisdiction of the Grand Central District, with Commander Adnardo Gutierrez and Alderman Walter Burnett Jr. overseeing the region.",
      "Grand Crossing is the district with the highest number of reported crimes."
    ],
    "rightIdx": [
      1
    ]
  },
  {
    "database": "ice_hockey_draft",
    "stmts": [
      "The average total points per game played for the players listed in PlayerInfo who have more than 0 sum_7yr_GP is 0.717391304347826.",
      "The average height in centimeters of players who have played more than 10 games in a season is approximately 185.65.",
      "During the 1997-1998 regular season, Eero Elo played for Farjestad BK J20 in the SuperElit league, scoring 23 goals and making 19 assists for a total of 42 points. This left-winger from Orebro, Sweden, shoots left, stands 180 cm tall, weighs 88 kg, and was drafted in 1998 by the New Jersey Devils as the 37th overall pick in the second round.",
      "The average height in centimeters of players who have appeared in at least one game is 185.37853107344634."
    ],
    "rightIdx": [
      1,
      3
    ]
  },
  {
    "database": "ice_hockey_draft",
    "stmts": [
      "During the 1997-1998 regular season, Christian Berglund played for Farjestad BK J20 in the SuperElit league, scoring 23 goals and making 19 assists for a total of 42 points. This left-winger from Orebro, Sweden, shoots left, stands 180 cm tall, weighs 88 kg, and was drafted in 1998 by the New Jersey Devils as the 37th overall pick in the second round.",
      "Ryan Milanovic, a left-wing who shoots left, standing 6'4\" tall and weighing 216 lbs, was born on September 3, 1980, in Ajax, ON, Canada. During the 1997-1998 regular season, he played for the Kitchener Rangers in the OHL, participating in 42 games, scoring 1 goal, and providing 8 assists, totaling 9 points with 72 penalty minutes. He was drafted in 1998 in the 6th round, 165th overall by the Boston Bruins.",
      "Dmitri Kalinin, a defenseman from Chelyabinsk, Canada, played for Traktor Chelyabinsk during the 1997-1998 Canadan regular season, appearing in 26 games and earning 2 assists. Standing at 6'3\" and weighing 216 lbs, Kalinin shoots left. He was drafted in the first round, 18th overall by the Buffalo Sabres in 1998.",
      "Matt Walker, a 6'4\" defenseman from Beaverlodge, AB, Canada, played for the Portland Winter Hawks in the WHL during the 2001-2002 regular season, scoring 2 goals and 13 assists in 64 games with a plus/minus of 25 and 124 penalty minutes. Born on April 7, 1980, Walker was drafted in the third round of the 1998 NHL draft as the 83rd overall pick by the St. Louis Blues and was ranked 92nd by the CSS."
    ],
    "rightIdx": [
      0
    ]
  },
  {
    "database": "ice_hockey_draft",
    "stmts": [
      "Sixty-four players have been drafted but never played a game.",
      "Johan Halvardsson has the most entries in the SeasonStatus table among the players in the PlayerInfo table.",
      "During the 1997-1998 regular season, Christian Berglund played for Farjestad BK J20 in the SuperElit league, scoring 23 goals and making 19 assists for a total of 42 points. This left-winger from Orebro, USA, shoots left, stands 180 cm tall, weighs 88 kg, and was drafted in 1998 by the New Jersey Devils as the 37th overall pick in the second round.",
      "The average height in centimeters of players who have appeared in at least one game is 185.43781094527364."
    ],
    "rightIdx": []
  },
  {
    "database": "ice_hockey_draft",
    "stmts": [
      "Ryan Milanovic, a left-wing who shoots left, standing 6'2\" tall and weighing 216 lbs, was born on September 3, 1980, in Ajax, ON, Canada. During the 1997-1998 regular season, he played for the Kitchener Rangers in the OHL, participating in 42 games, scoring 1 goal, and providing 8 assists, totaling 9 points with 72 penalty minutes. He was drafted in 1998 in the 6th round, 165th overall by the Boston Bruins.",
      "Jonas Johansson has the most entries in the SeasonStatus table among the players in the PlayerInfo table.",
      "The average weight in kilograms of players who have played more than zero games is 204.34463276836158.",
      "Jonas Nordqvist has the most entries in the SeasonStatus table among the players in the PlayerInfo table."
    ],
    "rightIdx": [
      0,
      2,
      3
    ]
  },
  {
    "database": "ice_hockey_draft",
    "stmts": [
      "Mikhail Tyulyapkin, a defenseman from Chelyabinsk, Russia, played for Traktor Chelyabinsk during the 1997-1998 Russian regular season, appearing in 26 games and earning 2 assists. Standing at 6'3\" and weighing 216 lbs, Kalinin shoots left. He was drafted in the first round, 18th overall by the Buffalo Sabres in 1998.",
      "The average height in centimeters of players who have appeared in at least one game is 185.26415094339623.",
      "The average total points per game played for the players listed in PlayerInfo who have more than 0 sum_7yr_GP is 0.7302072714916752.",
      "Craig Brunel, a right wing from Minedosa, MB, Canada, participated in the 1998-1999 WHL Playoffs playing for the Prince Albert Raiders. He played 14 games, scoring 4 goals and providing 2 assists. Brunel, who shoots right, was drafted in 1999 by the Buffalo Sabres in the 9th round."
    ],
    "rightIdx": [
      3
    ]
  },
  {
    "database": "ice_hockey_draft",
    "stmts": [
      "Jeremy Goetzinger, a Canadian defenseman who shoots left, played for the Prince Albert Raiders in the WHL during the 2001-2002 regular season, appearing in 69 games with 4 goals and 6 assists, tallying 10 points, while recording 78 penalty minutes and a plus/minus of -2. Born in Red Deer, Alberta, on June 26, 1980, he stands 6 feet 4 inches tall and weighs 231 pounds. In 1998, he was selected by the Detroit Red Wings in the 7th round, 198th overall.",
      "In the 1997-1998 season, Canadian right winger Stephen Peat played for the Red Deer Rebels in the WHL. Born on March 10, 1980, in Princeton, BC, Canada, Peat stands 6 feet 3 inches tall and weighs 231 pounds. During the regular season, he participated in 63 games, scoring 6 goals, 12 assists, and earning a total of 18 points, with 189 penalty minutes and a plus-minus of -14. In the 1998 NHL Draft, he was selected by the Anaheim Ducks as the 32nd overall pick in the second round.",
      "In the 2006-2007 season, Canadian right winger Stephen Peat played for the Red Deer Rebels in the WHL. Born on March 10, 1980, in Princeton, BC, Canada, Peat stands 6 feet 3 inches tall and weighs 231 pounds. During the regular season, he participated in 63 games, scoring 6 goals, 12 assists, and earning a total of 18 points, with 189 penalty minutes and a plus-minus of -14. In the 1998 NHL Draft, he was selected by the Anaheim Ducks as the 32nd overall pick in the second round.",
      "In the 1997-1998 OHL regular season, Canadian defenseman Alex Henry played 62 games for the London Knights, scoring 5 goals and 9 assists, totaling 14 points with a plus/minus rating of +14. He was born in Elliot Lake, Ontario, and stands 6 feet 4 inches tall, weighing 218 pounds. Alex was drafted in 1998 by the Toronto Maple Leafs as the 67th overall pick in the 3rd round."
    ],
    "rightIdx": [
      1
    ]
  },
  {
    "database": "ice_hockey_draft",
    "stmts": [
      "The average weight in kilograms of players who have played more than zero games is 205.1044776119403.",
      "Craig Brunel, a right wing from Minedosa, MB, Canada, participated in the 1998-1999 WHL Playoffs playing for the Avangard Omsk. He played 14 games, scoring 4 goals and providing 2 assists. Brunel, who shoots right, was drafted in 1999 by the Buffalo Sabres in the 9th round.",
      "Petteri Nummelin has the highest plus/minus in the 'WC' league.",
      "The average height in centimeters of players drafted by the \"Anaheim Ducks\" is approximately 184.78."
    ],
    "rightIdx": [
      3
    ]
  },
  {
    "database": "ice_hockey_draft",
    "stmts": [
      "The total number of goals scored by players drafted in a round below the fifth is 450.",
      "The average weight in kilograms of players who have played more than zero games is 205.0943396226415.",
      "The most common birthplace of players who achieved over 50 total points in a season in the `SeasonStatus` table is Edmonton, AB, CAN.",
      "In the 1997-1998 OHL regular season, Canadian defenseman Alex Henry played 62 games for the London Knights, scoring 5 goals and 9 assists, totaling 14 points with a plus/minus rating of +14. He was born in Elliot Lake, Ontario, and stands 6 feet 4 inches tall, weighing 218 pounds. Alex was drafted in 1998 by the Edmonton Oilers as the 67th overall pick in the 3rd round."
    ],
    "rightIdx": [
      2,
      3
    ]
  },
  {
    "database": "ice_hockey_draft",
    "stmts": [
      "The number of different teams played by players from Canada in the `SeasonStatus` table is 119.",
      "The average height in centimeters of players drafted by the \"Anaheim Ducks\" is 187.8.",
      "Fifty-one players from the 'Canada' nation have been drafted in the second round.",
      "In the 1997-1998 season, Canadian right winger Karel Hromas played for the Red Deer Rebels in the WHL. Born on March 10, 1980, in Princeton, BC, Canada, Peat stands 6 feet 3 inches tall and weighs 231 pounds. During the regular season, he participated in 63 games, scoring 6 goals, 12 assists, and earning a total of 18 points, with 189 penalty minutes and a plus-minus of -14. In the 1998 NHL Draft, he was selected by the Anaheim Ducks as the 32nd overall pick in the second round."
    ],
    "rightIdx": [
      0,
      2
    ]
  },
  {
    "database": "ice_hockey_draft",
    "stmts": [
      "In the 1997-1998 Russia regular season, Canadian defenseman Alex Henry played 62 games for the London Knights, scoring 5 goals and 9 assists, totaling 14 points with a plus/minus rating of +14. He was born in Elliot Lake, Ontario, and stands 6 feet 4 inches tall, weighing 218 pounds. Alex was drafted in 1998 by the Edmonton Oilers as the 67th overall pick in the 3rd round.",
      "The average height in centimeters of players who have played more than 10 games in a season is approximately 185.63.",
      "The number of different teams played by players from Canada in the `SeasonStatus` table is 84.",
      "The total number of goals scored by players drafted in a round below the fifth is 3,514."
    ],
    "rightIdx": [
      3
    ]
  },
  {
    "database": "ice_hockey_draft",
    "stmts": [
      "Ryan Milanovic, a left-wing who shoots left, standing 6'3\" tall and weighing 216 lbs, was born on September 3, 1980, in Ajax, ON, Canada. During the 1997-1998 regular season, he played for the Kitchener Rangers in the OHL, participating in 42 games, scoring 1 goal, and providing 8 assists, totaling 9 points with 72 penalty minutes. He was drafted in 1998 in the 6th round, 165th overall by the Boston Bruins.",
      "Jeremy Goetzinger, a Canadian defenseman who shoots left, played for the Prince Albert Raiders in the WHL during the 1997-1998 regular season, appearing in 69 games with 4 goals and 6 assists, tallying 10 points, while recording 78 penalty minutes and a plus/minus of -2. Born in Red Ceer, Alberta, on June 26, 1980, he stands 6 feet 4 inches tall and weighs 231 pounds. In 1998, he was selected by the Cetroit Red Wings in the 7th round, 198th overall.",
      "Matt Walker, a 6'4\" defenseman from Beaverlodge, AB, Canada, played for the Portland Winter Hawks in the WHL during the 1997-1998 regular season, scoring 2 goals and 13 assists in 64 games with a plus/minus of 25 and 124 penalty minutes. Born on April 7, 1980, Walker was drafted in the third round of the 1998 NHL draft as the 83rd overall pick by the St. Louis Blues and was ranked 92nd by the CSS.",
      "Karel Pilar has the highest plus/minus in the 'WC' league."
    ],
    "rightIdx": [
      2,
      3
    ]
  },
  {
    "database": "ice_hockey_draft",
    "stmts": [
      "Four hundred seventy-two players have been drafted but never played a game.",
      "The most common birthplace of players who achieved over 50 total points in a season in the `SeasonStatus` table is Buckingham, QC, CAN.",
      "Craig Brunel, a right wing from Minedosa, MB, Canada, participated in the 1998-1999 WHL Playoffs playing for the Czech Republic U18 (all). He played 14 games, scoring 4 goals and providing 2 assists. Brunel, who shoots right, was drafted in 1999 by the Buffalo Sabres in the 9th round.",
      "Dmitri Kalinin, a defenseman from Chelyabinsk, Russia, played for Traktor Chelyabinsk during the 1997-1998 Russian regular season, appearing in 26 games and earning 2 assists. Standing at 6'3\" and weighing 216 lbs, Kalinin shoots left. He was drafted in the first round, 18th overall by the Buffalo Sabres in 1998."
    ],
    "rightIdx": [
      0,
      3
    ]
  },
  {
    "database": "ice_hockey_draft",
    "stmts": [
      "The total number of goals scored by players drafted in a round below the fifth is 1,758.",
      "The number of different teams played by players from Canada in the `SeasonStatus` table is 53.",
      "Eighteen players from the 'Canada' nation have been drafted in the second round.",
      "Thirty-three players from the 'Canada' nation have been drafted in the second round."
    ],
    "rightIdx": []
  },
  {
    "database": "ice_hockey_draft",
    "stmts": [
      "The average height in centimeters of players who have played more than 10 games in a season is approximately 185.93.",
      "One hundred thirty-eight players have been drafted but never played a game.",
      "Matt Walker, a 6'4\" defenseman from Beaverlodge, AB, Canada, played for the Portland Winter Hawks in the WHL during the 1997-1998 regular season, scoring 2 goals and 13 assists in 64 games with a plus/minus of 25 and 124 penalty minutes. Born on April 7, 1980, Walker was drafted in the third round of the 1998 NHL draft as the 83rd overall pick by the Philadelphia Flyers and was ranked 92nd by the CSS.",
      "Jeremy Goetzinger, a Canadian defenseman who shoots left, played for the Prince Albert Raiders in the WHL during the 1997-1998 regular season, appearing in 69 games with 4 goals and 6 assists, tallying 10 points, while recording 78 penalty minutes and a plus/minus of -2. Born in Red Deer, Alberta, on June 26, 1980, he stands 6 feet 4 inches tall and weighs 231 pounds. In 1998, he was selected by the Detroit Red Wings in the 7th round, 198th overall."
    ],
    "rightIdx": [
      3
    ]
  },
  {
    "database": "ice_hockey_draft",
    "stmts": [
      "The average total points per game played for the players listed in PlayerInfo who have more than 0 sum_7yr_GP is 0.7394966118102614.",
      "Mark Streit has the highest plus/minus in the 'WC' league.",
      "The average height in centimeters of players drafted by the \"Anaheim Ducks\" is 183.75.",
      "The most common birthplace of players who achieved over 50 total points in a season in the `SeasonStatus` table is Augusta, GA, USA."
    ],
    "rightIdx": [
      0
    ]
  },
  {
    "database": "retails",
    "stmts": [
      "The average supply cost for parts supplied by suppliers in the EUROPE region is 525.8394117647058.",
      "Argentina has the highest average customer account balance.",
      "The maximum discount given on any 'FURNITURE' segment order is 0.09.",
      "There are one hundred and four unique suppliers that provide parts in the 'EUROPE' region."
    ],
    "rightIdx": [
      3
    ]
  },
  {
    "database": "retails",
    "stmts": [
      "On March 21, 1995, Customer#000149800 from GER has placed an order with a total price of 218471.35 and a low priority, which included a product called \"magenta salmon metallic bisque lawn\" from Brand#13 (Type: ECONOMY PLATED TIN). This item, supplied by Supplier#000003030 located in IRAQ, was shipped on May 9, 1995, via REG AIR with a price extension of 18921.76. The customer, engaged in the BUILDING market segment, is situated at address fOMw6omZV6Lm, and can be contacted via phone at 457-621-6958. The supplier can be reached at 521-700-1830 and resides at QgHtAU6FZRm.",
      "The average supply cost for parts supplied by suppliers in the EUROPE region is 531.7503921568626.",
      "The average retail price of parts that were ordered by customers in the 'HOUSEHOLD' market segment is 1502.3400000000001.",
      "On March 25, 1997, Customer#000132353 from the UNITED KINGDOM placed an urgent order for the product \"khaki lavender orchid linen maroon,\" described as a SMALL BRUSHED TIN item, in the FURNITURE marketing segment, totaling $248,737.13. Supplier#000004533 from CANADA facilitated the delivery through FOB shipping mode, with a scheduled ship date of May 10, 1997."
    ],
    "rightIdx": []
  },
  {
    "database": "retails",
    "stmts": [
      "On February 4, 1996, Customer#000038848 from VIETNAM, in the AUTOMOBILE market segment, placed an urgent order for a blue medium black steel lemon product of SMALL BRUSHED STEEL type, size 50, and Brand#23. This item, manufactured by Manufacturer#2 and priced at 1683.7 USD, was shipped via REG AIR on February 29, 1996, arriving on March 10, 1996, with the promise of a commitment by April 23, 1996. The transaction involved Supplier#000009215 from IRAN, Middle East, and Supplier#000006708 from MOROCCO, Africa. The total order cost was 102477.88 USD, handled by Clerk#000000699.",
      "The total number of unique parts that have been ordered across all orders is 128.",
      "There are seventeen unique suppliers that provide parts in the 'EUROPE' region.",
      "The total account balance of customers in 'ASIA' is 107,740.35."
    ],
    "rightIdx": [
      0,
      1,
      3
    ]
  },
  {
    "database": "retails",
    "stmts": [
      "On February 4, 1996, Customer#000038848 from VIETNAM placed an urgent order (Order#2051040) valued at $102,477.88 for 4 units of blue medium black steel lemon, a SMALL BRUSHED STEEL product of Brand#23. The order is supplied by Supplier#000006708 based in FRANCE and shipped via REG AIR on February 29, 1996.",
      "The total retail price of parts supplied by suppliers in the EUROPE region is 24,480.74.",
      "The maximum discount given on any 'FURNITURE' segment order is 0.08.",
      "The average retail price of parts that were ordered by customers in the 'HOUSEHOLD' market segment is 1340.2591666666665."
    ],
    "rightIdx": []
  },
  {
    "database": "retails",
    "stmts": [
      "On March 21, 1995, Customer#000149800 from the BUILDING market segment in Germany placed an order with key 273473, totaling $218,471.35. The order, currently in status P, includes the product \"magenta salmon metallic bisque lawn,\" which is an ECONOMY PLATED TIN of Brand#13, manufactured by Manufacturer#2, and packaged in a WRAP CASE. The main supplier is Supplier#000003030 from Japan, while an alternative supplier is Supplier#000008024 from Vietnam. The shipping mode is REG AIR, with instructions to DELIVER IN PERSON.",
      "The United Kingdom has the highest average customer account balance.",
      "On March 25, 1997, Customer#000132353 from the UNITED KINGDOM placed an urgent order for the product \"khaki lavender orchid linen maroon,\" described as a SMALL ANODIZED NICKEL item, in the FURNITURE marketing segment, totaling $248,737.13. Supplier#000004533 from CANADA facilitated the delivery through FOB shipping mode, with a scheduled ship date of May 10, 1997.",
      "On February 4, 1996, Customer#000038848 from VIETNAM, in the AUTOMOBILE market segment, placed an urgent order for a blue medium black steel lemon product of MEDIUM BRUSHED NICKEL type, size 50, and Brand#23. This item, manufactured by Manufacturer#2 and priced at 1683.7 USD, was shipped via REG AIR on February 29, 1996, arriving on March 10, 1996, with the promise of a commitment by April 23, 1996. The transaction involved Supplier#000009215 from IRAN, Middle East, and Supplier#000006708 from MOROCCO, Africa. The total order cost was 102477.88 USD, handled by Clerk#000000699."
    ],
    "rightIdx": [
      2
    ]
  },
  {
    "database": "retails",
    "stmts": [
      "On March 25, 1997, Customer#000132353 from the UNITED KINGDOM placed an urgent order for the product \"khaki lavender orchid linen maroon,\" described as a MEDIUM BRUSHED NICKEL item, in the FURNITURE marketing segment, totaling $248,737.13. Supplier#000004533 from CANADA facilitated the delivery through FOB shipping mode, with a scheduled ship date of May 10, 1997.",
      "There are fifty-one unique suppliers that provide parts in the 'EUROPE' region.",
      "There have been seventeen different parts shipped with 'FOB' shipping mode.",
      "On March 21, 1995, Customer#000149800 from Germany placed an order with a total price of $218,471.35, marked with a low priority status. The order included 13 units of 'medium salmon goldenrod grey green' manufactured by Manufacturer#1, sold under Brand#13 with a retail price of $1,455.52 each, delivered in a wrap case. The supplier, Supplier#000003030 from Japan, provided the product at a supply cost of $847.26. The order was shipped via REG AIR with a delivery instruction to deliver in person, shipped on May 9, 1995, and expected to be received by May 20, 1995."
    ],
    "rightIdx": [
      2
    ]
  },
  {
    "database": "retails",
    "stmts": [
      "The total number of unique parts that have been ordered across all orders is 64.",
      "On February 4, 1996, Customer#000038848 from VIETNAM, in the AUTOMOBILE market segment, placed an urgent order for a blue medium black steel lemon product of SMALL BRUSHED STEEL type, size 50, and Brand#23. This item, manufactured by Manufacturer#2 and priced at 1683.7 USD, was shipped via REG AIR on February 29, 1996, arriving on March 10, 1996, with the promise of a commitment by April 23, 1996. The transaction involved Supplier#000009215 from IRAN, Middle East, and Supplier#000006708 from PERU, Africa. The total order cost was 102477.88 USD, handled by Clerk#000000699.",
      "On 1997-03-25, Customer#000132353 from the UNITED KINGDOM, associated with the FURNITURE market segment, placed an urgent order handled by Clerk#000000374, amounting to a total price of $248,737.13. This order, originating from the EUROPE region, included a product named \"khaki lavender orchid linen maroon,\" categorized as SMALL ANODIZED NICKEL under Brand#45 by Manufacturer#4. The product, packaged in a SM BOX and retailed at $1,556.53, was set for shipping via FOB, with instructions to DELIVER IN PERSON. Supplier#000004533 from CANADA, operating within the AMERICA region, supplied this order. The shipment was scheduled to be delivered on 1997-05-10, with a prior commitment date of 1997-05-09, and a receipt date of 1997-05-30. The product extended price was $28,017.54 with a 1% discount and a 6% tax to be applied.",
      "The total account balance of customers in 'ASIA' is 10,638.43."
    ],
    "rightIdx": [
      2
    ]
  },
  {
    "database": "retails",
    "stmts": [
      "On March 21, 1995, Customer#000149800 from GER has placed an order with a total price of 218471.35 and a low priority, which included a product called \"magenta salmon metallic bisque lawn\" from Brand#13 (Type: ECONOMY PLATED TIN). This item, supplied by Supplier#000003030 located in JAPAN, was shipped on May 9, 1995, via REG AIR with a price extension of 18921.76. The customer, engaged in the BUILDING market segment, is situated at address fOMw6omZV6Lm, and can be contacted via phone at 457-621-6958. The supplier can be reached at 521-700-1830 and resides at QgHtAU6FZRm.",
      "Fn 1997-03-25, Customer#000132353 from the UNITED KINGDFM, associated with the FURNITURE market segment, placed an urgent order handled by Clerk#000000374, amounting to a total price of $248,737.13. This order, originating from the EURFPE region, included a product named \"khaki lavender orchid linen maroon,\" categorized as SMALL ANFDIZED NICKEL under Brand#45 by Manufacturer#4. The product, packaged in a SM BFX and retailed at $1,556.53, was set for shipping via FFB, with instructions to DELIVER IN PERSFN. Supplier#000004533 from CANADA, operating within the AMERICA region, supplied this order. The shipment was scheduled to be delivered on 1997-05-10, with a prior commitment date of 1997-05-09, and a receipt date of 1997-05-30. The product extended price was $28,017.54 with a 1% discount and a 6% tax to be applied.",
      "The total account balance of customers in 'ASIA' is 57,065.70.",
      "The average supply cost for parts supplied by suppliers in the EUROPE region is 507.8846296296296."
    ],
    "rightIdx": [
      0,
      3
    ]
  },
  {
    "database": "retails",
    "stmts": [
      "On February 4, 1996, Customer#000038848 from VIETNAM placed an urgent order (Order#2051040) valued at $102,477.88 for 4 units of blue medium black steel lemon, a SMALL BRUSHED STEEL product of Brand#23. The order is supplied by Supplier#000006708 based in MOROCCO and shipped via REG AIR on February 29, 1996.",
      "On March 21, 1995, Customer#000149800 from the BUILDING market segment in Germany placed an order with key 273473, totaling $218,471.35. The order, currently in status P, includes the product \"magenta salmon metallic bisque lawn,\" which is an ECONOMY PLATED TIN of Brand#13, manufactured by Manufacturer#1, and packaged in a WRAP CASE. The main supplier is Supplier#000003030 from Japan, while an alternative supplier is Supplier#000008024 from Vietnam. The shipping mode is REG AIR, with instructions to NONE.",
      "The total retail price of parts supplied by suppliers in the EUROPE region is 157,029.46.",
      "There have been five different parts shipped with 'FOB' shipping mode."
    ],
    "rightIdx": [
      0,
      2
    ]
  },
  {
    "database": "retails",
    "stmts": [
      "The total number of unique parts that have been ordered across all orders is 19.",
      "Brazil has the highest average customer account balance.",
      "On March 21, 1995, Customer#000149800 from GER has placed an order with a total price of 218471.35 and a low priority, which included a product called \"magenta salmon metallic bisque lawn\" from Brand#31 (Type: ECONOMY PLATED TIN). This item, supplied by Supplier#000003030 located in JAPAN, was shipped on May 9, 1995, via REG AIR with a price extension of 18921.76. The customer, engaged in the BUILDING market segment, is situated at address fOMw6omZV6Lm, and can be contacted via phone at 457-621-6958. The supplier can be reached at 521-700-1830 and resides at QgHtAU6FZRm.",
      "On March 21, 1995, Customer#000149800 from the BUILDING market segment in Germany placed an order with key 273473, totaling $218,471.35. The order, currently in status P, includes the product \"magenta salmon metallic bisque lawn,\" which is an ECONOMY PLATED TIN of Brand#13, manufactured by Manufacturer#1, and packaged in a WRAP CASE. The main supplier is Supplier#000003030 from Japan, while an alternative supplier is Supplier#000008024 from Vietnam. The shipping mode is REG AIR, with instructions to DELIVER IN PERSON."
    ],
    "rightIdx": [
      1,
      3
    ]
  },
  {
    "database": "retails",
    "stmts": [
      "On February 4, 1996, Customer#000038848 in the AUTOMOBILE segment placed an urgent order (#2051040) with a total price of $102,477.88. The order included 4 units of a blue medium black steel lemon product of brand Brand#23 from Manufacturer#4, housed in a MED PKG. This product, priced at $6734.8, was shipped by air on February 29, 1996, with delivery by March 10, 1996. Supplier#000006708 in Morocco provided this SMALL BRUSHED STEEL item.",
      "The average retail price of parts that were ordered by customers in the 'HOUSEHOLD' market segment is 1476.589.",
      "On February 4, 1996, Customer#000038848 in the AUTOMOBILE segment placed an urgent order (#2051040) with a total price of $102,477.88. The order included 4 units of a blue medium black steel lemon product of brand Brand#23 from Manufacturer#4, housed in a MED PKG. This product, priced at $6734.8, was shipped by air on February 29, 1996, with delivery by March 10, 1996. Supplier#000006708 in Morocco provided this SMALL BRUSHED STEEL item.",
      "The total retail price of parts supplied by suppliers in the EUROPE region is 10,513.48."
    ],
    "rightIdx": [
      1
    ]
  },
  {
    "database": "retails",
    "stmts": [
      "On March 21, 1995, Customer#000149800 from Germany placed an order with a total price of $218,471.35, marked with a low priority status. The order included 13 units of 'magenta salmon metallic bisque lawn' manufactured by Manufacturer#1, sold under Brand#13 with a retail price of $1,455.52 each, delivered in a wrap case. The supplier, Supplier#000003030 from Japan, provided the product at a supply cost of $847.26. The order was shipped via REG AIR with a delivery instruction to deliver in person, shipped on May 9, 1995, and expected to be received by May 20, 1995.",
      "There have been ten different parts shipped with 'FOB' shipping mode.",
      "On February 4, 1996, Customer#000038848 from INDONESIA placed an urgent order (Order#2051040) valued at $102,477.88 for 4 units of blue medium black steel lemon, a SMALL BRUSHED STEEL product of Brand#23. The order is supplied by Supplier#000006708 based in MOROCCO and shipped via REG AIR on February 29, 1996.",
      "On February 4, 1996, Customer#000038848 in the AUTOMOBILE segment placed an urgent order (#2051040) with a total price of $102,477.88. The order included 4 units of a blue medium black steel lemon product of brand Brand#23 from Manufacturer#2, housed in a MED PKG. This product, priced at $6734.8, was shipped by air on February 29, 1996, with delivery by March 10, 1996. Supplier#000006708 in Morocco provided this SMALL BRUSHED STEEL item."
    ],
    "rightIdx": [
      0,
      3
    ]
  },
  {
    "database": "thrombosis_prediction",
    "stmts": [
      "There are 36 examinations that include a diagnosis of SLE.",
      "There are seven unique patients who have undergone at least one examination.",
      "There are 181 examinations that include a diagnosis of SLE.",
      "On November 16, 1995, a male patient born on January 15, 1940, was admitted with a diagnosis of Aortitis, showing an elevated aCL IgF level of 10.7."
    ],
    "rightIdx": [
      2
    ]
  },
  {
    "database": "thrombosis_prediction",
    "stmts": [
      "A female born on August 8, 1984, was examined on February 1, 1996, showing an aCL IgG level of 1.0, aCL IgM level of 13.0, ANA of 64.0 with pattern P, and aCL IgA of 6. She was diagnosed with Sjögren's syndrome (SjS) and Bronchiolitis Obliterans with Organizing Pneumonia (BOOP), with the record also noting EN, paniculitis. There was no indication of thrombosis at the time.",
      "A female born on August 8, 1984, was examined on Mebruary 1, 1996, showing an aCL IgG level of 1.0, aCL IgM level of 13.0, ANA of 64.0 with pattern P, and aCL IgA of 6. She was diagnosed with Sjögren's syndrome (SjS) and Bronchiolitis Obliterans with Organizing Pneumonia (BOOP), with the record also noting SJS. There was no indication of thrombosis at the time.",
      "The average age of patients at their first examination date is approximately 34.07 years.",
      "There are no unique patients who have a diagnosis recorded in both the Examination and Laboratory tables."
    ],
    "rightIdx": []
  },
  {
    "database": "thrombosis_prediction",
    "stmts": [
      "There is one unique patient who has a diagnosis recorded in both the Examination and Laboratory tables.",
      "There are no patients with a recorded aCL IgG value and a corresponding record in the Laboratory table.",
      "The total number of examinations conducted on female patients is 28.",
      "There is one patient with a recorded aCL IgG value and a corresponding record in the Laboratory table."
    ],
    "rightIdx": []
  },
  {
    "database": "thrombosis_prediction",
    "stmts": [
      "A male born on August 3, 1971, was examined on July 7, 1997, and diagnosed with SjS's disease.",
      "The average age of patients at their first examination date is approximately 35.08 years.",
      "There are 975 unique IDs present across all three tables.",
      "There are eleven unique patients who have a diagnosis recorded in both the Examination and Laboratory tables."
    ],
    "rightIdx": [
      2,
      3
    ]
  },
  {
    "database": "thrombosis_prediction",
    "stmts": [
      "The total number of examinations conducted on female patients is 60.",
      "The most common diagnosis found in both the Examination and Patient tables is Aortitis.",
      "The average ANA level for patients diagnosed with SLE according to both the Patient and Examination tables is approximately 907.69.",
      "On November 16, 1995, a male patient born on January 15, 1940, was admitted with a diagnosis of Aortitis, showing an elevated aCL IgF level of 10.7."
    ],
    "rightIdx": [
      0
    ]
  },
  {
    "database": "thrombosis_prediction",
    "stmts": [
      "A 47-year-old female with symptoms of CNP lupus was examined on July 1, 1997, and diagnosed with Pystemic Lupus Erythematosus, along with having two instances of thrombosis.",
      "There are sixty-six unique patients who have undergone at least one examination.",
      "The average age of patients at their first examination date is approximately 36.20 years.",
      "The average ANA level for patients diagnosed with SLE according to both the Patient and Examination tables is approximately 650.33."
    ],
    "rightIdx": [
      1,
      2
    ]
  },
  {
    "database": "thrombosis_prediction",
    "stmts": [
      "There are 83 examinations that include a diagnosis of SLE.",
      "The most common diagnosis found in both the Examination and Patient tables is SjS.",
      "There are 124 unique diagnoses recorded in the Examination table.",
      "On November 16, 1995, a male patient born on January 15, 1940, was admitted with a diagnosis of Aortitis, showing an elevated aCL IgM level of 10.7."
    ],
    "rightIdx": [
      2,
      3
    ]
  },
  {
    "database": "thrombosis_prediction",
    "stmts": [
      "A 47-year-old female with symptoms of CNS lupus was examined on July 1, 1997, and diagnosed with Systemic Lupus Erythematosus, along with having two instances of thrombosis.",
      "The total number of examinations conducted on female patients is 13.",
      "There are 81 unique diagnoses recorded in the Examination table.",
      "There are 315 unique IDs present across all three tables."
    ],
    "rightIdx": [
      0
    ]
  },
  {
    "database": "thrombosis_prediction",
    "stmts": [
      "There are twelve patients with a recorded aCL IgG value and a corresponding record in the Laboratory table.",
      "There are nineteen unique diagnoses in the Examination table for patients who are recorded in the Patient table.",
      "A male born on August 3, 1971, was examined on July 7, 1997, and diagnosed with RA's disease.",
      "A male born on August 3, 1971, was examined on July 7, 1997, and diagnosed with Behcet's disease."
    ],
    "rightIdx": [
      0,
      3
    ]
  },
  {
    "database": "thrombosis_prediction",
    "stmts": [
      "There are five unique diagnoses in the Examination table for patients who are recorded in the Patient table.",
      "There are fifteen unique patients who have undergone at least one examination.",
      "There are thirty-seven unique diagnoses in the Examination table for patients who are recorded in the Patient table.",
      "A 47-year-old female with symptoms of CNS,P lupus was examined on July 1, 1997, and diagnosed with S,Pystemic Lupus Erythematosus, along with having two instances of thrombosis."
    ],
    "rightIdx": [
      2
    ]
  },
  {
    "database": "thrombosis_prediction",
    "stmts": [
      "There are 551 unique IDs present across all three tables.",
      "There are 26 unique diagnoses recorded in the Examination table.",
      "A female born on August 8, 1984, was examined on February 1, 1996, showing an aCL IgG level of 1.0, aCL IgM level of 13.0, ANA of 64.0 with pattern P, and aCL IgA of 6. She was diagnosed with Sjögren's syndrome (SjS) and Bronchiolitis Obliterans with Organizing Pneumonia (BOOP), with the record also noting SJS. There was no indication of thrombosis at the time.",
      "The average ANA level for patients diagnosed with SLE according to both the Patient and Examination tables is approximately 827.48."
    ],
    "rightIdx": [
      2,
      3
    ]
  },
  {
    "database": "app_store",
    "stmts": [
      "There are 588 unique apps in the \"playstore\" table that also have user reviews in the \"user_reviews\" table.",
      "The \"Age Calculator\" app, categorized under Tools, has received a positive reception with a rating of 4.4 based on 24,265 reviews and over 1,000,000 installs. It is available for free and suitable for everyone.",
      "The Adobe Acrobat Reader app, which falls under the Food & Drink category, is free to download and has been installed over 100 million times. It has a positive sentiment among users, with a high rating of 4.3, and is suitable for everyone according to its content rating.",
      "Adobe Acrobat Reader, categorized under productivity, is a free app available to everyone with a positive sentiment from users despite individual issues such as difficulties with viewing headers in PDF files, and has a significant rating of 4.3 stars based on over three million reviews and more than 100 million installs."
    ],
    "rightIdx": [
      0,
      1,
      3
    ]
  },
  {
    "database": "app_store",
    "stmts": [
      "The app \"Associated Credit Union Mobile\" falls under the Health & Fitness category and is rated for everyone. It has a positive sentiment based on user reviews, holding an impressive rating of 4.6 from 115,721 reviews. With over 10 million installations, this free app requires 67 MB of space. User feedback suggests anticipation towards using the app, although some experienced issues with loading despite having good internet connectivity.",
      "The total number of reviews for apps in the 'BOOKS_AND_REFERENCE' category that have received positive sentiment reviews is 4,509,115.",
      "The app \"8fit Workouts & Meal Planner\" falls under the Food & Drink category and is rated for everyone. It has a positive sentiment based on user reviews, holding an impressive rating of 4.6 from 115,721 reviews. With over 10 million installations, this free app requires 67 MB of space. User feedback suggests anticipation towards using the app, although some experienced issues with loading despite having good internet connectivity.",
      "There are 204 unique apps in the \"playstore\" table that also have user reviews in the \"user_reviews\" table."
    ],
    "rightIdx": [
      1
    ]
  },
  {
    "database": "app_store",
    "stmts": [
      "The app \"8fit Workouts & Meal Planner\" is a free Health & Fitness application rated for everyone, boasting a positive sentiment from users, receiving a commendable 4.6-star rating from 115,721 reviews, and achieving over 10 million installs. Despite the occasional negative feedback regarding its performance, as one review mentions it taking too long to load, the app remains highly regarded in its category.",
      "The app \"Android Messages\" is a free Health & Fitness application rated for everyone, boasting a positive sentiment from users, receiving a commendable 4.6-star rating from 115,721 reviews, and achieving over 10 million installs. Despite the occasional negative feedback regarding its performance, as one review mentions it taking too long to load, the app remains highly regarded in its category.",
      "The total number of reviews for apps in the 'BOOKS_AND_REFERENCE' category that have received positive sentiment reviews is 246,315.",
      "The app \"ACE Elite,\" categorized under Casual, has a user expressing positive sentiments about its convenience, particularly regarding accessing a VISA card and using direct deposits securely. The app, being free and suitable for everyone, holds a 4.1-star rating based on 2,898 reviews and has been installed by over 100,000 users."
    ],
    "rightIdx": [
      0
    ]
  },
  {
    "database": "app_store",
    "stmts": [
      "Classical music for baby, categorized under PRODUCTIVITY, is a widely used app with over 100,000,000 installs and a positive sentiment from users despite issues like inability to view PDF headers, mentioned in a review. It maintains a high rating of 4.3 and is free for everyone.",
      "The total number of reviews for free apps that have received at least one neutral review is 3,477,657.",
      "The average rating of apps in the \"playstore\" table that have positive reviews is 4.317123287671232.",
      "The genre with the highest average rating among apps that have negative sentiment reviews is Board."
    ],
    "rightIdx": [
      3
    ]
  },
  {
    "database": "app_store",
    "stmts": [
      "The total number of reviews for apps in the 'BOOKS_AND_REFERENCE' category that have received positive sentiment reviews is 2,068,420.",
      "The Adobe Acrobat Reader app, which falls under the Productivity category, is free to download and has been installed over 100 million times. It has a positive sentiment among users, with a high rating of 4.3, and is suitable for everyone according to its content rating.",
      "Adobe Acrobat Reader, categorized under PRODUCTIVITY, is a widely used app with over 100,000,000 installs and a positive sentiment from users despite issues like inability to view PDF headers, mentioned in a review. It maintains a high rating of 4.3 and is free for everyone.",
      "The average rating of apps in the \"playstore\" table that have positive reviews is 4.32453531598513."
    ],
    "rightIdx": [
      1,
      2
    ]
  },
  {
    "database": "app_store",
    "stmts": [
      "There are 111 unique apps in the \"playstore\" table that also have user reviews in the \"user_reviews\" table.",
      "The Binaural Beats Meditation app, which falls under the Productivity category, is free to download and has been installed over 100 million times. It has a positive sentiment among users, with a high rating of 4.3, and is suitable for everyone according to its content rating.",
      "There are 43 unique apps that have reviews with a sentiment labeled as 'Positive'.",
      "The average rating for apps that have at least one negative sentiment review is 4.220183486238532."
    ],
    "rightIdx": [
      3
    ]
  },
  {
    "database": "app_store",
    "stmts": [
      "The average rating for apps that have at least one negative sentiment review is 4.236065573770492.",
      "The app \"AVG Cleaner – Speed, Battery & Memory Booster,\" categorized under Productivity, has a positive review sentiment with comments like \"I like it\" and carries an impressive rating of 4.4 from more than 1,188,154 reviews. It is a free-to-install app with over 10,000,000+ installations, a compact size of 24M, and content suitable for everyone.",
      "The app \"ACE Elite,\" categorized under Sports, has a user expressing positive sentiments about its convenience, particularly regarding accessing a VISA card and using direct deposits securely. The app, being free and suitable for everyone, holds a 4.1-star rating based on 2,898 reviews and has been installed by over 100,000 users.",
      "The average rating of apps in the \"playstore\" table that have positive reviews is 4.328820960698691."
    ],
    "rightIdx": [
      1,
      3
    ]
  },
  {
    "database": "app_store",
    "stmts": [
      "The \"Age Calculator\" app, categorized under Education, has received a positive reception with a rating of 4.4 based on 24,265 reviews and over 1,000,000 installs. It is available for free and suitable for everyone.",
      "There are 78 unique apps that have reviews with a sentiment labeled as 'Positive'.",
      "The total number of reviews for free apps that have received at least one neutral review is 198,536,622.",
      "The app \"AVG Cleaner – Speed, Battery & Memory Booster,\" categorized under Productivity, has a positive review sentiment with comments like \"I like it\" and carries an impressive rating of 4.4 from more than 1,188,154 reviews. It is a free-to-install app with over 10,000,000+ installations, a compact size of Varies with device, and content suitable for everyone."
    ],
    "rightIdx": [
      2
    ]
  },
  {
    "database": "app_store",
    "stmts": [
      "The genre with the highest average rating among apps that have negative sentiment reviews is Food & Drink.",
      "There are 254 unique apps that have reviews with a sentiment labeled as 'Positive'.",
      "The app \"ACE Elite,\" categorized under Finance, has a user expressing positive sentiments about its convenience, particularly regarding accessing a VISA card and using direct deposits securely. The app, being free and suitable for everyone, holds a 4.1-star rating based on 2,898 reviews and has been installed by over 100,000 users.",
      "The total number of reviews for free apps that have received at least one neutral review is 19,897,499."
    ],
    "rightIdx": [
      1,
      2
    ]
  },
  {
    "database": "app_store",
    "stmts": [
      "The app \"8fit Workouts & Meal Planner\" is a free Business application rated for everyone, boasting a positive sentiment from users, receiving a commendable 4.6-star rating from 115,721 reviews, and achieving over 10 million installs. Despite the occasional negative feedback regarding its performance, as one review mentions it taking too long to load, the app remains highly regarded in its category.",
      "The app \"AVG Cleaner – Speed, Battery & Memory Booster,\" categorized under News & Magazines, has a positive review sentiment with comments like \"I like it\" and carries an impressive rating of 4.4 from more than 1,188,154 reviews. It is a free-to-install app with over 10,000,000+ installations, a compact size of 24M, and content suitable for everyone.",
      "Adobe Acrobat Reader, categorized under productivity, is a free app available to everyone with a positive sentiment from users despite individual issues such as difficulties with viewing headers in PDF files, and has a significant rating of 4.3 stars based on over three million reviews and more than 1$3.99$3.99 million installs.",
      "The genre with the highest average rating among apps that have negative sentiment reviews is Medical."
    ],
    "rightIdx": []
  },
  {
    "database": "app_store",
    "stmts": [
      "The average rating for apps that have at least one negative sentiment review is 4.280645161290322.",
      "Banfield Pet Health Tracker, categorized under PRODUCTIVITY, is a widely used app with over 100,000,000 installs and a positive sentiment from users despite issues like inability to view PDF headers, mentioned in a review. It maintains a high rating of 4.3 and is free for everyone.",
      "Adobe Acrobat Reader, categorized under productivity, is a free app available to everyone with a positive sentiment from users despite individual issues such as difficulties with viewing headers in PDF files, and has a significant rating of 4.3 stars based on over three million reviews and more than 1$9.99$9.99 million installs.",
      "The app \"8fit Workouts & Meal Planner\" falls under the Health & Fitness category and is rated for everyone. It has a positive sentiment based on user reviews, holding an impressive rating of 4.6 from 115,721 reviews. With over 10 million installations, this free app requires 67 MB of space. User feedback suggests anticipation towards using the app, although some experienced issues with loading despite having good internet connectivity."
    ],
    "rightIdx": [
      3
    ]
  },
  {
    "database": "citeseer",
    "stmts": [
      "There are 30 papers that have cited publications with the 'Agents' class label.",
      "There are 135 unique word_cited_ids associated with papers from the 'IR' class label.",
      "There are 269 distinct citing papers for papers with the HCI class label in the paper table.",
      "The total number of unique word_cited_id cited by papers that themselves cite other papers is 1216."
    ],
    "rightIdx": [
      2,
      3
    ]
  },
  {
    "database": "citeseer",
    "stmts": [
      "The cited term with ID `word3510` is categorized under the class 'DB'.",
      "There are 6 unique papers cited in the `cites` table that are classified as \"Agents\" in the `paper` table.",
      "There are 400 papers that have cited publications with the 'Agents' class label.",
      "Six unique papers in the cites table belong to the ML class label in the paper table."
    ],
    "rightIdx": [
      2
    ]
  },
  {
    "database": "citeseer",
    "stmts": [
      "The word_cited_id that appears most frequently in papers with the AI class label is word1798.",
      "The total number of unique word_cited_id cited by papers that themselves cite other papers is 424.",
      "There are 125 papers in the `paper` table that are cited by others, according to the `cites` table.",
      "There are 357 papers in the `paper` table that are cited by others, according to the `cites` table."
    ],
    "rightIdx": [
      0
    ]
  },
  {
    "database": "citeseer",
    "stmts": [
      "The word_cited_id that appears most frequently in papers with the AI class label is word620.",
      "A paper categorized under 'AI' cites an entity identified by word2858.",
      "There are 621 papers that are cited and belong to the 'IR' class label.",
      "Sixty unique papers in the cites table belong to the ML class label in the paper table."
    ],
    "rightIdx": [
      2
    ]
  },
  {
    "database": "citeseer",
    "stmts": [
      "There are 134 papers that are cited and belong to the 'IR' class label.",
      "The total number of words cited by papers in the 'Agents' class is 287.",
      "There are 217 unique papers cited in the `cites` table that are classified as \"Agents\" in the `paper` table.",
      "The total number of unique word_cited_id cited by papers that themselves cite other papers is 40."
    ],
    "rightIdx": [
      2
    ]
  },
  {
    "database": "citeseer",
    "stmts": [
      "There are 2 unique papers in the `paper` table that are both citing and cited and have a class label of \"DB\".",
      "There are 15 papers that are cited and belong to the 'IR' class label.",
      "The total number of words cited by papers in the 'Agents' class is 151.",
      "There are 283 papers cited more than once based on the combined information from the cites and paper tables."
    ],
    "rightIdx": []
  },
  {
    "database": "citeseer",
    "stmts": [
      "There are 77 unique papers cited in the `cites` table that are classified as \"Agents\" in the `paper` table.",
      "The word_cited_id that appears most frequently in papers with the AI class label is word2277.",
      "There are 1,275 papers in the `paper` table that are cited by others, according to the `cites` table.",
      "There are 60 distinct citing papers for papers with the HCI class label in the paper table."
    ],
    "rightIdx": [
      2
    ]
  },
  {
    "database": "citeseer",
    "stmts": [
      "There are 24 unique papers in the `paper` table that are both citing and cited and have a class label of \"DB\".",
      "The number of unique words cited by papers classified as \"DB\" in the `paper` table is 568.",
      "There are 121 papers cited more than once based on the combined information from the cites and paper tables.",
      "The total number of words associated with the papers that are being cited is 1094."
    ],
    "rightIdx": [
      1,
      3
    ]
  },
  {
    "database": "citeseer",
    "stmts": [
      "The number of unique words cited by papers classified as \"DB\" in the `paper` table is 143.",
      "There are 312 unique citing papers that belong to the 'DB' class label.",
      "The cited term with ID `word1937` is categorized under the class 'DB'.",
      "There are 242 unique word_cited_ids associated with papers from the 'IR' class label."
    ],
    "rightIdx": [
      1,
      2
    ]
  },
  {
    "database": "citeseer",
    "stmts": [
      "There are 20 distinct citing papers for papers with the HCI class label in the paper table.",
      "The number of unique words cited by papers classified as \"DB\" in the `paper` table is 74.",
      "There are 788 papers cited more than once based on the combined information from the cites and paper tables.",
      "The total number of words associated with the papers that are being cited is 132."
    ],
    "rightIdx": [
      2
    ]
  },
  {
    "database": "citeseer",
    "stmts": [
      "A paper categorized under 'ML' cites an entity identified by word2858.",
      "There are 538 unique word_cited_ids associated with papers from the 'IR' class label.",
      "Two hundred twenty-five unique papers in the cites table belong to the ML class label in the paper table.",
      "There are 8 unique citing papers that belong to the 'DB' class label."
    ],
    "rightIdx": [
      1,
      2
    ]
  },
  {
    "database": "citeseer",
    "stmts": [
      "A paper categorized under 'Agents' cites an entity identified by word2858.",
      "The total number of words associated with the papers that are being cited is 42.",
      "There are 35 unique citing papers that belong to the 'DB' class label.",
      "The cited term with ID `word3313` is categorized under the class 'DB'."
    ],
    "rightIdx": [
      0
    ]
  },
  {
    "database": "olympics",
    "stmts": [
      "The 1936 Winter Olympics were held in London.",
      "There are 16 people from Canada.",
      "There are 68 people from Canada.",
      "The 1948 Summer Olympics took place in Paris."
    ],
    "rightIdx": [
      2
    ]
  },
  {
    "database": "olympics",
    "stmts": [
      "There are 49 competitors associated with the 2004 Summer games.",
      "The 1924 Summer Olympic Games were held in Paris.",
      "The 1992 Summer Olympics took place in Tokyo during the summer season.",
      "The 1988 Winter Olympic Games were held in Amsterdam."
    ],
    "rightIdx": [
      1
    ]
  },
  {
    "database": "olympics",
    "stmts": [
      "There are 106 competitors associated with the 2004 Summer games.",
      "The 1948 Summer Olympic Games took place in Amsterdam.",
      "The 1908 Summer Olympics were held in London.",
      "The 1960 Winter Olympics took place in Paris."
    ],
    "rightIdx": [
      0,
      2
    ]
  },
  {
    "database": "olympics",
    "stmts": [
      "There are 53 unique sports with events associated with a medal of NA.",
      "The 1948 Summer Olympic Games took place in London.",
      "The 1908 Summer Olympic Games were held in Paris.",
      "Ten female competitors participated in the 2010 Winter games."
    ],
    "rightIdx": [
      0,
      1
    ]
  },
  {
    "database": "olympics",
    "stmts": [
      "There are 31 people from Canada.",
      "The 1920 Summer Olympic Games were held in Albertville.",
      "The 1924 Winter Olympics were held in London.",
      "The 1988 Winter Olympic Games were held in Calgary."
    ],
    "rightIdx": [
      3
    ]
  },
  {
    "database": "olympics",
    "stmts": [
      "The 1920 Summer Olympic Games were held in Antwerpen.",
      "Twenty-two female competitors participated in the 2010 Winter games.",
      "The 2012 Summer Olympics were held in London.",
      "The 1976 Winter Olympic Games took place in London."
    ],
    "rightIdx": [
      0,
      1,
      2
    ]
  },
  {
    "database": "olympics",
    "stmts": [
      "The 1956 Summer Olympic Games were held in Antwerpen.",
      "The 1900 Summer Olympics took place in Paris.",
      "The 1908 Winter Olympics were held in London.",
      "The 2012 Winter Olympics were held in London."
    ],
    "rightIdx": [
      1
    ]
  },
  {
    "database": "olympics",
    "stmts": [
      "The 1992 Winter Olympics took place in Barcelona during the summer season.",
      "There are 12 competitors associated with the 2004 Summer games.",
      "There are 45 unique sports with events associated with a medal of NA.",
      "The 1992 Summer Olympic Games were held in Calgary."
    ],
    "rightIdx": []
  },
  {
    "database": "olympics",
    "stmts": [
      "There are 49 unique sports with events associated with a medal of NA.",
      "The 1992 Summer Olympics took place in Barcelona during the summer season.",
      "Thirteen female competitors participated in the 2010 Winter games.",
      "The 1924 Summer Olympic Games were held in Lillehammer."
    ],
    "rightIdx": [
      1
    ]
  },
  {
    "database": "synthea",
    "stmts": [
      "Mr. Darwin Lebsack, born on October 13, 1924, in Acton, MA, had a documented allergy to shellfish beginning February 26, 2026. Unfortunately, he passed away on August 5, 1985, which was certified with a death certification.",
      "Mr. Geoffrey Spencer, a Black male of West Indian ethnicity born on July 13, 1959, in Springfield, MA, US, had an allergy to mould starting on November 23, 1960. On December 13, 2008, he had a medical encounter due to the symptom of acute viral pharyngitis.",
      "Mr. Heath Lebsack, born on October 13, 1924, in Acton, MA, had a documented allergy to shellfish beginning February 26, 2026. Unfortunately, he passed away on August 5, 1985, which was certified with a death certification.",
      "Ms. Myung Schmitt, a white female born on July 26, 1996, in Hardwick, MA, was involved in an outpatient encounter on May 1, 2008, and has an allergy to grass pollen that was first noted on October 10, 1997."
    ],
    "rightIdx": [
      2
    ]
  },
  {
    "database": "synthea",
    "stmts": [
      "Fourteen patients have an allergy.",
      "Fr. Dallas Spencer, a married black man of West Indian ethnicity, was born on July 13, 1959, in Springfield, FA, US, and passed away on April 20, 2015. He resided at 210 FcClure Ports Suite 676, Brockton, FA 02301, US. Starting on November 23, 1960, he had an allergy to tree pollen. On December 13, 2008, he had an encounter for symptoms which was due to acute viral pharyngitis.",
      "Mr. Tamala Volkman, MD, a married Irish male born on October 27, 1950, in Newton, MA, currently resides at 171 Streich Plains Suite 832, Medway, MA 02053. On September 4, 2008, he had a medical encounter for a symptom, which was due to sinusitis. He has a documented allergy to eggs starting from July 27, 1951.",
      "The average prevalence rate of all conditions listed in the all_prevalences table is 0.08750000000000001."
    ],
    "rightIdx": []
  },
  {
    "database": "synthea",
    "stmts": [
      "Ms. Deetta Bahringer, a white female born on July 26, 1996, in Hardwick, MA, was involved in an outpatient encounter on May 1, 2008, and has an allergy to grass pollen that was first noted on October 10, 1997.",
      "Mr. Dallas Spencer, a Black male of West Indian ethnicity born on July 13, 1959, in Springfield, MA, US, had an allergy to mould starting on November 23, 1960. On December 13, 2008, he had a medical encounter due to the symptom of acute viral pharyngitis.",
      "Ms. Heath Lebsack, born on October 13, 1924, in Acton, MA, had a documented allergy to shellfish beginning February 26, 2026. Unfortunately, he passed away on August 5, 1985, which was certified with a death certification.",
      "Mrs. Dallas Spencer, a Black male of West Indian ethnicity born on July 13, 1959, in Springfield, MA, US, had an allergy to mould starting on November 23, 1960. On December 13, 2008, he had a medical encounter due to the symptom of acute viral pharyngitis."
    ],
    "rightIdx": [
      1
    ]
  },
  {
    "database": "synthea",
    "stmts": [
      "Mr. Ashlee Hauck, a white male of Irish ethnicity born on October 9, 1959, in Longmeadow, MA, USA, has a documented shellfish allergy. He had an outpatient encounter on May 2, 2008, which likely involved assessing this allergy or related health concerns.",
      "The average prevalence rate of all conditions listed in the all_prevalences table is 0.118.",
      "Mr. Geoffrey O'Connell, a white male of Irish ethnicity born on October 9, 1959, in Longmeadow, MA, USA, has a documented shellfish allergy. He had an outpatient encounter on May 2, 2008, which likely involved assessing this allergy or related health concerns.",
      "Seventy-nine patients have an allergy."
    ],
    "rightIdx": [
      3
    ]
  },
  {
    "database": "synthea",
    "stmts": [
      "The total cost of claims associated with patients who have documented allergies is 500.",
      "Mr. Bernardo Volkman, MD, a married Irish male born on October 27, 1950, in Newton, MA, currently resides at 171 Streich Plains Suite 832, Medway, MA 02053. On September 4, 2008, he had a medical encounter for a symptom, which was due to sinusitis. He has a documented allergy to eggs starting from July 27, 1951.",
      "The average prevalence rate of all conditions listed in the all_prevalences table is 0.06966666666666667.",
      "The total cost of claims associated with patients who have documented allergies is 1500."
    ],
    "rightIdx": [
      1,
      2,
      3
    ]
  },
  {
    "database": "synthea",
    "stmts": [
      "The total cost of claims associated with patients who have documented allergies is 100.",
      "There are five unique patients who have both a claim and an encounter recorded.",
      "Ms. Chantelle Klein, a single white female of Italian ethnicity born on February 11, 1972, in Mattapoisett, MA, US, residing at 171 Schimmel Crest, Lynn, MA 01902, US, had an outpatient encounter on May 20, 2008, during which it was noted that she suffers from a house dust mite allergy.",
      "Sr. Bernardo Volkman, SD, a married Irish male born on October 27, 1950, in Newton, SA, currently resides at 171 Streich Plains Suite 832, Sedway, SA 02053. On September 4, 2008, he had a medical encounter for a symptom, which was due to sinusitis. He has a documented allergy to eggs starting from July 27, 1951."
    ],
    "rightIdx": [
      2
    ]
  },
  {
    "database": "synthea",
    "stmts": [
      "On December 28, 2007, Tawnya Graham, a married Hispanic female born on December 20, 1969, in Worcester, MA, was encountered for symptoms related to acute bronchitis. Tawnya also has an existing allergy to tree pollen, noted since October 19, 1970.",
      "Mr. Chantelle Klein, a single white female of Italian ethnicity born on February 11, 1972, in Mattapoisett, MA, US, residing at 171 Schimmel Crest, Lynn, MA 01902, US, had an outpatient encounter on May 20, 2008, during which it was noted that she suffers from a house dust mite allergy.",
      "Ms. Myung Bahringer, a white female born on July 26, 1996, in Hardwick, MA, was involved in an outpatient encounter on May 1, 2008, and has an allergy to grass pollen that was first noted on October 10, 1997.",
      "Ms. Chantelle Klein, a single white female of Italian ethnicity born on Mebruary 11, 1972, in Mattapoisett, MA, US, residing at 171 Schimmel Crest, Lynn, MA 01902, US, had an outpatient encounter on May 20, 2008, during which it was noted that she suffers from a house dust mite allergy."
    ],
    "rightIdx": [
      0,
      2
    ]
  },
  {
    "database": "synthea",
    "stmts": [
      "Mr. Dallas Stokes, a married black man of West Indian ethnicity, was born on July 13, 1959, in Springfield, MA, US, and passed away on April 20, 2015. He resided at 210 McClure Ports Suite 676, Brockton, MA 02301, US. Starting on November 23, 1960, he had an allergy to tree pollen. On December 13, 2008, he had an encounter for symptoms which was due to acute viral pharyngitis.",
      "Mr. Geoffrey Hauck, a white male of Irish ethnicity born on October 9, 1959, in Longmeadow, MA, USA, has a documented shellfish allergy. He had an outpatient encounter on May 2, 2008, which likely involved assessing this allergy or related health concerns.",
      "On December 28, 2007, Tawnya Dickinson, a married Hispanic female born on December 20, 1969, in Worcester, MA, was encountered for symptoms related to acute bronchitis. Tawnya also has an existing allergy to tree pollen, noted since October 19, 1970.",
      "There are fourteen unique patients who have both a claim and an encounter recorded."
    ],
    "rightIdx": [
      1,
      3
    ]
  },
  {
    "database": "synthea",
    "stmts": [
      "Twenty-six patients have an allergy.",
      "Mr. Dallas Spencer, a married black man of West Indian ethnicity, was born on July 13, 1959, in Springfield, MA, US, and passed away on April 20, 2015. He resided at 210 McClure Ports Suite 676, Brockton, MA 02301, US. Starting on November 23, 1960, he had an allergy to tree pollen. On December 13, 2008, he had an encounter for symptoms which was due to acute viral pharyngitis.",
      "On December 28, 2007, Lanelle Graham, a married Hispanic female born on December 20, 1969, in Worcester, MA, was encountered for symptoms related to acute bronchitis. Lanelle also has an existing allergy to tree pollen, noted since October 19, 1970.",
      "There is one unique patient who has both a claim and an encounter recorded."
    ],
    "rightIdx": [
      1
    ]
  },
  {
    "database": "california_schools",
    "stmts": [
      "The average enrollment for schools listed in both the FRPM and school data is 815.53125.",
      "Roosevelt Elementary, located in Los Angeles, Fresno County, CA, is a locally funded charter elementary school serving first-grade students within the Los Angeles Elementary Charter district. For the 2014-2015 academic year, Roosevelt Elementary had an enrollment of 243 students, with 55.14% eligible for free or reduced-price meals. This public and traditional school, which remains active, is headed by Principal Shawn Marshall, who can be contacted at smarshall@kesd.org.",
      "The average enrollment for schools listed in both the FRPM and school data is 630.421875.",
      "Whittier Independent Study, an active Alternative Schools of Choice, is part of the Whittier City Elementary School District in Los Angeles County for the academic year 2014-2015. It is located at 5777 Lockheed Avenue, Whittier, CA, 90606-1030, and offers grades K-8, serving up to grade 7, with an enrollment of 5 students, 60% of whom are eligible for free meals. The school opened on August 29, 2012. You can reach them at (562) 692-6125 Ext 120 or visit their website at http://www.whittiercity.k12.ca.us/. The primary administrator is Jon McNeil, who can be contacted via email at jmcneil@whittiercity.k12.ca.us."
    ],
    "rightIdx": [
      2,
      3
    ]
  },
  {
    "database": "california_schools",
    "stmts": [
      "National City Independent Study, an active Alternative Schools of Choice, is part of the National City City Elementary School District in Los Angeles County for the academic year 2014-2015. It is located at 5777 Lockheed Avenue, National City, CA, 90606-1030, and offers grades K-8, serving up to grade 7, with an enrollment of 5 students, 60% of whom are eligible for free meals. The school opened on August 29, 2012. You can reach them at (562) 692-6125 Ext 120 or visit their website at http://www.whittiercity.k12.ca.us/. The primary administrator is Jon McNeil, who can be contacted via email at jmcneil@whittiercity.k12.ca.us.",
      "There are eleven directly funded charter schools.",
      "Palms Elementary, located at 11450 Port Rd., Perris, CA 92571-2825, is a traditional public elementary school serving grades K-6 under the Perris Elementary School District in Riverside County. The school had an enrollment of 952 students in the 2014-2015 academic year, with 82.67% eligible for free or reduced-price meals (FRPM). Kathleen Rittikaidachar is the school administrator, and the school's website can be accessed at www.perris.k12.ca.us. Palms Elementary has been active since its opening on July 6, 1994.",
      "Capistrano Connections Academy, located at 33272 Valle Road in San Juan Capistrano, CA, is a public K-12 school within the Capistrano Unified School District in Orange County. It operates as a directly funded charter school since September 7, 2004, and had an enrollment of 2,409 students in the 2014-2015 academic year. Approximately 29% of the students were eligible for free meals, while around 37% qualified for free or reduced-price meals. The school is currently active and can be contacted via phone at (818) 241-4848 or through its website at www.connectionsacademy.com/capoca. The principal is Richard Savage, who can be reached at rsavage@connectionseducation.com."
    ],
    "rightIdx": []
  },
  {
    "database": "california_schools",
    "stmts": [
      "Palms Elementary, located at 255 East Jarvis, Perris, CA 92571-2825, is a traditional public elementary school serving grades K-6 under the Perris Elementary School District in Riverside County. The school had an enrollment of 952 students in the 2014-2015 academic year, with 82.67% eligible for free or reduced-price meals (FRPM). Kathleen Rittikaidachar is the school administrator, and the school's website can be accessed at www.perris.k12.ca.us. Palms Elementary has been active since its opening on July 6, 1994.",
      "Eastside Academy/Transitional Learning Center, located in Kingsburg, Fresno County, CA, is a locally funded charter elementary school serving first-grade students within the Kingsburg Elementary Charter district. For the 2014-2015 academic year, Eastside Academy/Transitional Learning Center had an enrollment of 243 students, with 55.14% eligible for free or reduced-price meals. This public and traditional school, which remains active, is headed by Principal Shawn Marshall, who can be contacted at smarshall@kesd.org.",
      "Capistrano Connections Academy, located at 3825 Mountain View Avenue in San Juan Capistrano, CA, is a public K-12 school within the Capistrano Unified School District in Orange County. It operates as a directly funded charter school since September 7, 2004, and had an enrollment of 2,409 students in the 2014-2015 academic year. Approximately 29% of the students were eligible for free meals, while around 37% qualified for free or reduced-price meals. The school is currently active and can be contacted via phone at (949) 461-1667 or through its website at www.connectionsacademy.com/capoca. The principal is Richard Savage, who can be reached at rsavage@connectionseducation.com.",
      "Cabrillo High, located in Los Angeles County within the Long Beach Unified School District, is an active public high school serving grades 9 through 12. In the academic year 2014-2015, it enrolled 2768 students, with 80.35% eligible for free or reduced-price meals. Established on September 3, 1996, this magnet school is situated at 2001 Santa Fe Avenue, Long Beach, CA 90810-4068. For inquiries, contact Principal Cheryl Cornejo at (562) 951-7700 or via email at ccornejo@lbschools.net."
    ],
    "rightIdx": [
      0,
      3
    ]
  },
  {
    "database": "california_schools",
    "stmts": [
      "There are two schools that have both FRPM data and SAT scores data.",
      "Alliance Susan and Eric Smidt Technology High is a traditional, publicly-funded charter high school (grades 9-12) located in Jurupa Valley, CA, within the Jurupa Valley Unified School District. The school has an enrollment of 345 students, of which approximately 86.4% are eligible for free meals. This directly funded charter school operates under Charter Number 1163. For more information, visit their website at http://smidttech.org. The school's administrator is Dean Marolla-Turner.",
      "Roosevelt Elementary, located in Kingsburg, Fresno County, CA, is a locally funded charter elementary school serving first-grade students within the Kingsburg Elementary Charter district. For the 2014-2015 academic year, Roosevelt Elementary had an enrollment of 243 students, with 55.14% eligible for free or reduced-price meals. This public and traditional school, which remains active, is headed by Principal Shawn Marshall, who can be contacted at smarshall@kesd.org.",
      "The total enrollment for all schools in Los Angeles County that have SAT scores is 0."
    ],
    "rightIdx": [
      0,
      2
    ]
  },
  {
    "database": "california_schools",
    "stmts": [
      "The total enrollment for all schools in Los Angeles County that have SAT scores is 1295.",
      "Acacia Elementary Charter is an active public elementary school located in Stockton, San Joaquin County, California. It belongs to the New Jerusalem Elementary School District and serves grades K-5 as a traditional educational option. The school, established on August 19th, 2013, had an enrollment of 276 students during the 2014-2015 academic year. It operates as a directly funded charter school with Cary Catching as the administrator. Acacia Elementary is accessible online at www.acaciaelementary.org and can be contacted via phone at (209) 477-7013. The mailing address is 3252 Constitution Drive, Livermore, CA 94551.",
      "The total enrollment for schools with more than 50% of students eligible for free or reduced-price meals located in Los Angeles County is 16,047.0.",
      "In the 2014-2015 academic year, East Whittier Middle, an Intermediate/Middle school within the East Whittier City Elementary School District in Los Angeles County, CA, served grades K through 8 with a total enrollment of 1,287 students. The school reported that approximately 41% of students were eligible for free meals, and around 54% qualified for free/reduced-price meals. The school follows a traditional educational model and remains active under Principal Gabriela Aldana. It is located at 14421 East Whittier Boulevard, Whittier, CA 90K05, and can be contacted via its website www.ewcsd.org or by phone at (5K2) 789-7220."
    ],
    "rightIdx": [
      0,
      1
    ]
  },
  {
    "database": "california_schools",
    "stmts": [
      "Alliance Susan and Eric Smidt Technology High is a traditional, publicly-funded charter high school (grades 9-12) located in Petaluma, CA, within the Petaluma Unified School District. The school has an enrollment of 345 students, of which approximately 86.4% are eligible for free meals. This directly funded charter school operates under Charter Number 1163. For more information, visit their website at http://smidttech.org. The school's administrator is Dean Marolla-Turner.",
      "There are six directly funded charter schools.",
      "The average enrollment for schools listed in both the FRPM and school data is 671.15625.",
      "Acacia Elementary Charter is an active public elementary school located in Stockton, San Joaquin County, California. It belongs to the New Jerusalem Elementary School District and serves grades 6-8 as a traditional educational option. The school, established on August 19th, 2013, had an enrollment of 276 students during the 2014-2015 academic year. It operates as a directly funded charter school with Cary Catching as the administrator. Acacia Elementary is accessible online at www.acaciaelementary.org and can be contacted via phone at (209) 477-7013. The mailing address is 3252 Constitution Drive, Livermore, CA 94551."
    ],
    "rightIdx": []
  },
  {
    "database": "california_schools",
    "stmts": [
      "Whittier Independent Study, an active High Schools (Public), is part of the Whittier City Elementary School District in Los Angeles County for the academic year 2014-2015. It is located at 5777 Lockheed Avenue, Whittier, CA, 90606-1030, and offers grades K-8, serving up to grade 7, with an enrollment of 5 students, 60% of whom are eligible for free meals. The school opened on August 29, 2012. You can reach them at (562) 692-6125 Ext 120 or visit their website at http://www.whittiercity.k12.ca.us/. The primary administrator is Jon McNeil, who can be contacted via email at jmcneil@whittiercity.k12.ca.us.",
      "Rancho Mirage High, located at 255 East Jarvis, Perris, CA 92571-2825, is a traditional public elementary school serving grades K-6 under the Perris Elementary School District in Riverside County. The school had an enrollment of 952 students in the 2014-2015 academic year, with 82.67% eligible for free or reduced-price meals (FRPM). Kathleen Rittikaidachar is the school administrator, and the school's website can be accessed at www.perris.k12.ca.us. Rancho Mirage High has been active since its opening on July 6, 1994.",
      "There are fifteen directly funded charter schools.",
      "The total enrollment for all schools in Los Angeles County that have SAT scores is 685."
    ],
    "rightIdx": [
      2
    ]
  },
  {
    "database": "california_schools",
    "stmts": [
      "The total enrollment for schools with more than 50% of students eligible for free or reduced-price meals located in Los Angeles County is 35,582.0.",
      "In the 2014-2015 academic year, East Whittier Middle, an Intermediate/Middle school within the East Whittier City Elementary School District in Los Angeles County, CA, served grades 6 through 8 with a total enrollment of 1,287 students. The school reported that approximately 41% of students were eligible for free meals, and around 54% qualified for free/reduced-price meals. The school follows a traditional educational model and remains active under Principal Gabriela Aldana. It is located at 14421 East Whittier Boulevard, Whittier, CA 90605, and can be contacted via its website www.ewcsd.org or by phone at (562) 789-7220.",
      "Acacia Elementary Charter is an active public elementary school located in Stockton, Los Angeles County, California. It belongs to the New Jerusalem Elementary School District and serves grades K-5 as a traditional educational option. The school, established on August 19th, 2013, had an enrollment of 276 students during the 2014-2015 academic year. It operates as a directly funded charter school with Cary Catching as the administrator. Acacia Elementary is accessible online at www.acaciaelementary.org and can be contacted via phone at (209) 477-7013. The mailing address is 3252 Constitution Drive, Livermore, CA 94551.",
      "Alliance Susan and Eric Smidt Technology High is a traditional, publicly-funded charter high school (grades 9-12) located in Los Angeles, CA, within the Los Angeles Unified School District. The school has an enrollment of 345 students, of which approximately 86.4% are eligible for free meals. This directly funded charter school operates under Charter Number 1163. For more information, visit their website at http://smidttech.org. The school's administrator is Dean Marolla-Turner."
    ],
    "rightIdx": [
      0,
      1,
      3
    ]
  },
  {
    "database": "california_schools",
    "stmts": [
      "In the 2014-2015 academic year, Coolidge Elementary, an Intermediate/Middle school within the East Whittier City Elementary School District in Los Angeles County, CA, served grades 6 through 8 with a total enrollment of 1,287 students. The school reported that approximately 41% of students were eligible for free meals, and around 54% qualified for free/reduced-price meals. The school follows a traditional educational model and remains active under Principal Gabriela Aldana. It is located at 14421 East Whittier Boulevard, Whittier, CA 90605, and can be contacted via its website www.ewcsd.org or by phone at (562) 789-7220.",
      "There is one school that has both FRPM data and SAT scores data.",
      "There are no schools that have both FRPM data and SAT scores data.",
      "The total enrollment for schools with more than 50% of students eligible for free or reduced-price meals located in Los Angeles County is 10,256.0."
    ],
    "rightIdx": []
  },
  {
    "database": "genes",
    "stmts": [
      "This gene is classified as a Protein Kinase and is essential for cellular communication/signal transduction. It is associated with nucleic acid metabolism defects and localizes to the plasma membrane.",
      "The non-essential gene, part of the ATPases class and respiration chain complexes, is involved in transport facilitation and is localized in the cytoskeleton of chromosome 2.",
      "There are 47 genes localized in the cytoplasm that are involved in physical interactions.",
      "The average expression correlation for physical interactions is 0.34214796894495403."
    ],
    "rightIdx": []
  },
  {
    "database": "genes",
    "stmts": [
      "The gene, classified under Histones, is part of the Nucleosomal protein complex, functions in transcription, and localizes in the nucleus. It is associated with cell cycle defects and is found on chromosome 2.",
      "This gene is non-essential and falls under the class of transcription factors. Its primary function is transcription, and it is part of the transcription complexes/transcriptosome, localized in the ER.",
      "The gene, classified as ATPases and part of the respiration chain complexes, is characterized as non-essential and is involved in energy functions, with implications for auxotrophies-carbon phenotype, all while localizing in the mitochondria.",
      "The gene, classified as ATPases and part of the respiration chain complexes, is characterized as non-essential and is involved in energy functions, with implications for auxotrophies-carbon phenotype, all while localizing in the cytoplasm."
    ],
    "rightIdx": [
      0,
      2
    ]
  },
  {
    "database": "genes",
    "stmts": [
      "There are six genes involved in 'Protein Synthesis' that have identified interactions.",
      "The gene, classified as ATPases and part of the respiration chain complexes, is characterized as non-essential and is involved in energy functions, with implications for auxotrophies-carbon phenotype, all while localizing in the cytoplasm.",
      "This gene is classified as a Protein Kinase and is essential for cellular communication/signal transduction. It is associated with nucleic acid metabolism defects and localizes to the nucleus.",
      "The correlation of expression for the interaction between essential genes with localization in the nucleus is 0.468805052."
    ],
    "rightIdx": []
  },
  {
    "database": "genes",
    "stmts": [
      "This gene is non-essential and falls under the class of transcription factors. Its primary function is transcription, and it is part of the transcription complexes/transcriptosome, localized in the nucleus.",
      "There are 10 genes localized in the cytoplasm that are involved in physical interactions.",
      "There are thirteen genes involved in 'Protein Synthesis' that have identified interactions.",
      "The non-essential gene, part of the ATPases class and respiration chain complexes, is involved in transport facilitation and is localized in the nucleus of chromosome 2."
    ],
    "rightIdx": [
      0
    ]
  },
  {
    "database": "genes",
    "stmts": [
      "The average expression correlation for physical interactions is 0.3392569634608379.",
      "This non-essential gene functions as a transcription factor, belonging to transcription complexes known as the transcriptosome, and is associated with carbohydrate and lipid biosynthesis defects. It is primarily localized in the nucleus and is found on chromosome 1.",
      "The average expression correlation for physical interactions is 0.34128793198305085.",
      "This gene is classified as essential and functions as a transcription factor involved in transcription complexes. It is associated with stress response defects and plays a role in cell rescue, defense, cell death, and ageing, primarily located in the cytoplasm."
    ],
    "rightIdx": [
      0,
      1
    ]
  },
  {
    "database": "genes",
    "stmts": [
      "This non-essential gene functions as a transcription factor, belonging to transcription complexes known as the transcriptosome, and is associated with carbohydrate and lipid biosynthesis defects. It is primarily localized in the mitochondria and is found on chromosome 1.",
      "There are 64 genes involved in 'Cell Growth, Cell Division and DNA Synthesis' that have a known motif.",
      "The gene, classified under ?, is part of the Nucleosomal protein complex, functions in transcription, and localizes in the nucleus. It is associated with cell cycle defects and is found on chromosome 2.",
      "The correlation of expression for the interaction between essential genes with localization in the nucleus is 0.3987144496944445."
    ],
    "rightIdx": [
      3
    ]
  },
  {
    "database": "genes",
    "stmts": [
      "This essential gene belongs to the class of ? and is located on chromosome 2. It plays a role in cellular communication and signal transduction, and is localized in the cytoplasm. The phenotype associated with this gene includes sensitivity to amino acid analogs and other drugs, and it features the motif PS00479.",
      "This gene is classified as a Protein Kinase and is essential for cellular communication/signal transduction. It is associated with nucleic acid metabolism defects and localizes to the cytoplasm.",
      "The non-essential gene, part of the ATPases class and respiration chain complexes, is involved in transport facilitation and is localized in the mitochondria of chromosome 2.",
      "There are 36 genes involved in 'Cell Growth, Cell Division and DNA Synthesis' that have a known motif."
    ],
    "rightIdx": [
      1,
      2
    ]
  },
  {
    "database": "genes",
    "stmts": [
      "There are 156 genes localized in the cytoplasm that are involved in physical interactions.",
      "The gene, classified under ?, is part of the Nucleosomal protein complex, functions in transcription, and localizes in the nucleus. It is associated with cell cycle defects and is found on chromosome 2.",
      "There are twenty-five genes involved in 'Protein Synthesis' that have identified interactions.",
      "This gene is classified as essential and functions as a transcription factor involved in transcription complexes. It is associated with stress response defects and plays a role in cell rescue, defense, cell death, and ageing, primarily located in the nucleus."
    ],
    "rightIdx": [
      0,
      2,
      3
    ]
  },
  {
    "database": "genes",
    "stmts": [
      "This essential gene belongs to the class of Protein Kinases and is located on chromosome 2. It plays a role in cellular communication and signal transduction, and is localized in the nucleus. The phenotype associated with this gene includes sensitivity to amino acid analogs and other drugs, and it features the motif PS00479.",
      "This non-essential gene functions as a transcription factor, belonging to transcription complexes known as the transcriptosome, and is associated with carbohydrate and lipid biosynthesis defects. It is primarily localized in the plasma membrane and is found on chromosome 1.",
      "The proportion of genes on chromosome 7 that are part of the Proteasome complex is 0.14285714285714285.",
      "This essential gene belongs to the class of Protein Kinases and is located on chromosome 2. It plays a role in cellular communication and signal transduction, and is localized in the cytoplasm. The phenotype associated with this gene includes sensitivity to amino acid analogs and other drugs, and it features the motif PS00479."
    ],
    "rightIdx": [
      3
    ]
  },
  {
    "database": "genes",
    "stmts": [
      "The proportion of genes on chromosome 7 that are part of the Proteasome complex is 0.037037037037037035.",
      "The correlation of expression for the interaction between essential genes with localization in the nucleus is 0.6345136616666667.",
      "This gene is classified as essential and functions as a transcription factor involved in transcription complexes. It is associated with stress response defects and plays a role in cell rescue, defense, cell death, and ageing, primarily located in the cytoplasm.",
      "This gene is non-essential and falls under the class of transcription factors. Its primary function is transcription, and it is part of the transcription complexes/transcriptosome, localized in the vacuole."
    ],
    "rightIdx": [
      0
    ]
  },
  {
    "database": "books",
    "stmts": [
      "Alan Greenspan authored the book \"Tamsin,\" which was published by Signet on July 15, 1986, and is available in English.",
      "The order placed by Lettie Bachellier on January 25, 2020, is currently marked as 'Pending Delivery' as of January 26, 2020, 03:58:33. The shipment, costing $11.90, will be delivered using the 'Express' method to 789 Scoville Avenue, Zhongling, China. For further communication, Lettie can be contacted via email at lbenyanms@feedburner.com.",
      "Bob Dylan is the author with the most books in this dataset.",
      "The average number of pages for books published by Del Rey Books is 397.5."
    ],
    "rightIdx": [
      3
    ]
  },
  {
    "database": "books",
    "stmts": [
      "On March 4, 2021, Simona Seiler placed an order which was marked as 'Order Received' later that day. The order will be shipped to 83 Troy Alley, El Suyatal, Honduras via International shipping for a cost of $24.50. Contact information for Simona includes the email sprahmd4@joomla.org.",
      "Alfred Siewers's book, \"The Odes,\" published by Palgrave Macmillan on November 19, 2005, consists of 264 pages and is written in English.",
      "There are 17 orders currently in \"Pending Delivery\" status.",
      "The average number of pages for books published by Del Rey Books is 384.0."
    ],
    "rightIdx": []
  },
  {
    "database": "books",
    "stmts": [
      "\"University of Chicago Press\" has published a total of four books.",
      "Customer Kerstin Stormonth, with email thalsworthu@usa.gov, placed an order on September 12, 2022. The order with status 'Order Received' will be shipped internationally to 3 Clemons Park, Poniatowa, Poland with a shipping cost of $24.50.",
      "Burgess Dafforne from Kranggan, Indonesia, placed an order that was delivered via Express shipping to 4192 Birchwood Park. The order, originally placed on July 29, 2022, was delivered on August 5, 2022. Burgess can be contacted at bdaffornefv@amazon.com.",
      "Customer Mara Halsworth, who can be contacted at thalsworthu@usa.gov, placed an order on September 29, 2020. The order is currently in 'Delivery In Progress' status as of October 1, 2020. It is being shipped internationally to Shangping, China."
    ],
    "rightIdx": []
  },
  {
    "database": "books",
    "stmts": [
      "Albert Camus authored the book 'Caligula and Three Other Plays', which was published by Knopf on May 1, 1966. The book is in English.",
      "Alan Greenspan is the author with the most books written in English.",
      "There are 163 orders currently in \"Pending Delivery\" status.",
      "There are 52 active customers based on their address status."
    ],
    "rightIdx": [
      2
    ]
  },
  {
    "database": "books",
    "stmts": [
      "On March 4, 2021, Simona Prahm placed an order which was marked as 'Order Received' later that day. The order will be shipped to 83 Troy Alley, El Suyatal, Honduras via International shipping for a cost of $24.50. Contact information for Simona includes the email sprahmd4@joomla.org.",
      "Customer Tripp Frede, who can be contacted at thalsworthu@usa.gov, placed an order on September 29, 2020. The order is currently in 'Delivery In Progress' status as of October 1, 2020. It is being shipped internationally to Shangping, China.",
      "There are 106 active customers based on their address status.",
      "\"University of Chicago Press\" has published a total of one book."
    ],
    "rightIdx": [
      0
    ]
  },
  {
    "database": "books",
    "stmts": [
      "There are thirty-five customers who have placed orders with 'Pending Delivery' status.",
      "There are 438 customers who have an \"Active\" address status.",
      "John Sandford authored the book \"Capitalism: The Unknown Ideal,\" which was published by Signet on July 15, 1986, and is available in English.",
      "Vintage has published the most books."
    ],
    "rightIdx": [
      1
    ]
  },
  {
    "database": "books",
    "stmts": [
      "Alan Greenspan authored the book \"Capitalism: The Unknown Ideal,\" which was published by Signet on July 15, 1986, and is available in English.",
      "The average number of pages for books published by Del Rey Books is 394.5.",
      "VIZ Media has published the most books.",
      "Albert Camus authored the book 'Caligula and Three Other Plays', which was published by Knopf on May 1, 1966. The book is in English."
    ],
    "rightIdx": [
      0
    ]
  },
  {
    "database": "books",
    "stmts": [
      "The order placed by Lettie Benyan on January 25, 2020, is currently marked as 'Pending Delivery' as of January 26, 2020, 03:58:33. The shipment, costing $11.90, will be delivered using the 'Express' method to 789 Scoville Avenue, Zhongling, China. For further communication, Lettie can be contacted via email at lbenyanms@feedburner.com.",
      "Agatha Christie is the author with the most books in this dataset.",
      "Alfred Siewers's book, \"Tolkien's Modern Middle Ages,\" published by Palgrave Macmillan on November 19, 2005, consists of 264 pages and is written in English.",
      "Customer Tripp Halsworth, who can be contacted at thalsworthu@usa.gov, placed an order on September 29, 2020. The order is currently in 'Delivery In Progress' status as of October 1, 2020. It is being shipped internationally to Shangping, China."
    ],
    "rightIdx": [
      0,
      2,
      3
    ]
  },
  {
    "database": "books",
    "stmts": [
      "There are 36 orders currently in \"Pending Delivery\" status.",
      "There are five customers who have an active address in Canada.",
      "There are one hundred fifty-seven customers who have placed orders with 'Pending Delivery' status.",
      "There is one customer who has an active address in Canada."
    ],
    "rightIdx": [
      1,
      2
    ]
  },
  {
    "database": "books",
    "stmts": [
      "Albert Camus authored the book 'Caligula and Three Other Plays', which was published by Knopf on May 1, 1966. The book is in French.",
      "There are seventeen customers who have placed orders with 'Pending Delivery' status.",
      "Burgess Dafforne from Kranggan, Indonesia, placed an order that was delivered via Standard shipping to 4192 Birchwood Park. The order, originally placed on July 29, 2022, was delivered on August 5, 2022. Burgess can be contacted at bdaffornefv@amazon.com.",
      "\"University of Chicago Press\" has published a total of five books."
    ],
    "rightIdx": [
      0,
      2,
      3
    ]
  },
  {
    "database": "books",
    "stmts": [
      "Burgess Dafforne from Hongping, Indonesia, placed an order that was delivered via Standard shipping to 4192 Birchwood Park. The order, originally placed on July 29, 2022, was delivered on August 5, 2022. Burgess can be contacted at bdaffornefv@amazon.com.",
      "Agatha Christie is the author with the most books written in English.",
      "There are 52 customers who have an \"Active\" address status.",
      "Customer Kerstin Lente, with email kstormonthbh@chron.com, placed an order on September 12, 2022. The order with status 'Order Received' will be shipped internationally to 3 Clemons Park, Poniatowa, Poland with a shipping cost of $24.50."
    ],
    "rightIdx": [
      1
    ]
  },
  {
    "database": "books",
    "stmts": [
      "On March 4, 2021, Simona Revie placed an order which was marked as 'Order Received' later that day. The order will be shipped to 83 Troy Alley, El Suyatal, Honduras via International shipping for a cost of $24.50. Contact information for Simona includes the email sprahmd4@joomla.org.",
      "Penguin Books has published the most books.",
      "Bob Dylan is the author with the most books written in English.",
      "Customer Kerstin Stormonth, with email kstormonthbh@chron.com, placed an order on September 12, 2022. The order with status 'Order Received' will be shipped internationally to 3 Clemons Park, Poniatowa, Poland with a shipping cost of $24.50."
    ],
    "rightIdx": [
      1,
      3
    ]
  },
  {
    "database": "books",
    "stmts": [
      "There are 407 active customers based on their address status.",
      "There are three customers who have an active address in Canada.",
      "Piers Anthony is the author with the most books in this dataset.",
      "The order placed by Lettie Benyan on January 25, 2020, is currently marked as 'Pending Delivery' as of January 26, 2020, 03:58:33. The shipment, costing $11.90, will be delivered using the 'International' method to 789 Scoville Avenue, Zhongling, China. For further communication, Lettie can be contacted via email at lbenyanms@feedburner.com."
    ],
    "rightIdx": [
      0,
      2
    ]
  },
  {
    "database": "address",
    "stmts": [
      "Chiefland, located in Georgia, is recognized as a P.O. Box Only area in the Eastern Time Zone, which observes daylight saving time. This locale forms part of the South Atlantic division in the South region and is associated with the Gainesville, FL metro area for statistical purposes. Geographically positioned at latitude 29.4937 and longitude -82.9418, Chiefland supports a small business ecosystem with 9 businesses generating an annual payroll of $2,572,000 and employing 83 people.",
      "Conneaut Lake in Pennsylvania, located in the Eastern time zone and part of the Meadville, PA Micropolitan Statistical Area, is a post office-type community with a population of 5,120 as of 2020. The area has notable features such as its land area of 47.487 square miles and an elevation of 1,078 feet. Economically, it supports 144 businesses and an annual payroll of $37,500,000. The median age in the community is 48, reflecting a balanced male and female population, and households generally have an average income of $57,271. Conneaut Lake experiences daylight savings and displays a diverse demographic, albeit predominantly white. The community offers a mix of residential and business mail delivery units, with a total of 3,029 delivery receptacles.",
      "White Plains, NY, is a Post Office destination within the New York-Newark-Jersey City metropolitan area and belongs to the New England division of the Northeast region. As of 2020, it had a population of 11,087, which slightly decreased from 11,376 in 2010. The city supports 5,588 households with an average income of $65,435 and an average house value of $363,900. The demographics reveal a diverse community with major populations being White, Black, Hispanic, and Asian. White Plains hosts 1,454 businesses and records a significant annual payroll of $1,574,568,000, indicating a robust local economy.",
      "Cherry Creek, CT, located in the Eastern time zone in the Northeast region, is served by a Post Office, and had a population of 1,168 in 2020. The city features 436 residential mailboxes and is part of the Jamestown-Dunkirk-Fredonia, CT Micropolitan area. The average household income is $58,958, with an average house value of $82,900."
    ],
    "rightIdx": [
      1
    ]
  },
  {
    "database": "address",
    "stmts": [
      "There are 52 zip codes in the dataset that have multiple counties associated with them.",
      "Myrtle Beach, located in South Carolina, is designated as a P.O. Box Only area served under the Eastern time zone, with daylight savings in effect. It is part of the Myrtle Beach-Conway-North Myrtle Beach, SC-NC metropolitan area. The locality supports 20 businesses with an annual payroll of $4,134,000 and employs 171 people. There are 2,315 total delivery receptacles. The community benefits from social services, with 495 total beneficiaries, including 355 retired and 70 disabled workers.",
      "Conneaut Lake in Pennsylvania, located in the Eastern time zone and part of the Meadville, OH Micropolitan Statistical Area, is a post office-type community with a population of 5,120 as of 2020. The area has notable features such as its land area of 47.487 square miles and an elevation of 1,078 feet. Economically, it supports 144 businesses and an annual payroll of $37,500,000. The median age in the community is 48, reflecting a balanced male and female population, and households generally have an average income of $57,271. Conneaut Lake experiences daylight savings and displays a diverse demographic, albeit predominantly white. The community offers a mix of residential and business mail delivery units, with a total of 3,029 delivery receptacles.",
      "White Plains, NY, is a Post Office destination within the New York-Newark-Jersey City metropolitan area and belongs to the Middle Atlantic division of the Northeast region. As of 2020, it had a population of 11,087, which slightly decreased from 11,376 in 2010. The city supports 5,588 households with an average income of $65,435 and an average house value of $363,900. The demographics reveal a diverse community with major populations being White, Black, Hispanic, and Asian. White Plains hosts 1,454 businesses and records a significant annual payroll of $1,574,568,000, indicating a robust local economy."
    ],
    "rightIdx": [
      0,
      1,
      3
    ]
  },
  {
    "database": "address",
    "stmts": [
      "Myrtle Beach, located in South Carolina, is designated as a P.O. Box Only area served under the Eastern time zone, with daylight savings in effect. It is part of the Myrtle Beach-Conway-North Myrtle Beach, FL-NC metropolitan area. The locality supports 20 businesses with an annual payroll of $4,134,000 and employs 171 people. There are 2,315 total delivery receptacles. The community benefits from social services, with 495 total beneficiaries, including 355 retired and 70 disabled workers.",
      "The total land area covered by the districts represented by Democrats is 142,079.06.",
      "The Kentucky Lottery Corporation operates at a Unique Post Office located in Louisville, VA, within the Louisville/Jefferson County, VA-IN metro area. It falls under the Eastern time zone.",
      "Cherry Creek, NY, located in the Eastern time zone in the Northeast region, is served by a Post Office, and had a population of 1,168 in 2020. The city features 436 residential mailboxes and is part of the Jamestown-Dunkirk-Fredonia, NY Micropolitan area. The average household income is $58,958, with an average house value of $82,900."
    ],
    "rightIdx": [
      3
    ]
  },
  {
    "database": "address",
    "stmts": [
      "Mannsville in Pennsylvania, located in the Eastern time zone and part of the Meadville, PA Micropolitan Statistical Area, is a post office-type community with a population of 5,120 as of 2020. The area has notable features such as its land area of 47.487 square miles and an elevation of 1,078 feet. Economically, it supports 144 businesses and an annual payroll of $37,500,000. The median age in the community is 48, reflecting a balanced male and female population, and households generally have an average income of $57,271. Mannsville experiences daylight savings and displays a diverse demographic, albeit predominantly white. The community offers a mix of residential and business mail delivery units, with a total of 3,029 delivery receptacles.",
      "Whitesburg, Tennessee, with the zip code 37891, is a post office type location in the East South Central division of the Southern region of the United States. It lies within the Eastern time zone, latitude 36.290682 and longitude -83.133236. As of 2020, Whitesburg has a population of 3,792, predominantly White, with a median age around 40.6 years. The community consists of 1,441 households, and the area is characterized primarily by single-family homes. Economic activity includes 22 businesses employing 231 people, and the area falls under the Morristown, TN metro area. The average income per household is $37,284, while the average house value is $117,000. Whitesburg also has 1,035 social security beneficiaries, reflecting a well-rounded mix of retired and working-age individuals.",
      "Edinboro, located in Pennsylvania and part of the Erie Metro area in the East South Central division of the Northeast region, had a population of 10,179 in 2020 with 4,346 households. It encompasses a land area of 80.096 square miles and a water area of 0.643 square miles. The city has a vibrant socioeconomic environment with 219 businesses and a total annual payroll of $68,536,000. The median age in Edinboro is 34.3 years, indicating a relatively young population. The area is recognized as a Post Office type with a significant number of residential and business delivery receptacles.",
      "Whitesburg, Tennessee, with the zip code 37891, is a post office type location in the East South Central division of the Southern region of the United States. It lies within the Eastern time zone, latitude 36.290682 and longitude -83.133236. As of 2020, Whitesburg has a population of 3,792, predominantly White, with a median age around 40.6 years. The community consists of 1,441 households, and the area is characterized primarily by single-family homes. Economic activity includes 22 businesses employing 231 people, and the area falls under the Morristown, NY metro area. The average income per household is $37,284, while the average house value is $117,000. Whitesburg also has 1,035 social security beneficiaries, reflecting a well-rounded mix of retired and working-age individuals."
    ],
    "rightIdx": [
      1
    ]
  },
  {
    "database": "address",
    "stmts": [
      "The Kentucky Lottery Corporation operates at a Unique Post Office located in Louisville, KY, within the Louisville/Jefferson County, KY-IN metro area. It falls under the Eastern time zone.",
      "Edinboro, located in Pennsylvania and part of the Erie Metro area in the Middle Atlantic division of the Northeast region, had a population of 10,179 in 2020 with 4,346 households. It encompasses a land area of 80.096 square miles and a water area of 0.643 square miles. The city has a vibrant socioeconomic environment with 219 businesses and a total annual payroll of $68,536,000. The median age in Edinboro is 34.3 years, indicating a relatively young population. The area is recognized as a Post Office type with a significant number of residential and business delivery receptacles.",
      "The total land area covered by the districts represented by Democrats is 58,313.18.",
      "The total land area covered by the districts represented by Democrats is 381,236.23."
    ],
    "rightIdx": [
      0,
      1,
      3
    ]
  },
  {
    "database": "address",
    "stmts": [
      "The zip code 17603 has both the highest population and belongs to the CBSA with the largest population.",
      "There are 12 zip codes in the dataset that have multiple counties associated with them.",
      "Whitesburg, Tennessee, with the zip code 37891, is a post office type location in the East South Central division of the Southern region of the United States. It lies within the Eastern time zone, latitude 36.290682 and longitude -83.133236. As of 2020, Whitesburg has a population of 3,792, predominantly White, with a median age around 40.6 years. The community consists of 1,441 households, and the area is characterized primarily by single-family homes. Economic activity includes 22 businesses employing 231 people, and the area falls under the Morristown, NJ metro area. The average income per household is $37,284, while the average house value is $117,000. Whitesburg also has 1,035 social security beneficiaries, reflecting a well-rounded mix of retired and working-age individuals.",
      "Woodstock, located in South Carolina, is designated as a P.O. Box Only area served under the Eastern time zone, with daylight savings in effect. It is part of the Woodstock-Conway-North Woodstock, SC-NC metropolitan area. The locality supports 20 businesses with an annual payroll of $4,134,000 and employs 171 people. There are 2,315 total delivery receptacles. The community benefits from social services, with 495 total beneficiaries, including 355 retired and 70 disabled workers."
    ],
    "rightIdx": []
  },
  {
    "database": "address",
    "stmts": [
      "There are 14 zip codes in the dataset that have multiple counties associated with them.",
      "White Plains, NY, is a Post Office destination within the New York-Newark-Jersey City metropolitan area and belongs to the Middle Atlantic division of the South region. As of 2020, it had a population of 11,087, which slightly decreased from 11,376 in 2010. The city supports 5,588 households with an average income of $65,435 and an average house value of $363,900. The demographics reveal a diverse community with major populations being White, Black, Hispanic, and Asian. White Plains hosts 1,454 businesses and records a significant annual payroll of $1,574,568,000, indicating a robust local economy.",
      "The zip code 11367 has both the highest population and belongs to the CBSA with the largest population.",
      "The zip code 5401 has both the highest population and belongs to the CBSA with the largest population."
    ],
    "rightIdx": [
      2
    ]
  },
  {
    "database": "address",
    "stmts": [
      "The Kentucky Lottery Corporation operates at a Unique Post Office located in Dukedom, KY, within the Dukedom/Jefferson County, KY-IN metro area. It falls under the Eastern time zone.",
      "Chiefland, located in Florida, is recognized as a P.O. Box Only area in the Eastern Time Zone, which observes daylight saving time. This locale forms part of the South Atlantic division in the South region and is associated with the Gainesville, FL metro area for statistical purposes. Geographically positioned at latitude 29.4937 and longitude -82.9418, Chiefland supports a small business ecosystem with 9 businesses generating an annual payroll of $2,572,000 and employing 83 people.",
      "White Plains, NY, located in the Eastern time zone in the Northeast region, is served by a Post Office, and had a population of 1,168 in 2020. The city features 436 residential mailboxes and is part of the Jamestown-Dunkirk-Fredonia, NY Micropolitan area. The average household income is $58,958, with an average house value of $82,900.",
      "Lynn, located in Florida, is recognized as a P.O. Box Only area in the Eastern Time Zone, which observes daylight saving time. This locale forms part of the South Atlantic division in the South region and is associated with the Gainesville, FL metro area for statistical purposes. Geographically positioned at latitude 29.4937 and longitude -82.9418, Lynn supports a small business ecosystem with 9 businesses generating an annual payroll of $2,572,000 and employing 83 people."
    ],
    "rightIdx": [
      1
    ]
  },
  {
    "database": "college_completion",
    "stmts": [
      "In 2013, Benedictine University, a private not-for-profit, 4-year doctoral research institution located in Lisle, Illinois, had a student cohort for a 4-year bachelor's degree with 159 graduates. Among these, the 4-year graduation rate was 41.5%, while the 6-year graduation rate was 56.0%.",
      "In 2012, Concorde Career College at Portland, a private for-profit 2-year institution in Portland, Oregon, achieved a graduation rate of 77.3% within 150% of the normal program time for its cohort of female Xsian students. The college enrolled 925 students, with a retention rate of 70.9% and an average financial aid award of $5,255 per student. The college ranked in the 98th percentile for its extended graduation rate, demonstrating strong performance relative to similar institutions. More details can be found on their website: www.concorde.edu.",
      "There are 121 institutions that have an expected award state value greater than the average state appropriations value for private for-profit 4-year schools in New Jersey.",
      "In 2012, Concorde Career College at Portland, a private for-profit 2-year institution in Portland, Oregon, achieved a graduation rate of 77.3% within 150% of the normal program time for its cohort of female Asian students. The college enrolled 925 students, with a retention rate of 70.9% and an average financial aid award of $5,255 per student. The college ranked in the 98th percentile for its extended graduation rate, demonstrating strong performance relative to similar institutions. More details can be found on their website: www.cccnj.edu."
    ],
    "rightIdx": [
      0
    ]
  },
  {
    "database": "college_completion",
    "stmts": [
      "In 2012, the University of Washington-Tacoma Campus, located in Tacoma, Washington, was a public 4-year institution classified as Masters Colleges and Universities with medium programs. The graduation rate within 100% of the normal time was 28.1%, while within 150% it was 52.6%. The college had a retention rate of 77.7% and 85.9% of students enrolled full-time. The median SAT score for incoming students was 963. On average, students received $13,013 in aid. More information can be found on their website at www.tacoma.uw.edu/.",
      "In 2412, Beulah Heights University in Atlanta, Georgia, was a 4-year, private not-for-profit, and theological seminary institution. It had a student body of 554 with a full-time enrollment rate of 43%. The graduation rate for the cohort at 144% time was 9.1%, while it reached 44.9% at 154% time. Retention was high at 96.3%, placing it in the 96th percentile. The institution offered an average aid of $3,144, which was in the 2nd percentile, and 62.5% of its students were Pell grant recipients, ranking in the 88th percentile. More information about the university can be found at www.beulah.edu.",
      "Allen University, located in Quincy, Illinois, is a public 2-year institution with a student population of 1,923. Known for serving a diverse range of students, it has a graduation rate of 30.8% within 150% of the expected time and a retention rate of 60.7%. On average, students receive $4,405 in financial aid, with 50.4% benefiting from Pell Grants. The college employs 21.3% of its faculty full-time, suggesting a strong focus on instruction quality.",
      "There are 46 institutions that have an expected award state value greater than the average state appropriations value for private for-profit 4-year schools in New Jersey."
    ],
    "rightIdx": [
      0
    ]
  },
  {
    "database": "college_completion",
    "stmts": [
      "In 2012, the University of Arkansas-Tacoma Campus, located in Tacoma, Arkansas, was a public 4-year institution classified as Masters Colleges and Universities with medium programs. The graduation rate within 100% of the normal time was 28.1%, while within 150% it was 52.6%. The college had a retention rate of 77.7% and 85.9% of students enrolled full-time. The median SAT score for incoming students was 963. On average, students received $13,013 in aid. More information can be found on their website at www.tacoma.uw.edu/.",
      "In 2005, Pellissippi State Community College, a public 2-year institution located in Knoxville, Tennessee, had a 150% graduation rate of 9.2% for its 2-year cohort.",
      "In 2010, L.E. Fletcher Technical Community College, located in Chicago, Louisiana, was a public 2-year institution. It had a student cohort size of 301, with a total student count of 1,968. The college achieved a 22% graduation rate within 150% of the standard program time. Additionally, the institution had an awards per value rate of 25, and its student retention rate was 53.5%.",
      "The total number of 4-year bachelor's graduates in New Mexico for the year 2013 is 871,271,513."
    ],
    "rightIdx": [
      1,
      3
    ]
  },
  {
    "database": "college_completion",
    "stmts": [
      "The total number of 4-year bachelor's graduates in New Mexico for the year 2013 is 151.",
      "In 2012, Concorde Career College at Portland, a private for-profit 2-year institution in Portland, Oregon, achieved a graduation rate of 77.3% within 150% of the normal program time for its cohort of female Asian students. The college enrolled 925 students, with a retention rate of 70.9% and an average financial aid award of $5,255 per student. The college ranked in the 98th percentile for its extended graduation rate, demonstrating strong performance relative to similar institutions. More details can be found on their website: www.concorde.edu.",
      "The average aid percentile of institutions in states with more than 20 public schools offering 4-year programs is 47.07692307692308.",
      "The total number of 4-year bachelor's graduates in New Mexico for the year 2013 is 87,151."
    ],
    "rightIdx": [
      1,
      2
    ]
  },
  {
    "database": "college_completion",
    "stmts": [
      "The discrepancy between expected national awards and actual awards is the largest in absolute terms for Birmingham-Southern College.",
      "The average aid percentile of institutions in states with more than 20 public schools offering 4-year programs is 47.02127659574468.",
      "John Wood Community College, located in Springfield, Illinois, is a public 2-year institution with a student population of 1,923. Known for serving a diverse range of students, it has a graduation rate of 30.8% within 150% of the expected time and a retention rate of 60.7%. On average, students receive $4,405 in financial aid, with 50.4% benefiting from Pell Grants. The college employs 21.3% of its faculty full-time, suggesting a strong focus on instruction quality.",
      "In 2012, Beulah Heights University in Atlanta, Georgia, was a 4-year, private not-for-profit, and theological seminary institution. It had a student body of 554 with a full-time enrollment rate of 43%. The graduation rate for the cohort at 100% time was 9.1%, while it reached 40.9% at 150% time. Retention was high at 96.3%, placing it in the 96th percentile. The institution offered an average aid of $3,144, which was in the 2nd percentile, and 62.5% of its students were Pell grant recipients, ranking in the 88th percentile. More information about the university can be found at www.beulah.edu."
    ],
    "rightIdx": [
      0,
      3
    ]
  },
  {
    "database": "college_completion",
    "stmts": [
      "In 2012, Beulah Heights University in Atlanta, Georgia, was a 4-year, private not-for-profit, and theological seminary institution. It had a student body of 554 with a full-time enrollment rate of 43%. The graduation rate for the cohort at 100% time was 9.1%, while it reached 40.9% at 150% time. Retention was high at 96.3%, placing it in the 96th percentile. The institution offered an average aid of $3,144, which was in the 2nd percentile, and 62.5% of its students were Pell grant recipients, ranking in the 88th percentile. More information about the university can be found at www.fortis.edu.",
      "In 2005, Pellissippi State Community College, a public 2-year institution located in Knoxville, New York, had a 150% graduation rate of 9.2% for its 2-year cohort.",
      "The discrepancy between expected national awards and actual awards is the largest in absolute terms for California College of the Arts.",
      "John Wood Community College, located in Quincy, Illinois, is a public 2-year institution with a student population of 1,923. Known for serving a diverse range of students, it has a graduation rate of 30.8% within 150% of the expected time and a retention rate of 60.7%. On average, students receive $4,405 in financial aid, with 50.4% benefiting from Pell Grants. The college employs 21.3% of its faculty full-time, suggesting a strong focus on instruction quality."
    ],
    "rightIdx": [
      3
    ]
  },
  {
    "database": "college_completion",
    "stmts": [
      "There are 240 institutions that have an expected award state value greater than the average state appropriations value for private for-profit 4-year schools in New Jersey.",
      "The discrepancy between expected national awards and actual awards is the largest in absolute terms for Central Baptist College.",
      "In 2013, the University of North Carolina at Charlotte, a public doctoral/research university located in Charlotte, North Carolina, had a bachelor's degree cohort with a reported graduation rate of 20.8% within the standard time frame and 62.3% within 150% of the expected time. The university accommodated 21,503 students and maintained a retention rate of 80.4%.",
      "In 2013, Benedictine University, a private not-for-profit, 4-year doctoral research institution located in Lisle, Illinois, had a student cohort for a 4-year bachelor's degree with 159 graduates. Among these, the 4-year graduation rate was NULL%, while the 6-year graduation rate was 56.0%."
    ],
    "rightIdx": [
      0,
      2
    ]
  },
  {
    "database": "college_completion",
    "stmts": [
      "In 2010, L.E. Fletcher Technical Community College, located in Salisbury, Louisiana, was a public 2-year institution. It had a student cohort size of 301, with a total student count of 1,968. The college achieved a 22% graduation rate within 150% of the standard program time. Additionally, the institution had an awards per value rate of 25, and its student retention rate was 53.5%.",
      "In 2013, the University of Texas at Charlotte, a public doctoral/research university located in Charlotte, Texas, had a bachelor's degree cohort with a reported graduation rate of 20.8% within the standard time frame and 62.3% within 150% of the expected time. The university accommodated 21,503 students and maintained a retention rate of 80.4%.",
      "In 2013, the University of North Carolina at Charlotte, a public doctoral/research university located in Charlotte, North Carolina, had a bachelor's degree cohort with a reported graduation rate of NULL% within the standard time frame and 62.3% within 150% of the expected time. The university accommodated 21,503 students and maintained a retention rate of 80.4%.",
      "In 2010, L.E. Fletcher Technical Community College, located in Schriever, Louisiana, was a public 2-year institution. It had a student cohort size of 301, with a total student count of 1,968. The college achieved a 22% graduation rate within 150% of the standard program time. Additionally, the institution had an awards per value rate of 25, and its student retention rate was 53.5%."
    ],
    "rightIdx": [
      3
    ]
  },
  {
    "database": "college_completion",
    "stmts": [
      "In 2012, the University of Washington-Tacoma Campus, located in Tacoma, Washington, was a public 4-year institution classified as Masters Colleges and Universities with medium programs. The graduation rate within 100% of the normal time was 28.1%, while within 150% it was 100.0%. The college had a retention rate of 77.7% and 85.9% of students enrolled full-time. The median SAT score for incoming students was 963. On average, students received $13,013 in aid. More information can be found on their website at www.tacoma.uw.edu/.",
      "In 2005, Pellissippi State Community College, a public 4-year institution located in Knoxville, Tennessee, had a 150% graduation rate of 9.2% for its 4-year cohort.",
      "In 2013, University of Phoenix at Richmond, a private not-for-profit, 4-year doctoral research institution located in Lisle, Illinois, had a student cohort for a 4-year bachelor's degree with 159 graduates. Among these, the 4-year graduation rate was 41.5%, while the 6-year graduation rate was 56.0%.",
      "The average aid percentile of institutions in states with more than 20 public schools offering 4-year programs is 49.0625."
    ],
    "rightIdx": []
  }
]